[
    {
        "file_name": "8.MY CITY - PHASE II - CLUSTER 4.pdf",
        "text": "Page 1 of 6 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \nCOMPLAINT NO. CC006000000054832   \nBHANUDAS NARAYAN SHINDE  …COMPLAINANT  \n \nVS \n  HORIZON PROJECTS PVT . LTD . …RESPONDENT /S \n \nMAHARERA PROJECT REGISTRATION NO.  P51700008440  \nOrder  \nJuly 04, 2023 \n(Date of hearing - 26.04.2023  matter was reserved for order ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nComplainant present in person  \nAdvocate Abir Patel present for the Respondent   \n \n1. The Complainant  is hom e buyer and Allottee  within the meaning of Section 2(d) of \nthe Real Estate (Regulation and Development) Act, 2016  (hereinafter referred to as \nthe “said Act ”) of Real Estate Regulatory Authority (hereinafter referred to as the \n“RERA ”) and the Respondent  is the Promoter/Developer  within the meaning of \nSection 2(zk) of the said Act . The Responden t is registered as the Promoter s of the \nProject namely  “MY CITY - PHASE II - CLUSTER 4 ” under section 5 of the said Act \nbearing MAHARERA Project  Registration No. P51700008440  (hereinafter referred \nto as the “ said Project ”).  \n \n2. On the MahaRERA Project registration webpage the proposed completion date  is \n31.12.2027 and the revised completion date  is mentioned as  31.12.2028 . The said \nProject is an ongoing Project.  \n \n3. The Complainant  is seeking the following reliefs:  \nQUOTE  \n“The promoter may be directed to — Page 2 of 6 \n a) not to cancel the booking of the allottee until a final decision of the present  complaint; S.36  \nb) mention and annex with agreement identity and authority proof of the authorized  \nsignatory; because only authorized can sign the agreement S.37  \nc) prepare the agreement for sale as per the cost sheet provided by the promoter;  S.37 \nd) mention the clubhouse charges as Rs . 45,000/ - for the lifetime of the family  members of the \nallottee without any further subscriptions; S.37  \ne) clearly mention details of covered car parking including its cost/charges, location,  etc; S.37  \nf) not to charge any penalty to the allottee for the  payment till the agreement is  registered; \nS.13(1)  \ng) compensate allottee with Rs. 50,000/ - for harassment and wastage of work time of  allottee \ndue to fault of the Promoter. S.12  \nh) give any other relief or compensation to allottee as found suitable by the  Court/Authority. \nS.37”  \n \nUNQUOTE  \n \n4. The complaint was heard on 11.04.2023  wherein the following roznama was passed \nby this Authority:  \n“Complainant states that in 2018, he booked a premise for a total consideration of  around 40 \nLakhs out of which he has paid around 3.24 Lakhs. Subsequently the  developer asked him for \nmore money but the Complainant refused to pay more than  10% without registration. Stamp \nduty was demanded and paid by him. A draft  Agreement for Sale was given to the \nComplainant which was be yond the standard  Agreement for Sale of RERA and having no \ntime to read the same, the Complainant  did not execute the instrument. The Complainant \nnow seeks to stay in the project  and seeks that the Agreement for Sale should be in keeping \nwith the Booking L etter and the Cost Sheet given to him. Complainant avers that there are \nmajor deviations  in the draft Agreement for Sale from the Cost Sheet that was given to him. \nHe especially points out the issues relating to the clubhouse and parking. Complainant  seeks  \nearly possession and is ready to deposit the remaining amounts.  \n \nThe Respondent avers that OC was received in 2022. The Respondent has paid  around 1.58 \nLakhs and apart from this, certain amounts towards taxes. The  Respondent further avers that \nthe cost sh eet handed over were only estimates and  were subject to revision at the time of \npossession. GST refund or credit cannot be  considered as these are taxes and go directly to the \nappropriate authority. The  parking is a covered car parking and the same has been identified \nand shown. The  Respondent further avers that as per the demand of the Complainant, they \nhave stated that the clubhouse charges are onetime charges. The Respondent also avers  that \nthe terms offered to the present Complainant are similar to t he terms offered to  the other \nallottees. The Respondent has sent a draft Agreement to the Complainant  a number of times.  \n \nThe Complainant states that the Agreement is not in keeping with what is being said  and that \nit should match the cost sheet given to h im. \n \nThe Respondent further reiterates that RERA cannot adjudicate on a commercial  bargaining \nand the terms set out.  \n Page 3 of 6 \n The Complainant avers that they were not given draft agreement in advance and the  same \nwas handed over to him only at the time of executio n. \n \nParties are at liberty to file written submissions, if any, by 15.05.2023. Subsequent  to which, \nthe matter will be reserved for orders. ”  \n \n      \n5. The brief facts  and submissions of the Complainant  is as follows:  \na. That the  complaint was filed on  18.11.2019 . \nb. That o n 19.05. 2018, the Complainant  booked a flat in the  said Project by paying \nRs.54 ,000/ - but subsequently, the Complainant requested an up-gradation from  1 \nBHK1 flat to 2  BHK in the same said P roject towards which an additional  payment  \nof Rs.1,16,696/ - was made . \nc. That on 24.10. 2018, the Complainant  received a confirmation email with the cost \nsheet for the 2  BHK flat in the said P roject  bearing fla t No. 406, in tower No. 9  \n(hereinafter referred to as the  “said apartment ”). \nd.  That the Respondent vide  a letter dated 15.06. 2019, demand ed Rs. 1,52,000/ - \ntowards the stamp duty and registration charges  which was paid on 27.06.2019 by \nthe Complainant . \ne. That on 05.09.2019  while the Complainant was ready for registration of the \nagreement for sale, the version of the agreement was totally different from the \nspecimen agreement with  a lot of ambiguities and was also contradictory to the \ncost sheet and the negotiations made  at time of booking the flat.  That the \nComplainant brought these  ambiguities and contradictions to the notice of Mr. \nAniket Kamble, the representative of the Promoter, but he denied rectifying it. \nHence, the Complainant had to return from the registration offic e without \nregistering  /executing the agreement for sale.  \nf. That the Complainant has paid Rs.3,22,969 /- to the Respondent  Promoter.  \ng. That c onsidering para 8.3.1, 8.3.3 and Annexure -I of the draft of agreement for sale  \nwhich was to be registered,  it can be concluded that the  Respondent wants to \nextract , multiple and  exaggerated amount by fraud in name of club charges, \n \n1 BHK – Bedroom Hall Kitchen  Page 4 of 6 \n namely,  membership fee/charges, yearly subscription, usage charges and  \nmonthly maintenance charges (extra for club).  \nh. That the representative of the Respondent threatened to cancel the booking and \nforfeit booking amount  (including stamp duty and registration charges) . \ni. That the Respondent has violated Se ctions 4, 7, 11, 12, 13 , etc. of RERA  and is \naggrieved by the unfair, fraud ulent,  and coercive practices adopted by the \nRespondent.  \nj. Therefore, the Complainant seeks amendment in draft of agreement for sale, \nexecution of amended agreement for sale and possession  of the said apartment  \nalong interest and compensation for delayed possession and mental harassment.  \n \n6. The brief submissions of the Respondent are as follows:  \na. The Respondent submits that the construction of the said apartment  is 100% \ncompleted by Respondent in all aspect on or about 2019 and kept ready with \npossession since then. The light meter installed as on 01 .05.2019. It is noted that \nlight meter has been installed after the construction has been completed.  \nb. That one soci al activists ’ for his personal interest, have filed writ petition against \nthis Respondent in NGT Court, for disturbing Respondent ’s progress of work of \nthe said Project. Also , the Respondent have obtained stay order from Hon'ble \nSupreme Court for the same and the said petition is in pendency stage, due to \nwhich Pune Municipal Corporation ha d held the OC for the units of the \nComplainant along with other flat Allotees of the Respondent .  \nc. That t he main reason for not handing the possession to the Complainant is the \nNGT case, which is beyond control of this Respondent, also the Respondent have \nintimated the Complainant for the same.  \nd. That on 22.12.2021  both the Respondent and Complainant appeared before \nconciliation forum for arising on amicable solution, and thus after due discussion \nwith the forum, wherein this Respondent in spite  of not having sound financial \ncondition, still offered Rupees five lakhs as a lump sum amount of compensation \nto Complainant, but unfortunately there was no positive response from the \nComplainant .  Page 5 of 6 \n e. That the Respondent has blocked the said apartment for the past 5 years with only \n4% of consideration being paid by the Complainant towards the said apartment. \nThus, Complainant has misused the limit of 10% as stipulated under Section 13 \nand avoided making  payments .  \nf. That OC of the said apartment was received on 19.05.2022 and thus, the \nComplainant is in arrears of balance consideration along with interest for delay in \npayment of the same. The last payment date of the Complainant was 06.08.2018.  \n \n7. From the submissions of the Parties the primary issue / relief sought is that the \nComplainant is seeking to stay in the said Project. The complainant is also seeking \ndirection with respect to no cancellation of the booking of the said apartment . He has \nalso sought that the agreement for sale be executed as per the cost sheet exchanged \nby the Respondent for the said apartment. In this context it is pertinent to note there \nis no proper allotment letter issued by the Respondent with regard to the terms and \nconditions of the said apartment. Further the advances paid by the Complainant only \nconstitute 4% o f the total consideration amount. Further the cost sheet exchanged \nbetween the Parties pertains to 2018 and the same is not an executed contract or a \npromise. T hese were given only as an estimate of the likely cost.   \n \n8. It is an admitted fact that there is no agreement for sale on record . Further it is also \nadmitted that the Complainant  has not paid even 10% of the consideration amount. \nThe Complainant  is hence not able to demonstrate his locus standi in the case.  The \nComplainant is raising grievances and making allegations of unfair fraudulent and \ncoercive practises without any substan tial documents on record. The Authority notes \nwith concern that the Complainant has attempted to raise a complaint based on \nunsubstantiated allegations.  The Authority does not appreciate such stone throwing \nexpeditions which only delay the work of the Aut hority. Such frivolous and \nunsubstantiated complaints tend  to slow down the disposal of cases of genuine \nlitigants.  The Authority would impose a cost on such litigation so as to discourage \nthe same.  \n Page 6 of 6 \n 9. In view of the above, the complaint is dismissed  and the Complainant is hereby \ndirected to deposit Rs.10,000/ - with the MahaRERA office as cost.  \n \n  (Ajoy  Mehta)  \n      Chairperson, MahaRERA"
    },
    {
        "file_name": "10.KANAKIA RAINFOREST.pdf",
        "text": "Page 1 of 1 \n BEFORE THE MAHARASHTRA  \n \nREAL ESTATE REGULATORY AUTHORITY, MUMBAI  \n \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n          \nCOMPLAINT NO. CC006000000292565  \n \n KAMLESH KUMAR GUPTA   \n…COMPLAINANT  \n \nVS \n \nKANAKIA SPACES PVT. LTD  …RESPONDENT  \n \nMAHARERA PROJECT REGISTRATION NO. P51800000224  \n \nOrder  \nOctober 31, 2023  \n(Date of Hearing:  25.10.2023 ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \n None  present for Complainant /s \nRepresentative present for the Respondent /s \n \n1. The Complainant in the captioned complaint informs the Authority \nthat the captioned matter is amicably settled.  \n2. It is observed that the conciliation success report dated 20.08.2023 is \non record.  \n3. On perusal of last roznama  dated 10.08.2023 it was recorded that ; if \nthe Complainant  in the captioned complaint  does not remain present  \nthen,  the Authority shall proceed to pass the final order  in the \ncaptioned complaint.  \n4. In view of the above facts on record, the matter stands disposed as \namicably settled.  \n \n \n \n \n \n \n \n(Ajoy Mehta ) \nChairperson MahaRERA"
    },
    {
        "file_name": "9.AVENUE 54.pdf",
        "text": "Page 1 of 20 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \n1. COMPLAINT NO. CC006000000192247  \nGUNVEEN SAHNI    …COMPLAINANT  \na/w  \n2. COMPLAINT NO. CC006000000193809  \nKAMOLIKA PERES     …COMPLAINANT  \na/w  \n3. COMPLAINT NO. CC006000000195874  \nMOHAN BALDEV DODEJA  &  \nANITA MOHAN DODEJA     \n…COMPLAINANT S \na/w  \n4. COMPLAINT NO. CC006000000196158  \nMOHAMMED ASLAM BHATI   …COMPLAINANT  \na/w  \n5. COMPLAINT NO. CC006000000196162  \nNADIM MOHAMMED IQBAL BHATI  …COMPLAINANT  \n a/w  \n6. COMPLAINT NO. CC006000000197375  \nMR. AVINASH GANDHI &  \nMRS. SAANIKA GANDHI   \n…COMPLAINANT S \na/w  \n7. COMPLAINT NO.  CC006000000197610  \nRAHUL DESAI   …COMPLAINANT  \na/w  \n8. COMPLAINT NO. CC006000000197812  \nMR. BRIJESH SUJAN     …COMPLAINANT  \na/w  \n9. COMPLAINT NO.  CC006000000198438  \nMR. OSWALD ALFONSO &  \nMRS. SUNITA ALFONSO     \n…COMPLAINANT S \na/w  \n10. COMPLAINT NO. CC006000000210258  \nKAMAL NANDLAL RAWTANI    …COMPLAINANT  \na/w  \n11. COMPLAINT NO. CC006000000220945  \nAJIT MADANCHAND DUGAR     …COMPLAINANT  Page 2 of 20 \n  \nVS \n1. SUMER RADIUS REALTY PVT. LTD.  \n2. SUMER BUILDCORP PVT. LTD.  \n3. RADIUS ESTATE PROJECTS PVT. LTD .   \n…RESPONDENT  NOS . \n1 & 3  \n \nMAHARERA PROJECT REGISTRATION NO. P51800007149  \nOrder  \nJanuary  05, 202 3 \n(Date of hearing  as mentioned in para  No.3 hereinbelow  \n where by the matters were reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Vikramjit Garewal a/w Ruchi Magoo for Complainant@ Sr. No. 1  \nAdvocate Aniket Nerurkar for Complainant @ Sr. No. 2   \nAdvocate Amruta Ghone for Complainant s @ Sr. No. 3   \nAdvocate Shreya Dholakia for Complainant @ Sr. No s. 4 & 5 \nAdvocate Tanuj Lodha for Complainant s @ Sr. No s. 6 to 8 \nAdvocate Parth Chande for Complainant s @ Sr. N o. 9 \nAdvocate Vikramjit Garewal for Complainant @ Sr. No.  10 \nAdvocate Karamveer S ningh for Complainant @ Sr. No.  11 \nNone present for Respondent s @ Sr. Nos. 1 to 11 \n \n1. The Complainants are home buyers and Allottees within the meaning of Section \n2(d) of the Real Estate (Regulation and Development) Act, 2016 (hereinafter \nreferred to as the “ said Act ”) of Real Estate Regulatory Authority (hereinafter \nreferred to as the “ RERA ”) and the Respondent  Nos. 1 to 3  are the \nPromoter s/Developer s within the meaning of Section 2 (zk) of the said Act. The \nRespondent Nos. 1 is registered as the Promoter of the Project namely “ AVENUE \n54” under section 5 of the said Act bearing MAHARERA Project  Registration \nNo. P51800007149  (hereinafter referred to as the “ said Project ”). The Respondent \nNos. 2 & 3 are the co -Promoter s of the said Project and are holding valid title of \nthe land as per Form B submitted while seeking registration of the said Project.  \nOn the MahaRERA Project registration webpage the proposed completion date \nof the said Project is mentioned as  31.12.2022 , revised proposed completion date \nis mentioned as 30.12.2024.   \n   \n2. The Complainants are seeking the following reliefs:   Page 3 of 20 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n1. CC006000000192247  a) this Hon’ble Authority be pleased to pass an order thereby \ndirecting the Respondents to pay to the Complainant a sum of Rs. \n3,68,84,911/ - (Rupees Three Crores Sixty -Eight Lakhs Eighty -Four \nThousand Nine Hundred and Eleven Only) which is inclusive of \ninterest of Rs. 29,81,631/ - (Rupees Twenty -Nine Lakhs Eighty -One \nThousand Six Hundred and Thirty -One only) as more particularly \nset out in the Particulars of Claim @ Annexure “G” and further \ninterest calculated @ 15% p.a. on Rs. 3,39,03,280/ - (Rupees Three \nCrores Thirty -Nine Lakhs Three Thousand Two Hundred and \nEighty Only), from the date of filing of the present matter till the date \nof actual payment/realization;  \nb) that this Hon’ble Authority be pleased to pass an order thereby \nimposing a cost of Rs. 25,00, 000/- (Rupees Twenty -Five Lakhs Only) \non the Respondents for the hardship and losses suffered by the \nComplainant as a result of the false and incorrect information \nprovided by the Respondents and in light of the intentional breach \nand default of the terms and conditions of the terms sheets as well as \nthe provisions as contained in the present Act;  \nc) For costs; and  \nd) for such other and further reliefs as this Hon’ble Authority may \ndeem fit and proper.  \n2. CC006000000193809  1. That u/s 12 of the MAHARERA Act, the Complainants demands \nthat their advance part consideration amount of Rs. 2,41,05,000/ - \ngiven to Respondent/Promoter to be returned along with interest as \nthey want to withdraw from the project as the Respondent/Promo ter \nSUMER RADIUS REALITY PRIVATE LIMITED (Respondent \nherein) Mr. Anil Chhabria, Authorised Signatory in the Affidavit \ncum Declaration duly notarized dated 31st July 2017 (uploaded by \nthe Promotor on the MAHARERA WEBSITE) and in the “NOTE \nON TITLE OF PROJEC T” dated 29/07/2017 (uploaded by the \nPromotor on the MAHARERA WEBSITE) wrongly stated that he \nhas Developing rights through an Unregistered Development \nAgreement dated 29/06/2017 over Plot bearing CTS numbers H/401, \nH/402, and H/415 to H/438 of village Ban dra and also has misled the \nComplainants in the Application Form dated 28/07/2018 that the \nRespondent/Promotor has Developing rights over Plot bearing CTS \nnumbers H/401, H/402, and H/415 to H/438 of village Bandra.. As \nmentioned in the Order given by the H IGH COURT OF BOMBAY, \nWRIT PETITION NO. 6996 of 2013 between DR. ARJUN \nSITARAM NITINWAR V/S Mr. Rama Sakharam Parad and others, \nan Unregistered Development Agreement do not create any \nDevelopment rights over the Plot under Section 17 (1) (b) of the \nRegistra tion Act and thus the said Respondent/Promoter has no \nright to take the Part Consideration into his sole account and has no \nlegal right to enter into an Registered Agreement for Sale for the sale \nof Flat No. 1505 on the 15th floor with the Complainant.  \n2. That the Complainants demand for a Compensation under Section \n18(2) on the part consideration advanced to the Developer of Rs. \n2,41,05,000/ - as there is an defect in title over plot bearing CTS \nnumbers H/401, H/402, H/415 to H/438 of village Bandra (Catho lic \nSociety Property) as the Respondent has no Development rights over \nthe said plot premises as on date and as there is no Registered \nDevelopment Agreement, the said Promoter has no right to enter into \nan Registered Agreement for Sale with the Complainant .  Page 4 of 20 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n3. As the Developer/Respondent has also breached Section 13 (1), 11 \n(3) and 4 (2) of the MAHARERA Act, the Complainants intend to \nwithdraw from the project with the entire advance part consideration \nof Rs. 2,41,05,000/ - been refunded back with interest.   \n4. The Complainants also pray for the Compensation for the mental \ntension and harassment they are going through as the said Project is \ncompletely stalled form January 2019.  \n5. The Complainants wants to withdraw from the Project with the \nentire advance part consideration paid of Rs. 2,41,05,000/ - been \nrefunded back with interest as their have been constant false \nPromises made by the Respondent/Developer that the project is set to \nbe completed in the 1st Quarter of 2020. Proofs of Emails attached \nand Uploaded.  \n3. CC006000000195874  (i) That the Hon’ble Authority may please to direct the Respondent \nNo.1 to refund to the Complainants a sum of Rs. 63,50,410/ - ( Rs. \nSixty Three lacs Fifty Thousand Four hundred and ten Only) (as per \nExhibit U) alongwith  an interest as determined by the Hon’ble \nAuthority from the date of payment made to the Respondent No.1 till \nthe date of realization of the entire amount to the Complainants and \nRs. 6,18,81,990/ - (Rs. Six crores Eighteen lakh Eighty one thousand \nNine hund red and Ninety) alongwith the applicable bank interest to \nthe Respondent No.4;  \n(ii) That this Hon’ble Authority may please to direct the Respondent \nNo.1 to terminate/cancel the Allotment/Confirmation letter dated \n14th June, 2017 alongwith the Booking Form  dated 28th April, 2027; \n(iii) That this Hon’ble Authority may pleased to direct the \nRespondent No.1 & 4 to duly terminate the Tripartite Loan \nAgreement and other ancillary documents executed alongwith it;  \n(iv) That this Hon’ble Authority may pleased to d irect the \nRespondent No.1 to pay compensation of Rs. 3,00,000/ - (Three lacs \nonly) to the Complainants towards the cost of litigation;  \n(v) That this Hon’ble Authority may pleased to direct the Respondent \nNo.1 to pay compensation of Rs. 10,00,000/ - (Rs. Ten  lacs only) to \nthe Complainants towards the mental & physical hardship as the \nComplainants have suffered a damage to their CIBIL score;  \n(vi) Further relief to the Complainants as may be deemed fit and \nproper under the circumstances of the case.  \n4.  \n \nCC006000000196158  \n \n a) To order the respondent to register the agreement by adhering to \nrules and regulations of MAHA RERA.  \nb) Hon’ble authority may direct the respondent to give time schedule. \nc) To restrain the respondent from creating third party right s. d) \nRespondent be imposed a heavy penalty for violating the RERA rules \nand regulations  \ne) Respondent be directed to refund the cost of litigation incurred on \nthe current complaint.  \nf) The Respondent be directed to strictly adhere to Real Estate \nRegulat ion and Development Act,2016 and its Rules and \nRegulations.  \ng) Any other relief as this Hon’ble Authority may deem fit and \nproper;  5. CC006000000196162  \n6. CC006000000197375  (a) That the Respondent No. 1 be directed to execute the Agreement \nfor Sale in respect of the said Flat and hand over possession of the \nsaid Flat to the Complainants within a stipulated time period;  \nor In the alternative: - Page 5 of 20 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n(b) The Respondent Nos. 1 and 2 be ordered and directed to refund \nto the Complainants the said sum of Rs.1,75,00,000/ - (Rupees One \nCrore Seventy Five Lakhs Only) along with interest thereon @ 18% \np. a. from 14.03.2016 till payment of realisation; The Complainants \nseek relief under Sectio n 13 of the Real Estate (Regulation and \nDevelopment) Act, 2016 praying that an Agreement of Sale must be \nexecuted between the parties failing which the Booking Amount be \nrefunded to the Complainants.  \n7. CC006000000197610  i. That, the Complainants be allow ed to withdraw from the said \nproject and the Respondent No.1 be directed to a. refund to the \nComplainants amount of Rs. 65,47,768/ - paid to towards flat \nconsideration along with interest and compensation and b. refund to \nRespondent No.2 the total amount of  Home Loan disbursed towards \nflat consideration.  \n ii. That the Respondent No.1 be directed to settle Respondent No.2 \nin full for funds received towards loan under subvention and relieve \nthe Complainants of any obligation towards Respondent No.2.  \niii. The Respondent No.1 be directed to furnish security c heques, FD \netc. required by Respondent No.2 to release the security cheques, FD \netc. of the Complainants with Respondent No.2.  \niv. That the Respondent No.1 be directed to Indemnify the \nComplainants against any future liability from Respondent No.2.  \nv. The Respondent No.1 be directed to pay Rs 10,00,000 towards \nmental harassment and Rs 5,00,000 towards costs  \nvi. The Respondent No.1 be penalized 5% for project cost for \nviolating various provisions of RERA act. (S.7, S.12, S.18 read with \nS.61 of RERA A ct)  \nvii. That as per the provisions of section 69 of RERA Act 2016, the \npromoters, directors, key management personnel of Respondent be \npunished for the offences they have committed under the Act. viii. \nThat, the Hon’ble MAHARERA to protect the interest o f the \nComplainant, provide any other relief provided under the Real Estate \n(Regulation and Development Act), 2016.  \n8. CC006000000197812  (a) That the Respondent No. 1 be directed to execute the Agreement \nfor Sale in respect of the said Flat and hand over p ossession of the \nsaid Flat to the Complainant within a stipulated time period;  \nor In the alternative: -  \n(b) The Respondent Nos. 1 and 2 be ordered and directed to refund \nto the Complainant the said sum of Rs.2,50,00,000/ - (Rupees One \nCrore Seventy Five La khs Only) along with interest thereon @ 18% \np. a. from 07.03.2016 till payment of realisation;  \n9. CC006000000198438  (a) To refund the full amount of Rs. 2,00,00,000/ - (Rupees Two \nCrore Only) paid by the complainants till date against the purchase \nof Resid ential Flat no. 1603 situated at 16th Floor in Tower No. 3, \narea admeasuring 137.03 Sq. Mtrs carpet area which is equivalent to \n1475 Sq. Ft, in the project known as ‘AVENUE 54’ at Andheri, at \nPlot bearing Plot no. 401, 402, 415 to 438, Swami Vivekanand Roa d, \nSantacruz west 400054.  \n(b) To pay interest as per the Rule from the date of payments till full \nrefund has been made. The interest calculated till filing of this \ncomplaint is Rs. 53,51,178/ -  \n(c) To further pay interest of Rs. 1,47,945/ - for every month of delay \ntill the full amount paid by the Complainants is refunded.  \n(d) To pay an amount of Rs 10,00,000/ - as compensation towards \npayment of, hardship, mental agony, caused to the complainants  and Page 6 of 20 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nmisrepresentation, the wrongful and illegal acts and misconduct on \nrespondents’ part;  \n(e) To direct the Respondents to refund any amount that have \nappropriated by the Respondent as interest charges.  \n(f) To not deduct/forfeit any amount as cancellati on fees towards the \ncancellation of allotment of the said flat.  \n(g) To restrain from creating third -party rights over the Said Flat till \nfull refund has been made.  \n(h) Legal Cost  \n(i) And any other or further relief(s)/advice as this Hon’ble Authority \nmay deem fit and proper in the light of the circumstances of the case.  \n10. CC006000000210258  a) That this Hon’ble Authority be pleased to declare that the MOU \nhas been validly rescinded by the Complainant;  \nb) That the Respondent be directed to deposit and/o r secure the \nbenefit of the Complainant the sum of Rs. 24,46,56,376/ - (Rupees \nTwenty Four Crores Forty Six Lakhs Fifty Six Thousand Three \nHundred Seventy Six only) being the principal sum of Rs. \n11,70,55,555/ - (Rupees Eleven Crores Seventy Lakhs Fifty Five  \nThousand Five Hundred and Fifty Five only) alongwith the sum of \nRs. 12,76,00,821/ - (Rupees Twelve Crores Seventy Six Lakhs Eight \nHundred and Twenty One only) towards interest at the rate of 18% \nper annum from 30th January 2016 to 28th February 2022 alongw ith \nfurther interest at the rate of 18% per annum on the principal sum \nof Rs. 11,70,55,555/ - (Rupees Eleven Crores Seventy Lakhs Fifty \nFive Thousand Five Hundred and Fifty Five only) till the payment \nand/or realization with this Hon’ble Authority;  \nc) The R espondent acting by themselves or through their legal \nservants and/or agents and/or representatives, be restrained by an \norder and injunction from in any manner dealing with, disposing of \nor parting with possession of or alienating or encumbering or \ntransf erring or creating any right title and interest in the favour of \nanyone else in respect of the said flat or bringing anyone into the said \nflat  or any part thereof or otherwise dealing with the said flat and/or \non the right title and interest of Respondent  to 9394 Sq. feet. Of \ncarpet area in the said project until final disposal of the present \nComplaint;  \nd)The Complainant be granted compensation in the form of damages \nfor the grave loss caused to the Complainant due to delay in the \nPossession of the said pr emises;  \ne) Such other costs including legal costs of Rs. 2,00,000/ - and such \nother reliefs as this Authority may deem appropriate;  \nf) The Complainant craves leave to refer to the documents mentioned \nherein and any other documents, if required;  \n11. CC006000000220945  a) An order from the respected authority, directing the Respondent \nto enter into an agreement for sale and complete the Project, as \nComplainant does not intend to withdraw from the Project, the \nRespondent is liable to pay interest for eve ry month of delay, till the \nhanding over of the possession to the Complainant along with an \ninterest of 9.3% per annum (i.e. State Bank of India marginal \nlending rate + 2%) effective from the date of booking by Complainant \ntill the date of refund by Respon dent.  \nb) An amount of Rs. 2,00,000/ - (Rupees Two Lakhs only) / - as legal \nfees and complaint filing fees.  Page 7 of 20 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nc) An amount of Rs. 2,00,000/ - (Rupees One Lakhs Only) as \ndamages for the mental harassment and trauma caused and any other \nreliefs as maybe deemed appropriate.  \n  \n3. All the  complaints were heard  by this Authority on the dates mentioned \nhereinbelow  wherein the following roznama was recorded : \n  \nSR. \nNO.  COMPLAINT NO.  DATE OF \nHEARING  ROZNAMA REPRDUCED  \n1. CC006000000192247  18.10.2022  “The Complainant is present; the Respondent is absent.  \nThe Respondent was also absent during the last hearing. \nIn view of the above the matter proceeded ex -parte.  \nThe Complainant had booked two flats the total \nconsideration for one was around 6.75 crores and fo r the \nother it was around 10.75 crores. The Complainant has \noverall paid around Rs. 4 crores. A term sheet was \nsigned on 22.12.2017 as per which the date of possession \nwas 31.12.2020. The term sheet included a clause \nwherein the Respondent was to satisfy t he Complainant \nwith regard to the title within 6 months. This did not \nhappen and therefore two further term sheets had to be \nsigned. These two subsequent term sheets only extended \nthe date by which the issue of title had to be settled. These \ntwo terms shee ts did not extend the date of possession. \nThe Respondent having failed the complainant then sent \na letter terminating the allotment and seeking full \nrefund. The Respondent refunded around Rs. 1.99 \ncrores and then subsequently defaulted. The \nComplainant in his written submission to bring out as \nto whether the project was registered with RERA at the \ntime of executing the term sheet. The Complainant \nhowever states that if assuming the project was not \nregister since he is the buyer under RERA his rights \nstand p rotected. The Complainant seeks refund of the \namounts paid as per the term sheet.  \nParties at liberty to file written submission if any by the \n15.11.2022. Subsequent to which matter will be reserved \nfor orders. ” \n2. CC006000000193809  26.07.2022  “The Complai nant is present; the Respondent is absent. \nThe matter was to proceed ex -parte in the event of \nabsence of parties.  \nThe Complainant states that he has booked a flat on the \n15th floor through an application form dated \n28.07.2018. The total consideration for t he same was \naround 11 crores. And he has paid a consideration of \naround 2.1 crores the project was to come up on two \nplots whereas they find that the Development \nAgreement is limited to only one plot and for the second \nplot there is only a self -declaration  and no Development \nAgreement. The contention of the Complainant is that, \nin view of the above, the title is defective and the \nRespondent will not be able to enter into Agreements in Page 8 of 20 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nHEARING  ROZNAMA REPRDUCED  \nview of the defects of the title. The project has not yet \nstarted and for  the last 5 years only some initial work is \nseen on the site. The Respondent has collected over 10% \nof the amount and cannot register Agreement for Sale \neven though mandated in view of the defective title. The \ncommencement certificate given by the Planning  \nAuthority is only limited to the plinth. The Complainant \nseeks relief under section 13 and 12 and seeks refund of \nthe monies paid together with interest.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter  will be \nreserved for orders. ” \n3. CC006000000195874  26.07.2022  “Complainant is present; the Respondent is absent.  \nMatter was proceeded ex -parte. The Complainant seeks \nrelief under section 12 & 13 of the Act and seeks refund \ntogether with interest and compensation. The premisses \nwas booked in 2017 under Subvention Scheme wherein \nthey had to pay only 5% and rest on fit out possession. \nAccordingly, they have paid around Rupees 15 lakhs \nbeing 5% and further paid Rs. 22 lakhs. The scheme was \nunder Subventio n Scheme with PNB Bank and they \nnow find that the Respondent no 4 which is the bank, has \ndisbursed the full amount to Respondent No. 1 inspite \nof there being no substantial progress on the work. The \nproject is stalled. The Complainant now seeks refund as \nthe project was advertised falsely and the amount that \nwere to be disbursed under the Subvention Scheme in \nproportion to  the work done was disbursed \ndisproportionately.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” \n4.  \n \nCC006000000196158  \n \n  \n26.07.2022  \n “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nThe Complainant had booked their respective premises \nin 2018 and have paid more than 10% of the \nconsideration. The Complainant now seeks directives for \nexecution of the Agreement for Sale and possession of the \npromised premises.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which ma tter will be \nreserved for orders. ” 5. CC006000000196162  \n6. CC006000000197375  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nThe premises was booked on 30.07.2016, the total \nconsideration was 7.85 crore the complainant has paid \n1.85 crores and a provisional booking was made. Having \nfound no progress in the project the Complainant had \nasked for a refund. The promoter in 2019 agreed to the \nrefund but the same was not done.  \nThe title of the project is defect ive and Development \nAgreement was never registered. The promoter has \ntaken 22% and there is no Agreement for Sale.  \nThe Complainant points to section 81(b) and 18(b) \nwherein the allottee cannot be penalised for defect in Page 9 of 20 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nHEARING  ROZNAMA REPRDUCED  \ntitle. Complainant also point out a letter from yes bank \nwhere for various defaults, the promoter is now \ndislodged from the project and hence the promoter never \nwill be able to give possession. Complainant seeks refund \nunder section 12 in view of the above. The registration \nof the project is  valid. In view of the prevailing \ncircumstances the promoter can never give possession \nand has also not signed the Agreement for Sale.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved fo r orders. ” \n7. CC006000000197610  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nThe Complainant booked a flat on 20.03.2017, the total \nconsideration was 12.65 crores. This was under a \nSubvention Scheme wherein the Complainant was to \npay 5% and rest 95% was to come from the bank. The \nComplainant now finds that the bank in collusion with \nthe promoter has disbursed substantial sums.  \nThe Complainant is now facing recovery action from the \nbanks. As more that 10% of the total consideration has \nbeen taken, the Agreement for Sale was to be  \nexecuted which was never done.  \nThe Complainant now seeks to exit and seeks refund \ntogether with interest and compensation. The \nComplainant also seeks directive be given to the bank \nrestraining them from using coercive action against him \nas both the promoter and bank have breached the RERA \nAct and have paid monies by collusion. The title of the \nproject is defective. Complainant also point out a letter \nfrom YES Bank where for vari ous defaults the promoter \nis now dislodged from the project and hence the promoter \nnever will be able to give possession.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” \n8. CC006000000197812  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nThe flat was booked on 30.07.2016, the total \nconsideration of which was over Rs. 10 crores and \namount of Rs. 2.5 crores which is about 24% was paid \nby the Complainant against the provisional Allotment \nletter. No Agreement for Sale executed. Refund was \nsought in 2021 together with interest and compensation. \nThe Complainant states that the title is defective, the \npromoter is dislodged, and the Respondent cannot \ncomplete the project. The Complainant seeks exit \ntogether with refund and compensation under section \n12, 13 and 18 of the Act. The Complainant also states \nthat in view to the false representation made he should \nbe given refund and permitt ed to exit the project.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” Page 10 of 20 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nHEARING  ROZNAMA REPRDUCED  \n9. CC006000000198438  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proce eded ex -parte.  \nThe Complainant booked a flat in the project on \n25.08.2018, he has paid around Rs. 2 crores against the \nconsideration of over Rs. 7 crores which is nearly 27% \nof the total consideration. No Agreement for Sale \nexecuted. The title is defective , and the Respondent also \ndoes not have CC for the project. The Complainant point \nout to the order of the Authority wherein selling of flat \nwithout CC is an unfair practise. The Complainant was \nverbally promised that the possession would be given in \nDecemb er 2020 and as of now the Project is stalled. The \nComplainant seeks relief under section 7, 12, 13 & 18. \nThe Complainant seeks to exit the project together with \nrefund and interest on the monies paid.  \nParties are at liberty to file written submission, if a ny, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” \n10. CC006000000210258  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nThe Complainant executed an MOU on 30.01.2016 \nwherein 3 flats were booked for a total consideration of \nover Rs. 62 crores. The Complainant has paid over Rs. \n11 crores. As per clause 5 of MOU the possession was to \nbe given within 3 years together with some grace period. \nAs per the MOU the date of possession was 30.09.2019. \nThe date of possession has gone by, and the promised \nflats have not yet been delivered. The Complainant seeks \nrelief under section 18 in terms of permission to exit the \nproject together with refund and interest on the monies \npaid by him.  \nPartie s are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” \n11. CC006000000220945  26.07.2022  “Complainant is present; the Respondent is absent. \nMatter was proceeded ex -parte.  \nIn and around the year 2016 the Complainant was \nissued a booking form for the purchase of a flat. The total \nconsideration was over Rupees 16 crores. The \nComplainant has paid over Rs. 2 crores which is more \nthan 10% of the consideration amount. The \nComplainant states tha t under section 13 the \nRespondent should have entered into an Agreement for \nSale. No Agreement for Sale has been entered into till \ndate. The Complainant seeks direction to the Respondent \nto execute the Agreement for Sale and a timely delivery \nof the promis ed premises.  \nParties are at liberty to file written submission, if any, \nby 26.08.2022. Subsequent, to which matter will be \nreserved for orders. ” \n \n4. The brief facts as submitted by the Complainants in their respective  complaint s \nare tabulated for ease of reference hereinbelow : Page 11 of 20 \n SR. \nNO.   \nCOMPLAINT NOS.  FLAT NO. / \nTOWER NO  DATE OF \nTS1/AL2/ \nBAF3/PAL4 POSSESION AS \nPER TS/AL/BF  TOTAL \nCONSIDERAT\nION (Rs.)  TOTAL \nAMOUNT \nPAID5 (Rs.)  \n1. CC006000000192247  805-806/2  22.12.2017  \n(TS) 31.12.2020  \n(as per TS)  6,75,75,000/ - &  \n10,17,00,000/ - 4,48,00,000/ - &  \n25,97,000/ - \n2. CC006000000193809  1505/2  05.11.2019 \n(AL)  1st quarter of 2020  \n(as per mails)  11,08,52,852 /- 2,41,05,000/ - \n3. CC006000000195874  1206/2  14.06.2017 \n(AL)  December, 2019  \n(as per complaint ) 8,74,82,200/ - 63,50,410/ - \n4. CC006000000196158  1803/3  04.10.2019 \n(AL)  No specific data \navailable  8,79,24,965/ - 1,12,00,000/ - \n5. CC006000000196162  1806/3  22.10.2019 \n(AL)  No specific data \navailable  8,79,24,964/ - 1,12,00,000/ - \n6. CC006000000197375  13th Floor/4 \n(Flat not \nmentioned)  30.07.2016  \n(PAL ) March 2019  \n(as per complaint)  7,85,40,000/ - 1,75,00,000/ - \n7. CC006000000197610  1105/2  20.03.2017 \n(AL)  December, 2019  \n(as per complaint)  12,65,27,498/ - 9,81,40,483/ - \n8. CC006000000197812  13th Floor/4 \n(Flat not \nmentioned)  30.07.2016  \n(PAL) March 2019  \n(as per complaint)  10,29,00,000/ - 2,50,00,000/ - \n9. CC006000000198438  1603/3  25.08.2018  \n(BF) 31.12.2023  \n(as per BF)   7,24,96,250/ -  2,00,00,000/ - \n10. CC006000000210258  1801, 1901, & \n2001/wing1  30.01.2016 \n(MOU6) 3 years & 4 months \nfrom date of MOU \n+ 3 months grace  62,10,00,000/ - 11,70,55,555/ - \n11. CC006000000220945  801/4  21.09.2016  \n(BF) 31.12.2023  \n(as per BF)  16,06,31,070/ - 2,09,00,000/ - \n \n5. It is observed that the Respondent s were  absent,  and the matter s proceeded ex -\nparte. Further,  it is also observed that  no submissions have been made by the \nRespondent s in spite of time being given to file written submissions in the said \ncaptioned complaints.  \n \n6. The Authority has perused  the complaints and the submissions made by the \nComplainants and the following observations are noteworthy:  \na. Before moving ahead, it is pertinent to note that the Complainants herein at \nSr. Nos. 2 , 4, 5, 7 &  8 have either not uploaded the booking application form s \nand / or the same are illegible ( blurr ). Details of each is mentioned herein \nbelow.  \n \n1 TS - term sheet  \n2 AL – Allotment letter  \n3 BAF – Booking application form  \n4 PAL – Provisional Allotment letter  \n5 Amounts paid are inclusive of stamp duty, registration, maintenance, service tax, VAT & legal charges  \n6 MOU – Memorandum  of understanding  Page 12 of 20 \n b. The Complainant @Sr. No.1 had purchased 2 apartments ( flats) Nos. 805 & \n806 along with relative Saneesha Sahni and had executed a common term \nsheet dated 22.12.2017. Further they first  executed a supplementary term \nsheet in January, 2018,  then a second supplementary term sheet in May, 2018 \nand then a third supplementary sheet in August, 2018.  The date of \npossession in the term sheet was mentioned as 31.12.2020.  The Complainant \n@ Sr. No. 1 also submits that he received refund of Rs. 1.99 crores  but some \namounts remain outstanding  which are payable by the Respondents .  \nc. The Complainant @Sr. No. 2 was issued an allotment letter dated 05.11.2019 \nwherein no date of possession was mentioned by the Respondents. \nHowever, the date of possession was mentioned by the Respondents in the \nemails exchanged between them from time to ti me. The mails gave  the date \nof possession as 1st quarter of 2020.  The Complainant @Sr. No. 2 has also \nuploaded booking application form dated  28.07.2018 but the same is illegible \n(blurr ).  \nd. Similarly, the Complainant @Sr. No. 3 was issued an allotment letter dated \n14.06.2017 wherein no date of possession was mentioned by the Respondents  \nbut in the complaint the Complainant @ Sr. No.3 submits that the date of \npossession as promised was December 2019 . Further, t he Complainants @Sr. \nNo. 3 have al so executed a tripartite agreement dated 08.06.2017 under the  \nsubvention scheme for availing housing loan  wherein the date of possession \nwas mentioned as January 2020 . The Complainant @Sr. No. 3 has also \nuploaded booking application form dated  28.04.2017  wherein no possession \ndate is mentioned . \ne. The Complainants @Sr. Nos. 4 & 5 were issued allotment letters dated \n4.10.2019 & 22.10.2019 respectively wherein no date of possession was \nmentioned by the Respondents. Further it is noted that no booking \napplication form was  uploaded by both the Complaina nts herein.  \nf. The Complainants @Sr. No.6 submits in the complaint that the possession of \ntheir apartment was promised to be delivered by March 2019. The \nComplainants herein have uploaded  provisional  allotment letter. It is Page 13 of 20 \n pertinent to note that the provisi onal allotment letter did not mention the \napartment (flat) number . \ng. The Complainant @Sr. No. 7 was issued an allotment letter dated 20.03.2017 \nwherein no date of possession was mentioned by the Respondents  but in the \ncomplaint the Complainant submits that the date of possession as promised \nwas December 2019.  Further, t he Complainants @Sr. No. 7 have also \nexecuted a tripartite agreement dated 28.04.2017 under the  subvention \nscheme for availing housing loan.  \nh. The Complainant @Sr. No. 8 was issued a provi sional allotment letter dated \n30.07.2016 wherein no date of possession was mentioned by the Respondents  \nbut in the complaint the Complainant submits that the date of possession as \npromised was March 2019.  The Complainants herein have uploaded \nprovisional allotment letter. It is pertinent to note that the provisional \nallotment letter did not mention the apartment ( flat) number . \ni. The Complainants @Sr. No. 9 executed booking application form dated \n25.08.2016 wh erein the date of possession was mentioned as 31.12.2023. This \ndate is yet to arrive.  \nj. The Complainant @Sr. No. 10 executed a MOU dated 30.01.2016 wherein the \ndate of possession was mentioned as 3 years & 4 months from date of MOU \n+ 3 months grace  i.e. by 30.08.2019.  \nk. The Complainant @Sr. No. 11 executed booking application form dated \n21.09.2016 wherein the date of possession was mentioned as 31.12.2023. This \ndate is yet to arrive.  \nl. That the Complainants herein also submit that the title of the said parcel of \nland is defective  as there is no document pertaining to transfer of \ndevelopment rights  and approvals are not received  from the Authorities . \nm. That the Respondents have accepted more than 10% of the monies before the \nexecution of agreements for sale and have  failed to execute the same.  \nn. The said Project has been  stalled  since long time and no work has been  \ncarried out since past 4 years  due to pending litigations  filed by the Allottees  Page 14 of 20 \n of the said P roject and various financial institutions . The Respondents are \nalso facing criminal actions for fraud and cheating .  \no. That the construction till date has been done only up  to the plinth level and \nthus , the said Project is far from  completion even on the date mentioned in  \non the MahaRERA project registration webpage . \n \n7. From the above facts and observations , the  following  issue s are necessary to be \nconsidered :  \nA. Whether there is delay in completion of the said Project?   \nB. Whether the Complainants seeking to exit /withdraw /stay from/in the said Project are \nentitled to claim relief under section 18 of the said Act?  \n \n8. In order to answer the above issue s, the following observations are noteworthy:  \na. In this regard, i t is pertinent to examine “ possession ” as contemplated under \nsection 18 of the said Act:  In this regard section 18 is reproduced hereinbelow:  \n “18. (1)  If the promoter fails to complete or is unable to give possession  of an \napartment, plot or building, — \n(a) in accordance with the terms of the agreement for sale  or, as the case may be,  \nduly completed by the date specified therein ; or \n(b) due to discontinuance of his business as a developer on account of suspension  or \nrevocation of the registration under this Act or for any other reason, he shall be liable \non dema nd to the allottees, in case the allottee wishes to withdraw from the \nproject , without prejudice to any other remedy available, to return the amount \nreceived by him  in respect of that apartment, plot, building, as the case may be, with \ninterest at such rat e as may be prescribed in this behalf including \ncompensation  in the manner as provided under this Act:  \n \nProvided that where an allottee does not intend to withdraw from the project, he shall \nbe paid, by the promoter, interest for every month of delay, till the handing over of the \npossession, at such rate as may be prescribed. ” \n \nb. From the plain reading of section 18 it is very clear that if the Promoter s \n(Respondents herein ) fails to handover possession as per the terms of the \nagreements for sales/  allotment letters / provisional allotment letters/  \nbooking application form s/ term sheets/  application forms  by the specified \ndate therein, the Allottees ( all the Complainants herein ) have a choice either to \nwithdraw from the said Project or stay with the said Project.  Page 15 of 20 \n c. The Complainants at Sr. Nos. 1 to 3, 6 to 10 are desirous of exiting the said \nProject and the Complainants at Sr. Nos. 4, 5 & 11 are desirous of staying in \nthe said Project.  \nd. In order to examine whether there is any delay in completion of the said \nProject, it is important to ascertain the completion date committed  to each of \nthe Complainants herein. In this regard it is pertinent to note that none of  the \nComplainants have execu ted any agreements for sale with the Respondents \nherein as on date in spite of the Complainants paying 10% of the total \nconsideration amounts  to the Respondents . The Respondents have violated \nthe provisions of section 13 of the said Act by accepting more t han 10% of the \nconsideration amount without executing an agreement for sale and hence is \nliable for penalty under section 63 of the said Act. The table hereinbelow list s \nthe specific date of possession in each compliant herein taking into \nconsiderations th e observation in each complaint mentioned in para No.6 \nhereinabove:  \nSR. \nNO.   \nCOMPLAINT NOS.  DATE OF \nTS7/AL8/ \nPAL9/BAF10 POSSESION DATE   SPECIFIC \nPOSSESSION \nDATE  REASONS / \nREMARKS  \n1. CC006000000192247  22.12.2017  (TS) 31.12.2020  31.12.2020  As per TS  \n2. CC006000000193809  05.11.2019  1st quarter of 2020  March 2020  As per emails  \n3. CC006000000195874  14.06.2017  December 2019  December 2019  As per complaint  \n4. CC006000000196158  04.10.2019  No date  mentioning \npossession  30.12.2024  \n(RERA completion \ndate)  No document s \nuploaded /pre -\nmature  5. CC006000000196162  22.10.2019  \n6. CC006000000197375  30.07.2016  \n(PAL)  March 2019  March 2019  As per complaint  \n7. CC006000000197610  20.03.2017  December 2019  December 2019  As per complaint  \n8. CC006000000197812  30.07.2016  \n(PAL)  March 2019  March 2019  As per complaint  \n9. CC006000000198438  25.08.2018  \n(BAF)  31.12.2023  31.12.2023  As per BAF /pre -\nmature  \n10. CC006000000210258  30.01.2016 \n(MOU11) 3 years & 4 months + \n3 months grace  30.08.2019  As per MOU  \n11. CC006000000220945  21.09.2016  \n(BAF)  31.12.2023  31.12.2023  As per BAF /pre -\nmature  \n \n \n7 TS - term sheet  \n8 AL – Allotment letter  \n9 PAL – Provisional Allotment letter  \n10 BAF – Booking application form  \n11 MOU – Memorandum  of understanding  Page 16 of 20 \n For the Complainants at Sr. Nos. 4 & 5 since the Complainants have failed to \nprovide any document indicating the date of completion ( possession ), the \nAuthority is hence constrained to take the date of completion as the date \nmentioned on MahaRERA Project registration webpage.  Thus, from the facts \nof the complaints it is clear that the Respondents have failed to deliver \npossession as promised  for all Complainants except Complainants at Sr. Nos. \n4, 5, 9 & 11  (the date of completion is yet to arrive ) under the allotment letters/ \nbooking application forms/ term sheets/  MOUs and hence there is no \nambiguity t hat the said Project is delayed as per the promise made by the \nRespondents herein to the aforesaid  Complainants. The issue at para No.7(A)  \nis answered in affirmative .  \ne. In order to proceed to answer the issue  raised in para No.7(B) hereinabove , it \nwould be necessary to examine whether the Complainants herein are entitled \nto reliefs under section 18 of the said Act in the absence of agreements for sale. \nOn perusal of section 18 (1)(a) it is seen that the date on which it becomes \napparent that ther e is failure to complete or inability to give possession of an \napartment is to be determined in accordance with the terms of agreement for \nsale or AS THE CASE MAY BE , duly completed by the date specified therein.  \nThus,  it is clear, that it is not just the date as mentioned in the agreement for \nsale but can also be any other document where the date for giving possession \nis mentioned and agreed upon by the Parties. The law has not made \nagreement for sale as the only and exclusive document for determining the \ndate of handing over possession . The law is expansive and goes beyond the \nterms mentioned in the agreement for sale to also any other instrument \nexecuted between the Parties wherein the date of possession has been defined  \nor mentioned . The law by  using the  words AS THE CASE MAY BE  has cast \nthe net wide to include any document which clearly conveys the date of \ncompletion ( possession ) to both the Parties.  \nf. In these matters the Respondent s Promoter s have not executed any \nagreement s for sale but has accepted more than 10% from each of the \nComplainants herein. However even though an agreement for sale has not Page 17 of 20 \n been executed the allotment letters / provisional allotment letters/  booking \napplication form s/ term sheets/MOUs very clearly i ndicates the date of \ncompletion to both the Parties . The Promoter s are  in clear violation of the said \nAct for not having executed an agreement for sal e in spite  of accepting  more \nthan 10% of the amounts  from  the Complainants . The Respondents / \nPromoter s cannot  now be absolved of this duty to adhere to the date of \ncompletion ( possession ) as mentioned in the various existing documents just \nbecause an agreement for sale has not been executed.  The Authority therefore \nnotes  that in the absence for an agreement for sale the date of completion  \n(possession ) mentioned in the other document s on the basis of which monies \nhave been collected shall  be taken to be the date of completion ( possession ) to \ndetermine whether Complainants are entitled to reliefs unde r section 18 of the \nsaid Act.   \ng. Thus,  the Complainants at Sr. Nos. 1 to 3  and 6 to 10  who are seeking to exit \nthe said Project are allowed to exit/withdraw from the same  as the promised \ndate of possession has already passed except Complainants at Sr. No. 9 herein \nas the date of possession promised by the Respondents is yet to arrive i.e. \n31.12.2023 . In view thereof, t he Complainants at Sr. Nos. 1 to 3, 6 to 8 & 10  are \nentitled to seek refund of the amounts paid by them to the Respondents  along \nwith interest  applicable from the dates mentioned hereinbelow in the table  \n(continued from table at para No.8(d) above ) till the amounts are realised : \nSR. \nNO.   \nCOMPLAINT NOS.  SPECIFIC \nPOSSESSION \nDATE  INTEREST \nAPPLICABLE \nFROM  \n1. CC006000000192247  31.12.2020  01.01.2021  \n2. CC006000000193809  March 2020  01.04.2020  \n3. CC006000000195874  January 2020  01.02.2020  \n6. CC006000000197375  March 2019  01.04.2019  \n7. CC006000000197610  December 2019  01.01.2020  \n8. CC006000000197812  March 2019  01.04.2019  \n9. CC006000000198438  31.12.2023  Not applicable  \n10. CC006000000210258  30.08.2019  01.09.2019  \nh. Moving ahead  for the Complainants at Sr. Nos. 4, 5 & 11 who are  seeking \npossession of their flats booked in the said Project , the Authority firstly directs \nthe Respondents to execute agreements for sale within 60 days from the date Page 18 of 20 \n of this order.  Further the Complaina nts at Sr. Nos. 4, 5 & 11 are not entitled to \nseek interest on the amounts paid by them to the Respondents as the date of \npossession is yet to arrive and thus,  the complaint is pre -mature to seek reliefs \nunder section 18 for interest on delay in handover o f possession. The dates \nmentioned hereinbelow in the table (continued from table at para No.8(d) above ) \nis thus self -explanatory : \nSR. \nNO.   \nCOMPLAINT NOS.  SPECIFIC \nPOSSESSION \nDATE  INTEREST \nAPPLICABLE \nFROM  \n4. CC006000000196158  30.12.2024  \n(RERA completion \ndate)  Not applicable  5. CC006000000196162  \n11. CC006000000220945  31.12.2023  \nThus, in view of the above the answer to issue at para No.7(B)  is partly \naffirmative and partly negative  i.e. the Complainants at Sr. Nos. 1 to 3, 6 to \n10 are allowed to exit / withdraw and seek refund with interest except for \nComplainants at Sr. No. 9 which complaint is pre -mature for reliefs under \nsection 18  and the Complainants at Sr. Nos. 4, 5 & 11 are not entitled to any \nreliefs under section 18 as the ir complaints are also pre -mature .  \ni. The Authority has also observed that few Complainants have availed loans \nunder subvention schemes which is a subject matter of the loan agreements \nentered between the Parties therein and this Authority shall not interfere in \nsuch matter s of loans taken by the home buyers. All loans are well cove red \nunder the lending / loan agreements executed by the concerned Parties. The \nParties to abide by the conditions of the lending / loan agreement for all \nmatters concerning the loan such as EMIs and repayments  and necessary \naction against the Parties defau lting can be taken as per the aforesaid \nagreements.   \nj. The Complainants have also raised the grievance of the land title of the said \nproject being defective. The Authority would like to note that section 4 of the \nsaid Act which deals with the application of  the registration of the real estate \nproject. The relevant portion relating to the title is section 4 (l) (a) and 4 (l) (b) \nwhich is reproduce herein below for ease of reference : \n“(l) a declaration, supported by an affidavit, which shall be signed by the p romoter or \nany person authorised by the promoter, stating: —  Page 19 of 20 \n (A) that he has a legal title to the land on which the development is proposed along \nwith legally valid documents with authentication of such title, if such land is owned \nby another person;  \n(B) that the land is free from all encumbrances, or as the case may be details of the \nencumbrances on such land including any rights, title, interest or name of any party \nin or over such land along with details; ” \n \nFrom the above section it is clear that the t itle for the purpose of RERA is based \non the declaration supported by an affidavit. The Authority hence shall  not \nadjudicate on the issue of title  of the said Project . \n  \nFINAL ORDER  \nIn view of the observations hereinabove, the following order is passed:  \nA. All the complaints are disposed of.  \nB. The Respondents are liable to pay a penalty of Rs. 1,00,000/ - for violation of section \n13 of the said Act.  \nC. The Complainants at Sr. Nos. 1 to 3, 6 to 8 & 10 who are seeking to exit the said \nProject are allowed to exit/ withdraw from the same and the Respondent is \ndirected to refund the amounts received by them towards the consideration of \ntheir respective apartments along with interest from the dates mentioned in \ntable in para No.8(g) under the column na mely “INTEREST APPLICABLE \nFROM”  till realisation of the amounts . In order  to ensure that the said Project \nis not jeopardised due to the outflow of finances and is completed keeping in \nmind the interest of the other buyers of the said Project at large, it is directed \nthat the amounts of refund and the interest thereupon shall be  paid by the \nRespondent s to the Complainants at Sr. Nos. 1 to 3, 6 to 8 & 10 upon the OC \nbeing received for the said Project or on 30.12.2024 whichever is earlier. The \ntotal accrued amounts shall be payable in  3 equal monthly instalments \nthereafter immedia tely.  In the event handing over of possession with OC is \ndelayed beyond 30.12.2024 then the interest accruing after this shall be payable \nevery month on the 5th of the subsequent month till handing over of possession \nwith OC.  \nD. Further, w ith regard to the payment of interest to the Complainants  at Sr. Nos. \n1 to 3, 6 to 8 & 10 herein, it is further directed that the Respondent s Promoter s Page 20 of 20 \n are entitled to claim the benefit of “ moratorium period ” as mentioned in the \nNotifications / Orders Nos. 13, 14 and 21 dat ed 02.04.2020, 18.05.2020 and \n06.08.2021 respectively issued by the MahaRERA . The moratorium period shall \nbe deducted from the total period for which interest is payable.  \nE. The complaint at Sr. No. 9 is dismissed as pre -mature along with the complaints  \nat Sr. Nos. 4, 5 & 11 which are not entitled to any reliefs under section 18 as the \nsame are also pre -mature.  \nF. The Respondents in complaints at Sr. Nos. 4, 5 & 11 are directed to execute \nagreements for sale within 60 days from the date of this or der. \nG. No order as to cost s.                \n \n \n  (Ajoy Mehta ) \n   Chairperson, MahaRERA"
    },
    {
        "file_name": "7.SILVER SKYLINE.pdf",
        "text": "Page 1 of 12 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \n1. COMPLAINT NO. CC006000000194896  \n1. DEVKUMAR RAMANI  \n2. MRS HEMA DEVKUMAR RAMANI  \n3. JEEN PRAKASH LUDHANI  \n4. NEHA DEVKUMAR RAMANI   \n \n \n…COMPLAINANT S \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI  &  \nLAXMI LUDHANI   \n…COMPLAINANT S \na/w  \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND  …COMPLAINANT  \n \na/w  \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA & ANITA MIRPURI  …COMPLAINANT  \n \nVS \n \n1. PRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. No s. 3 & 4)  \n   \n…RESPONDENT S \n \n \nMAHARERA PROJECT REGISTRATION NO.  P51800004072  \nOrder  \nJune  30, 2023 \n(Date of hearing mentioned in Para No. 4 – matters reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No. 1 &2  \nAdvocate Ooril Panchal a/w Advocate Mahesh Kukreja for the  \nComplainant s at Sr. No. 3 & 4  \nAdvocate Vikramjit Garewal for Respondent No. 1  at Sr. No. 1  to 4 \nAdvocate Aditya Miskita for Respondent No. 2  at Sr. No. 3 & 4  \n \n Page 2 of 12 \n 1. The Complainant s are hom e buyer s and Allottee s within the meaning of Section 2(d) \nof the Real Estate (Regulation and Development) Act, 2016  (hereinafter referred to as \nthe “said Act ”) of Real Estate Regulatory Authority (hereinafter referred to as the \n“RERA ”) and the Respondent  No. 1  is the Promoter/Developer within the meaning \nof Section 2(zk) of the said Act. The Responden t No. 1 is registered as the Promoter \nof the Project namely  “SILVER SKYLINE ” under section 5 of the said Act bearing \nMAHARERA Project  Registration No. P51800004072 (hereinafter referred to as the \n“said Project ”). The said Project is a redevelopment project of Manish Sonal Co -\noperative Housing Society Ltd. ( hereinafter referred to as the  “Society ”) which was \nto be earlier developed by the Respondent No. 2 namely Silvex Developers Private \nLimited .  \n \n2. On the MahaRERA Project registration webpage the proposed completion date  is \n31.07.2021, revised completion date  is mentioned as  30.12.202 2 and extended  \ncompletion date is mentioned as  30.04.2023.  The Project is a lapsed Project and \nOccupation Certificate/ Form 4 (Architect’s Certificate of Completion of Project) is \nnot uploaded on the MahaRERA portal.  \n   \n3. The Complainant s are seeking the following reliefs:   \nSR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n1.  CC006000000194896  i. This Hon’ble Authority be pleased to direct the Respondent to pay interest on Rs. \n2,18,78,350 / -(Two Crores Eighteen Lakhs Seventy Eight Thousand Three Hundred \nFifty Only) paid by the Complainants to the Respondent from the agreed date of \npossession 12th N ovember 2017 till the date of actual possession along with OC in \naccordance to Section 18 of the Real Estate (Regulation & Development) Act 2016.  \nii. This Hon’ble Authority be pleased to direct the Respondent to execute the Sale \nAgreement in accordance wi th the provisions of the Real Estate (Regulation & \nDevelopment) Act 2016 and the Rules made thereunder for both flats as allotted \npursuant to the Consent Terms signed and filed by the Hon’ble High Court of Bombay \nin Arbitration Petition (L) No: 474 of 2015  on 13th May 2015.  \n iii. The Complainants are further entitled for appropriate compensation from the \nRespondent for the grave and irreparable loss and mental agony suffered by them from \n2013.  \niv. Award the costs of these proceedings to the Complainants.  \nv. Grant any other relief which this Hon’ble Authority deems fit and proper under the \nfacts and circumstances of the present case.  \n2.  CC006000000194917  i. This Hon’ble Authority be pleased to direct the Respondent to refund the entire \namount of Rs 1,07,20,000/ - paid by the Applicants to the Respondent along with \ninterest at the rate of 15% p.a. as confirmed by the respondent in its letter dated 13th \nMay 2015 from the date of payment till the date of refund.  \nii. The Applicants are further entitled for appropriate compensation from the \nrespondent for the grave and irreparable loss and mental agony suffered by them.  \niii. Award the costs of these proceedings to the Applicants.  \niv. Grant any other relief which this Hon’ble Authority deems fit a nd \nproper under the facts and circumstances of the present case  Page 3 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n3.  CC006000000196381  a)That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 1,71,28,021/ - being the interest payable @ 18 % p.a. from the \nrespect ive dates of the payment made by the Complainant to Respondent No.2 towards \npart consideration of the said flat. The Complainant has prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ here to. \n  \nb)That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay further \ninterest on and from 16 March 2021 at the rate prescribed by RERA Act and Rules \nmade thereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 86,00,000/ - \n(Rupees Eighty Six Lacs Only) being the present market value of the said flat until \nhanding over possession of said flat.  \n \nc)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements an d get the said RERA \nAgreements registered with Sub  Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximate ly 1400 square \nfeet carpet area along with an exclusive terrace admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 where -under \nfrom the total consideration of Rs. 1,80,00,000 the balance consideration of Rs. \n94,00,000/ - would be paid by the Complainant to Respondent No.1 after deducting \nthe amount paid till date i.e. Rs. 86,00,000/ -. \n \nd)That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainant within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secre tary and/or any authorized \nperson of this Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing being a 3 \nbedroom hall kitchen apartment admeasuring approximately 1400 sq uare feet carpet \narea along with an exclusive terrace admeasuring approximately 1400 square feet \ncarpet area along with two stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainant on behalf of and at the cost of the Respondent No.1 herein and to perform \ntheir part of obligations under the RERA Act as amended.  \n \ne)That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respo ndent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any th ird party right, title and/or interest \nin respect of the said flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximately 1400 square \nfeet carpet area along with an exclusive terra ce admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this \nHon’ble Court deems appropriate in the facts and circumstance s of the present case.  \n \nf)That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representatives, servants, administrator, assigns, e tc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/car parking spaces in the building under  \nconstruction on the said project until payment of Rs. 1,71,28,021/ - (Rupees One Crore \nSeventy One Lac Twenty Eight Thousand Twenty One Only) (calculated along with \ninterest until 15 March 2021) along with further interest on and from 16 March 2021 \ntill da te of possession of the said flat; by the Respondent No.1 to the Complainant;  \n \ng)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due and payable to the Complainant \nand until th en the Complainant would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in the website of this Hon’ble \nAuthority with in 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the Complainant having a \ncharge on the said proj ect property and/or permit the Complainant to erect a Board on Page 4 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nthe said project property intimating public at large, the factum of Complainant having \na charge on the said project property forthwith;  \n \nh)In the alternative to all above prayer clauses above a nd only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to hold that the Respondent No.1 cannot create an y third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainant as prayed for hereinabove;  \n \ni)That this Hon’ble Tribunal be pleased to direct the Respondent No.1 to pay a sum of \nRs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. as \ncompensation to be provided for the mental trauma, loss of time, hardship caused to \nComplainants and the notional losses, legal fees incurred within one month from the \ndate of disposal of t he present Complaint;  \n \nThat this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 of \nRERA Act for giving false information as per section 4 of the Act;  \n4.  CC006000000196392  (a) That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 86,57,366/ - (Rupees Eight Six Lacs Fifty Seven Thousand Three \nHundred Sixty Six only) being the interest payable @ 18 % p.a. from the respective \ndates of the payment made by the Complainants to Respondent No.2 towards part \nconsideration of the said flat. The Complainants have prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ hereto.  \n(b) That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay interest \non and from 15 March 2021 at the rate prescribed by RERA Act and Rules made \nthereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 44,55,000/ -(Rupees \nForty Four Lacs Fif ty Five Thousand Only) being the present market value of the said \nflat until handing over possession of said flat.  \n(c) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements and get  the said RERA \nAgreements registered with Sub -Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 93 5 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 whereunder from the \ntotal consideration of Rs. 92,38,000/ - (Rupees Ninety -Two Lacs Thirty -Eight \nThousa nd only) the balance consideration of Rs. 47,83,000/ - would be paid by the \nComplainants to Respondent No.1 after deducting the amount paid till date i.e. Rs. \n44,55,000/ -.  \n(d) That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainants within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secretary and/or any authorized \nperson of t his Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing being a 2 \nbedroom hall kitchen apartment admeasuring approximately 935 square feet carpet \narea along with one st ilt car parkings on land bearing CTS No. 826 -B situate at \nJ.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainants on behalf of and at the cost of the Respondent No.1 herein and to \nperform their part of obligations under the RERA Act as amended  \n(e) That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. fro m taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of the said flat i.e. a flat bearing No. 1601 on the 16th floor in ‘A’ Win g \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 935 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this Hon’ble Court \ndeems ap propriate in the facts and circumstances of the present case;  \n(f) That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representati ves, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/ car parking spaces in the building under \nconstruction on the said project until payment of Rs. 86,57,366/ - (Rupees Eight Six \nLacs Fifty Seven Thousand Three Hundred Sixty Six only) (calculated along with Page 5 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \ninterest until 15 March 2021) along with further int erest on and from 16 March 2021 \ntill date of possession of the said flat; by the Respondent No.1 to the Complainant;  \n(g) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due an d payable to the Complainants \nand until then the Complainants would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in  the website of this Hon’ble \nAuthority within 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the C omplainants having a \ncharge on the said project property and/or permit the Complainants to erect a Board \non the said project property intimating public at large, the factum of Complainants \nhaving a charge on the said project property forthwith  \n(h) In the alternative to all above prayer clauses above and only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to  hold that the Respondent No.1 cannot create any third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainants as prayed for hereinabove  \n(i) That this Hon’ble Tribunal be pleased to direct the R espondent No.1 to pay a sum \nof Rs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. \nas compensation to be provided for the mental trauma, loss of time, hardship caused \nto Complainants and the notional losses, legal fees incurre d within one month from \nthe date of disposal of the present Complaint;  \n(j) That this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 \nof RERA Act for giving false information as per section 4 of the Act;  \n \n4. The captioned complaints were heard by this Authority on the following dates  \nrespectively wherein the following  roznama s were  recorded : \nSR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \n1.  CC006000000194896  \n01.02.2023  “Both Parties are present.  \nThe Complainant avers that they had booked a flat with the Developer \nSilvex in 2008 for which they paid part consideration of around Rs. \n84 Lakhs. Subsequently, the erstwhile Developer Silvex offered them \nan alternate flat in a redevelopment schem e which they accepted and \ncertain further payments were also made. In the year 2014 the Society \nundergoing redevelopment terminated the development agreement of \nSilvex and a new development agreement came to be executed with \nthe current Respondent as the D eveloper. The Complainant avers \nthat they were not a Party to this. Subsequently, a fresh set of consent \nterms were signed and a new allotment letter was given by the \npresent Developer namely the Respondent. This was executed on \n13.05.2015 wherein date of completion was promised to be 24 \nmonths. The letter also stated how the various remaining instalments \ntowards consideration were to be paid. The Complainant however, \navers that instalments were asked even though the milestones set had \nnot been achieved. Th e Complainant now seeks execution of \nagreement for sale, possession, interest for delay and compensation.  \nThe Respondent avers that consent terms have been executed before \nthe High Court and the higher terms payable were in fact decided in \nthe Hon’ble High  Court. The consent terms in Clause 8 clearly state \nthat all the claims will be addressed by Silverex the erstwhile \nDeveloper. The Respondent further avers that they were called upon \nto execute the agreement for sale in 2015 and also subsequently which \nthe Complainant never came forward. The Respondent also avers that \naround Rs. 83 Lakhs consideration is still outstanding from the \nComplainant and they have not paid the same. The Respondent avers \nthe delays have taken place because of Society not assigning t hem the \nright which were as per the consent terms before the High Court.  2.  CC006000000194917  Page 6 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nThe Complainant avers that they did seek the agreement for sale but \nwere given the same with the revised date of possession which was \nnot acceptable to them.  \nParties are at liberty to  file written submissions, if any, by \n13.02.2023. Subsequent to which, the matter will be reserved for \norders.”  \n3.  CC006000000196381  \n08.03.2023  ““All parties are present.  \nThe Complainant avers that a letter of allotment dated 15.05.2009 \nwas executed by Respondent No. 2 - the erstwhile Developer, now \nRespondent No. 1 has stepped in as the current Developer. The \nComplainant had paid around Rs. 30 Lakhs at the time of letter of \nallotment and the further Rs. 56 Lakhs and in the agg regate has paid \nover Rs. 86 Lakhs. The date of possession was given as 31.12.2011. \nThe Complainant avers that in 2012 the Project stopped and they \nwere not able to communicate with the Promoter. Subsequently, a \npurported email was sent by Respondent No. 2 to the husband of the \nAllotee and not the Allottee himself which involved changing the \nterms of the agreement. The Complainant avers that the consent \nterms were signed between Respondent No. 1, Respondent No. 2 and \nthe Society and they are now being asked to make higher payments \nagainst a lower area. The Complainant seeks execution of agreement \nfor sale and also interest to be paid for the amounts paid by him and \nthe delays therein. On the issues of the Complainant at Sr. No. 7 the \nfacts of the case remain same except for the fact that the Complainant \nNo. 7 did not even receive the email purported have been sent by the \nRespondent No. 2.  \nRespondent No. 1 avers that this as a society redevelopment Project \nundertaken by the Respondent No. 2 – the erstwhile Deve loper. This \ndevelopment agreement was terminated by the Society. The matter \nwas taken up by the Bombay High Court as Society had appointed \nthe Respondent No. 1 in 2015 to complete the Project. An arbitration \nproceeding took place subsequent to which 2 cons ent terms were \nsigned – 1. Between Respondent No. 1, Respondent No. 2 and the \nSociety and second between Respondent No. 1, Respondent No. 2, \nSociety and the majority of the flat purchasers. The consent terms \nhave been acted upon by the Parties and the same  have also been filed \nbefore the High Court. The consent terms fundamentally gave 2 \noptions to the Allottees namely to either pay escalation and continue \nin the Project and in case not willing to pay escalation then to take \nrefund and claim the interest fr om Respondent No. 2. All flat \npurchasers were sent letters. The Respondent No. 1 further avers that \nfrom 2011 nothing has been paid by the Complainant further to an \nemail dated 25.04.2015 a detailed computation giving the exact \nescalation involved was also  sent on the mail address given by the \nAllottee. Th Respondent also avers that there was a group represented \nby the Allotee which also attempted to negotiate the escalation but it \ndid not conclude as no response was forth coming.  \nTh Respondent No. 1 says t hat Section 15 of RERA does not apply \nhere as the consent terms were taken before the High Court in 2015 \nwhich is pre -RERA. The Respondent states that in case there are \ncertain issues regarding interest then the same forms a part of \nliabilities of Responde nt No. 2. The Respondent No.1 is today unable \nto offer terms different to those offered to other Allottees. The demand \nletters issued from 2015 onwards have also not been responded to by \nthe Complainant. The Respondent No. 1 also states that RERA in no \nway leaves the Complainant remediless and there are other laws with \nprovisions under which the Complainant can seek redressal.  \nThe Respondent No. 2 states that this is a misjoinder of Parties and \nthat he is not a necessary Party as he has handed over the Project to \nRespondent No. 1 and as such Respondent No. 2 is not a Promoter \nanymore . In fact, the handing over took place prior t o RERA. The \nRespondent No. 2 further avers that a scheme was formulated way 4.  CC006000000196392  Page 7 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nback at the time of transfer of Project from Respondent No. 2 to \nRespondent No. 1 and today after 7 -8 years the Complainants cannot \ncome forward seeking compensation from the Respo ndent No. 2. The \nRespondent No. 2 avers that since he was dealing with the Project \nprior to RERA he was never a Promoter as defined and envisaged \nunder RERA.  \nThe Complainant reiterates that they are not part of any group \nnegotiating the terms and instead t hey have individual agreements \nand they seek performance of the same. There is no letter or any other \ndocument to show that they were represented by a particular person \nas a part of a group. In the consent terms and deed of assignment the \nterm escalation i s not mentioned.  \nParties are at liberty to file written submissions, if any, \nby23.03.2023. Subsequent to which, the matter will be reserved for \norders  “ \n \n5. The brief facts and submissions of the parties  are as follows : \nSR. \nNO.   \nCOMPLAINT NOS./  \nCOMPLAINT \nFILING DATE  FLAT / \nBUILDIN\nG NO.  DATE OF \nAL1 TOTAL \nCONSIDERATIO\nN (INR)  TOTAL AMOUNT \nPAID  \n(INR)  \n1.  CC006000000194896 \n12.11.2020  1004/2003  \n& \n2002  13.05.2015  1,94,03,350  \n& \n98,75,000  2,08,78,350  \n(combined as per CT2) \n2.  CC006000000194917  \n13.11.2020  1702  \n& \n1802  13.05.2015  1,16,50,000  \n& \n1,12,75,000  85,20,000  \n(combined as per CT ) \n3.  CC006000000196381 \n19.03.2021  1801  15.05.2009  1,80,00,000  86,86,520  \n(as per complaint ) \n4.  CC006000000196392  \n19.03.2021  1601  15.05.2009  92,38,000  44,55,000  \n(as per complaint ) \n \n6. The submission s of all the Parties herein are perused and taken on record by the \nAuthority. However, b efore moving ahead, the following dates and events  are \nnoteworthy:  \nDATES  EVENTS  \n13.05.20008  A development agreement was executed between the Society and the Respondent No. 2 \nherein for redevelopment  of the existing building and constructing the said Project.  \nDate s not \nsubmitted  \n Allotment letter issued to Complainants at Sr. No. 1 by the Respondent No. 2 herein for flat \nNos. 103, 502, 503, 1602, 1702, 1805, 1905 & 2004 ( no further details submitted ). \nAllotment letter issued to Complainants at Sr. No. 2 by the Respondent No. 2 herein for flat \nNos. 1702 & 1802  with one car park (no further details submitted ). \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 3 by the Respondent No. 2 herein  (details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ).  \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 4 by the Respondent No. 2 herein ( details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ). \n31.01.2015  Termination Notice issue by the Society to the Respondent No. 2. \n \n1 AL- Allotment Letter  \n2 CT –Consent Terms  Page 8 of 12 \n 16.03.2015  Respondent No. 2 filed an arbitration petition No.(l) 474 of 2015 before the Hon’ble Bombay \nHigh Court  against the Society  (“said arbitration petition ”).  \n09.05.2015  The said arbitration petition was disposed of pursuant to consent terms being filed between \nthe Respondents herein along with Society and also between the Complainants at Sr. Nos. 1 \n& 2 (“ said consent terms ”).   13.05.2015  \n13.05.2015  Fresh a llotment letter s were issued to Complainants at Sr. No. 1 by the Respondent No. 1 \nherein  with new flats numbers and with escalated prices ( mentioned in table at para No. 5 \nhereinabove ). \n13.05.2015  Fresh allotment letter s were  issued to Complainants at Sr. No. 2 by the Respondent No. 1 \nherein with escalated prices for the flats retained from old allotments (mentioned in table at \npara No. 5 hereinabove ). \n29.07.2017  The Respondent No. 1 applied for seeking the said Project registration before MahaRERA.  \n07.08.2017  The Respondent No. 1 was granted the said Project registration.  \n28.03.2018  A deed of assignment was executed between the Respondents and the Society assigning the \nentire development rights to the Respondent No. 1 herein  (“said assignment deed ”).  \n12.11.2020  The complaint at Sr. No. 1 was filed by the Complainants at Sr. No. 1 against the Respondent \nNo. 1 seeking reliefs mentioned in table at p ara No. 3 hereinabove.   \n13.11.2020  The complaint at Sr. No. 2 was filed by the Complainants at Sr. No. 2 against the Respondent \nNo. 1 seeking reliefs mentioned in table at para No.3 hereinabove.  \n19.03.2021  The complaints at Sr. Nos. 3 & 4 were filed by the Complainants at Sr. Nos. 3 & 4 a gainst the \nRespondent Nos. 1 & 2 seeking reliefs mentioned in table at para No.3 hereinabove.  \n \n7. From the facts and the submissions, the issue s that needs to be considered are as \nfollows:  \na. Whether the Complainants are entitled to seek reliefs under Section 18 of the said Act ? \nb. Any other order?  \n \n8. From the above enumeration  it is very clear that certain events have taken place \nbefore the advent  of RERA and there  are events that ha ve taken place after RERA \nwas notified.  In the pre -RERA period,  a development agreement was executed \nbetween the Society and Respondent No.2. Subsequently the Society terminated the \ndevelopment agreement . Upo n the termination of the development agreement an \narbitration proceeding took place before the Hon’ble Bombay H igh Court  which \nculminated in the execution of said consent terms.  \n \n9. Some of the  terms that were agreed upon  under the said consent terms executed \nbetween the Respondents herein along with Society and the Complainants at Sr. Nos. \n1 & 2 on 13.05.2015 before the Hon’ble Bombay High Court in the said arbitration \npetition are reproduced hereinbelow : Page 9 of 12 \n “8. The Petition ers further agree and undertake to Hon’ble Court that in the event any claim or demand is made \nagainst the Respondent No. 2, and/or om respect of any of the flats, they will defend such claims/demands on \ntheir own cost and shall indemnify and shall keep in demnified the Respondent No. 2 against such claim/demand, \nloss/damages that may be suffered by the Petitioners as well as all cost, charges and expenses that may be \nincurred by the Respondent No. 2  to defend such claims or demands.  \n \n10. The Petitioners and Respondent No. 2 confirm that the allotment of Flat Nos. 1904/2003 and 2002 \n(collectively called “the said flats”) along with exclusive right to use 4 (four) Car Parking Spaces (“said Car \nParking Spaces”) in favour of Respondents No s. 3 to 6 as set out hereinafter in the proposed building to be \nnamed as “Silver Skyline” being constructed on the land bearing CTS No. 826 and 827 of village Ambivali \npursuant to Development Agreement dated 13.05.2008 made between Respondent No. 1 Society  and the \nPetitioners is valid, subsisting and binding upon them.  \n \n11. Respondent No. 2, at the request of the Petitioners and Respondent No. 3 to 6, agree to honour allotment of \nthe aforesaid flats   right to use 4 Car Parking Spaces and enter into and register formal Agreement for Sale in \nrespect thereof with the Respondent No. 3 to 6 or such of them as may be directed by them. The details of the said \nflats, carpet area thereof, total consideration, amount received, balance payable and no. and nature of  car parking \nspaces is set out hereunder…  \n \n13.In view of the consent terms and allotment letters executed in respect of the said premises, the earlier \nallotment made by the Petitioner to the Respondent No. 3 to 6 in respect of the remaining flats, i.e. Fla t Nos., \n103, 502, 503, 1602, 1702, 1805, 1905 and 2004 is cancelled. It is hereby clarified that he aforesaid cancellation \nshall not affect the rights of Respondent No. 7 & 8 in Flat no. 1702 as provided in Clause 18 herein below. \nRespondent No. 3 to 6 con firm that credit of the payment, if any, made in respect of the above cancelled flats is \ngiven in Flat Nos. 1904/2003 and 2002.  \n \n20. by separate Consent Terms of even date made between the Petitioners and Respondent No. 1 and 2, dispute \nwith the Society be ing Respondent No. 1 herein is settled. Agreed, ordered and declared that the benefits of the \nsaid Consent Term in respect of the Premises set out hereinabove will ensure to the benefit of Respondent Nos. \n3 to 6 subject to the Respondent Nos. 3 to 6 paying  balance consideration and other amounts as per the agreed \nterms. ” \n \n10. It is also an admitted fact that none of the Complainants have executed agreements \nfor sale with either of the Respondents herein . The only document that the \nComplainant s hold  as on date are the letters  of allotment towards the apartments  \nallotted to each and further the records of the payments made by each of them. The \nallotment letters of Complainants at Sr. Nos. 1  & 2 issued by Respondent No. 1 after \nthe execution of the  said consent terms  mentions not only the escalated consideration  \namounts to be paid by the m but also the new apartment numbers allotted to them. It \nis also observed that Complainants  at Sr. Nos. 3 & 4 claim to have only the original \nallotment letters without any further documents indicating  escalated amounts to be \npaid or the numbers of new apartments  to be allotted. Even  the original allotment \nletters claimed by the Complainants  at Sr. Nos. 3 & 4 which  have been issued by the \nRespondent No. 2 herein  have not been uploaded  by them .  Page 10 of 12 \n 11. It is pertinent to note that the fresh allotments issued by the Respondent No. 1 to the \nComplainants at Sr. Nos. 1 & 2 at para No.5 stated as follows:  \n“5. Subject to force majeure as well as other circumstances beyond our control including Policy of the \nGovernment/MCGM and sanction of the plans and requisite permission in time, we propose to complete the \nbuilding and offer possession within a period of 24 months from the date hereof with a grace period of 6 months. ” \n \n12. It is pertinent to note that the said assignment deed at recital W stated the following:  \n “W. The Assignee/ Developer confirms that they will carry out and complete the construction and offer \npossession of the premises to the existing members of the society w ithin the period stipulated here under read \nwith Development Agreement dated 13.05.2008 and the Terms dated 13.05.2015 subject to force majeure and/or \nother circumstances beyond the control of the Assignee. The Society confirms that period of 21 months dur ing \nwhich the Assignee/ Developer could not get permission to carry out construction will not be taken into \nconsideration while calculating the aforesaid period.”  \n \n13. It is thus clear that subsequent to the said consent terms filed as a result of the said \narbitration petition the transactions between the Part ies were to be carried out as per \nthe said consent terms. These said consent terms  were agreed upon and executed \nsubsequent to an arbitration plea under the oversight  of the Hon’ble Bombay High \nCourt . Thes e said consent terms predate the notification giving effect to the said Act. \nWith th ese said consent terms  on record, the Parties today have no option but to \nfollow the terms as envisaged  and laid out therein . As mentioned above the said \nconsent terms  have very clearly dealt with the  escalation amounts, the completion \ndates and such other items that are necessary to conclude a real estate project.  The \nParties should have executed sale deeds  / agreement for sale  in keeping and in line \nwith these consent terms. With these said consent terms  on record the Authority has \nno mandate to interpret them and adjudicate upon the manner and the conditions \nthat should be a part  of the sale deed  / agreement for sale  to be exe cuted between \nthe Parties. These said consent terms were executed before the advent of RERA and \nas a part of the arbitration proceedings. Thus, issues relating to its interpretation \ncannot be a part of an adjudication process of this Authority.  \n \n14. The Compl ainants at Sr. Nos. 1 & 2 and the Respondent No.1 must hence proceed to \nexecute the agreement for sale as laid out in the said consent terms . The Authority \nsees no reason to intervene in the same. With respect to reliefs under Section 18 for \nthe Complainants at Sr. No. 1 & 2 it is to be noted that subsequent to the said consent Page 11 of 12 \n terms  no document has been executed between the Parties to enable th e Authority  to \nadjudicate upon reliefs that they may be entitled  to under Section 18 of the said Act.  \nThe Parties are seeking reliefs under Section 18 based on allotment letters  which were  \nissued prior to RERA. Not only were these allotment letters issued prior to RERA but \nfurther the said consent terms  executed have overtaken the recitals in the allotment \nletters . The said consent terms  have clearly laid out the profile of the relationship \nbetween the Respondent No. 1 herein  and the Allottees  i.e. the Comp lainants at Sr. \nNos. 1 & 2 herein . The said consent terms  have further gone and have also set out the \nmanner in which any prior  claims and liabilities  would be sought and the Party \nagainst  whom  the same shall be executable.  With the executing of the said consent \nterms a curtain has fallen on all events before that and it is the said consent terms \nthat shall now hold ground and any other document subsequent to this. With these \nbeing the facts,  the Authority observes that the allotment letter  cannot be the basis \nfor determining whether a grievance exists and for which a remedy should be \ngranted. Hence the issue at para No. 7(a)  is answered in the negative .  \n \n15. The Complainants at Sr. N so. 1 & 2 have also sought reliefs with regar d to an order \nof permanent injunction and restraining of the Respondent No. 1 from disposal of \ntheir apartments. Since the Parties have failed to take action subsequent to the said \nconsent terms which has resulted in them failing to re -establish their righ ts and \nobligations it would not be prudent to issue any injunction orders.  Hence the issue \nat para No. 7( b) is answered in the negative . \n \n16. In view of the above Complainants  at Sr. Nos.1 & 2 and the Respondent at Sr. No. 1 \nare directed to take such steps to execute the agreement for sale in keeping with the \nsaid consent terms .  \n \n17. In the complaints at Sr. Nos. 3 & 4 the Complainants have failed to provide the \noriginal allotment  letters . However,  the Authority also notes that the availability  of \nthe allotment letters  has not been challenged. The Authority  would therefore  assume \nthat in view if the fact  that there is no challenge to the statement being made by the \nComplainants  Nos. 3 & 4 , the allotment letters  exist . However,  since the Authority is Page 12 of 12 \n not privy to the allotment letters it would not be able to adjudicate upon the \ngrievances sought to be redressed.  Further  since the said consent terms  are on record , \nthe Authority  will limit itself to directing the Parties to abide by the said consent \nterms while moving ahead  in the matters.  \n \n18. Thus, in view of the above, all the captioned complaints are disposed of . No order as \nto costs.    \n \n19. Further the said Project is lapsed and the Respondent No. 1 has taken no steps till \ndate to seek any extension. This Authority shall keep the said Project registration in \nabeyance  and the Respondent shall not advertise, market, book, sell or offer for sale, \nor invite person/s to purchase in any manner any apartment  in the said Project till \nthe Respondent No. 1 obtains extensions of the said Project from MahaRERA.       \n \n \n  (Ajoy  Mehta)  \n      Chairperson, MahaRERA"
    },
    {
        "file_name": "6.SILVER SKYLINE.pdf",
        "text": "Page 1 of 5  BEFORE THE  MAHARASHTRA  \nREAL  ESTATE  REGULATORY  AUTHORITY,  MUMBAI  \nVirtual  Hearing  held  through  video  conference  as per \nMahaRERA  Circular  No.:  27/2020  \n \nPRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD          …APPLICANT  \nIN \n1. COMPLAINT NO. CC006000000194896  \nDEVKUMAR RAMANI,  \nMRS HEMA DEVKUMAR RAMANI,  \nJEEN PRAKASH LUDHANI  & \nNEHA DEVKUMAR RAMANI       …. COMPLAINANT/S  \n  \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI &  \nLAXMI LUDHANI         …. COMPLAINANT/S  \n \na/w \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND        …COMPLAINANT /S \n \na/w \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA &  \nANITA MIRPURI         …COMPLAINANT /S \nVS \n \n1.PRABHAV REALTY & INFRASTRUCTURE PVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. Nos. 3 & 4)   …RESPONDENT/S.  \n \nMAHARERA PROJECT REGISTRATION NO. P51800004072  \n \nOrder  \n(In an application for removal of abeyance ) \nJune  14, 2024  \n(Date of hearing 03.04.2024 - matters  were reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No s. 1 &2  \nAdvocate Mahesh L. Kukreja present  for the Complainants at Sr. No s. 3 & 4  \nAdvocate Sanjeel Kadam  present for the Respondent at Sr. Nos. 1 to 4Page 2 of 5   \n1. The Applicant  herein had registered the project namely “SILVER SKYLINE ” under \nsection 5 of the Real Estate (Regulation and Development) Act, 2016 (“ said Act ”) of \nReal Estate Regulatory Authority (“ RERA ”) bearing MAHARERA Registration No. \nP51800004072 (hereinafter referred to as the “ said Project ”).  \n \n2. The captioned complaint was  heard by this Authority and a f inal Order dt. 30.06.2023  \nwas passed (hereinafter referred to as the “said  final order” ). The relevant portion of the \nsaid Order is reproduced hereunder for ready reference:  \n “18. Thus, in view of the above, all the captioned complaints are disposed of. No order as to costs.  \n 19. Further the said Project is lapsed  and the Respondent No. 1 has taken no steps till date to seek any \nextension. This Authority shall keep the said Project registration in abeyance and the Respondent shall \nnot advertise, market, book, sell or offer for sale, or invite person/s to purchase i n any manner any \napartment in the said Project till the Respondent No. 1 obtains extensions of the said Project from \nMahaRERA. ” \n \n3. Thereafter o n 27.08.2023  & 24.10.2023  the Complainant s at Sr.  Nos. 1 to 4 herein filed \nan appeal  bearing  No. AT006000000174632 , AT006000000174631 , AT006000000174753  \n& AT006000000174754  before Maharashtra Real Estate Appellate Tribunal  (hereinafter \nreferred to as “ MahaREAT ”) challenging the said final order  which is still pending \nbefore the Appellate Tribunal . \n \n4. On 18.03.2024  an application was made by the  Respondent  No. 1 /Promoter for \nreinstating  the said Pr oject from the list of ‘Projects in abeyance’ to registered Projects  \nlist, thereby effectively seeking lifting of abeyance order on the said Project and making \nit open to all and operational, on the following grounds : \na. That the said Project was kept in abeyance vide said  final order.  \nb. The said order was challenged  on 27.04.2023 & 24.10.2023  before  MahaREAT  \nwhich is awaiting its outcome .  \nc. That the Extension was obtained for the said project and the Authority has \ngranted extension up to 31.03.2024.  Page 3 of 5  d. Despite of obta ining the extension and complying  with the said order, a popup \nis reflecting on the project login webpage.  \ne. Therefore, prays for removal of the said Project from the list of abeyances in \norder to  comply with the other statutory compliance and to seek further \nextension for the said project.  \n \n5. In this regard t he captioned case was heard on 03.04.2024  wherein the following \nroznama  was recorded by th e Authority in the captioned matter s: \n“Parties inform  that the  Authority has passed an order on 30.06.2023. This was appealed \nagainst on 30.08.2023. The Appeal is still pending. In the meantime, it is seen that the extension \ngranted that also been expired. Abeyance Order has also been issued against the project. The \nPromoter informs us that they are in the process of complying with the disclosures in order to \nseek extension and lift the Abeyance. In view of the above the Authority seeks a report from the \nSecretary RERA regarding the status of the project with respect to QPR’s, Extension and \nAbeyance. The Secretary RERA to submit its report on or before the 23.04.2024, subsequent to \nwhich the matter will be reserved for order. ” \n \n6. In view of the Roznama dt. 03.04.2024 , the Secretary MahaRERA filed a report dated \n23.04.2024 (hereinafter referred to as the “ said report ”). The  relevant portion of the said \nreport is reproduced herein:  \n“Observations:  \nAfter examining and scrutinizing  the original proposal of Silver Skyline  project, following \ncompliances  are pending:  \na. Legal Encumbrances  \nb. Form 2A - FY 2022 -23 \nc. Proforma of Agreement for sale  \nd. Form 5 – FY 2022 -23 \ne. Separate bank account details including no encumbrances on the bank account \nor no escrow on the same.  \nf. Deviation report with respect to Allotment letter  \ng. Deviation report with respect to model copy of Agreement  \n \nFor the said project, Part Occupancy certificate has been received dated 09.05.2022 for part slit \n+ 2nd to 11th floors for Wings A &B.  \n \nFurther, the project has been lapsed since its extended date of completion was 31.03.2024 and \nno new extension application has been filed in the said project.  \nConclusion:  \nIf the above - mentioned compliance s are fulfilled and extension application is filed with required \nconsent of allottees in regard to the aforementioned project - Silver Skyline, extension can be \ngranted,  and abeyance order can be lifted .” Page 4 of 5  7. In the present case , the said Project was kept in abe yance vide the said final order , till \nthe Respondent No.1 obtains extensions of  the said project from MahaRERA . It is also \nobserved that the Applicant / Respondent (Promoter ) has taken extension till \n31.03.2024 which has been expired .  Further it is seen that no new extension has been \nfiled in the said project and hence the said project has been lapsed. That the part \nOccupancy certificate for the said project is received on 09.05.2022 bearing No. \n(CE/9331 /WS/AK/OCC/1) issued by the Municipal Corporation of the greater \nMumbai (MCGM) pertaining to wing A & B.  \n \n8. As per the said report dated 03.04.2024 submitted by the Secretary, MahaRERA, \nabeyance order can be lifted and extension can be granted subject to fulfilment of \ncertain mandatory compliances such as updation of Quarterly Progress Reports (QPRs) \nand filing of extension application. However, it is the case of the Applicant/Promoter \nthat due to the abeyance order in effect , his access to the project registration webpage \nhas been restricted, and as such,  he is unable to login and make any further changes in \nthe project registration webpage and is also unable file extension application through \nthe project registration webpage login.  \n \n9. Therefore, in order cure this technical error and ultimately to achieve completion of the \nsaid project, the Authority has no other option but to lift the abeyance order against \nthe said Project subject  to fulfilment of certain mandatory compliances such as \nupdation  of Quarterly Progress Reports (QPRs) more specifically mention in the said \nreport and filing of extension application. However, in the interregnum, the \nApplicant/Promoter shall be given access to the project registration webpage so as to \nenable him to upd ate the mandatory compliances and file extension application. \nThereafter, upon seeking extension of the said project and completing the mandatory \ncompliances, the abeyance order shall be lifted.  \n \nFINAL ORDER  \n10. Therefore, after considering the aforementioned observations, the material placed on \nrecord, the facts of the case and submissions made by the Parties, the Authority passes \nthe following order:  Page 5 of 5  A. IT Manager, MahaRERA to ensure that the Applicant/Promoter shall have \naccess to the Project registration webpage  within a period of 7 days from the \ndate of this order,  so as to  enable him to update the pending mandatory \ncompliance as more specifically mentioned in the said report dated 03.04.20 24 \nand to file extension application.  \nB. The Applicant/Promoter is hereby directed to completed and update the \npending mandatory compliance in the Project registration webpage as more \nspecifically mentioned in the said report dated 03.04.20 24 and also to file \nextension application, both within a period of 30 days from the date of this \norder.  \nC. The Applicant/Promoter upon completion of mandatory compliances and \nfiling of extension application, shall intimate the same to the Secretary, \nMahaRERA, and upon intimation received, Secretary, MahaRERA shall \nreinstate  the said Pr oject from the list of ‘ Projects in abeyance’  to ‘registered \nProjects list’ , thereby effectively lifting the abeyance order on the said Project \nand making it operational in its regular course of business.  \nD. The application is disposed off in terms of the directions given in para no. 10. A. \nto 10. C.  \nE. No order as to cost.  \n \n(Ajoy  Mehta)  \n            Chairperson, MahaRERA  \n \n \n \n  \n \nAJOY \nMEHTADigitally signed \nby AJOY MEHTA \nDate: 2024.06.18 \n13:08:54 +05'30'Page 1 of 12 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \n1. COMPLAINT NO. CC006000000194896  \n1. DEVKUMAR RAMANI  \n2. MRS HEMA DEVKUMAR RAMANI  \n3. JEEN PRAKASH LUDHANI  \n4. NEHA DEVKUMAR RAMANI   \n \n \n…COMPLAINANT S \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI  &  \nLAXMI LUDHANI   \n…COMPLAINANT S \na/w  \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND  …COMPLAINANT  \n \na/w  \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA & ANITA MIRPURI  …COMPLAINANT  \n \nVS \n \n1. PRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. No s. 3 & 4)  \n   \n…RESPONDENT S \n \n \nMAHARERA PROJECT REGISTRATION NO.  P51800004072  \nOrder  \nJune  30, 2023 \n(Date of hearing mentioned in Para No. 4 – matters reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No. 1 &2  \nAdvocate Ooril Panchal a/w Advocate Mahesh Kukreja for the  \nComplainant s at Sr. No. 3 & 4  \nAdvocate Vikramjit Garewal for Respondent No. 1  at Sr. No. 1  to 4 \nAdvocate Aditya Miskita for Respondent No. 2  at Sr. No. 3 & 4  \n \n Page 2 of 12 \n 1. The Complainant s are hom e buyer s and Allottee s within the meaning of Section 2(d) \nof the Real Estate (Regulation and Development) Act, 2016  (hereinafter referred to as \nthe “said Act ”) of Real Estate Regulatory Authority (hereinafter referred to as the \n“RERA ”) and the Respondent  No. 1  is the Promoter/Developer within the meaning \nof Section 2(zk) of the said Act. The Responden t No. 1 is registered as the Promoter \nof the Project namely  “SILVER SKYLINE ” under section 5 of the said Act bearing \nMAHARERA Project  Registration No. P51800004072 (hereinafter referred to as the \n“said Project ”). The said Project is a redevelopment project of Manish Sonal Co -\noperative Housing Society Ltd. ( hereinafter referred to as the  “Society ”) which was \nto be earlier developed by the Respondent No. 2 namely Silvex Developers Private \nLimited .  \n \n2. On the MahaRERA Project registration webpage the proposed completion date  is \n31.07.2021, revised completion date  is mentioned as  30.12.202 2 and extended  \ncompletion date is mentioned as  30.04.2023.  The Project is a lapsed Project and \nOccupation Certificate/ Form 4 (Architect’s Certificate of Completion of Project) is \nnot uploaded on the MahaRERA portal.  \n   \n3. The Complainant s are seeking the following reliefs:   \nSR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n1.  CC006000000194896  i. This Hon’ble Authority be pleased to direct the Respondent to pay interest on Rs. \n2,18,78,350 / -(Two Crores Eighteen Lakhs Seventy Eight Thousand Three Hundred \nFifty Only) paid by the Complainants to the Respondent from the agreed date of \npossession 12th N ovember 2017 till the date of actual possession along with OC in \naccordance to Section 18 of the Real Estate (Regulation & Development) Act 2016.  \nii. This Hon’ble Authority be pleased to direct the Respondent to execute the Sale \nAgreement in accordance wi th the provisions of the Real Estate (Regulation & \nDevelopment) Act 2016 and the Rules made thereunder for both flats as allotted \npursuant to the Consent Terms signed and filed by the Hon’ble High Court of Bombay \nin Arbitration Petition (L) No: 474 of 2015  on 13th May 2015.  \n iii. The Complainants are further entitled for appropriate compensation from the \nRespondent for the grave and irreparable loss and mental agony suffered by them from \n2013.  \niv. Award the costs of these proceedings to the Complainants.  \nv. Grant any other relief which this Hon’ble Authority deems fit and proper under the \nfacts and circumstances of the present case.  \n2.  CC006000000194917  i. This Hon’ble Authority be pleased to direct the Respondent to refund the entire \namount of Rs 1,07,20,000/ - paid by the Applicants to the Respondent along with \ninterest at the rate of 15% p.a. as confirmed by the respondent in its letter dated 13th \nMay 2015 from the date of payment till the date of refund.  \nii. The Applicants are further entitled for appropriate compensation from the \nrespondent for the grave and irreparable loss and mental agony suffered by them.  \niii. Award the costs of these proceedings to the Applicants.  \niv. Grant any other relief which this Hon’ble Authority deems fit a nd \nproper under the facts and circumstances of the present case  Page 3 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n3.  CC006000000196381  a)That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 1,71,28,021/ - being the interest payable @ 18 % p.a. from the \nrespect ive dates of the payment made by the Complainant to Respondent No.2 towards \npart consideration of the said flat. The Complainant has prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ here to. \n  \nb)That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay further \ninterest on and from 16 March 2021 at the rate prescribed by RERA Act and Rules \nmade thereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 86,00,000/ - \n(Rupees Eighty Six Lacs Only) being the present market value of the said flat until \nhanding over possession of said flat.  \n \nc)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements an d get the said RERA \nAgreements registered with Sub  Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximate ly 1400 square \nfeet carpet area along with an exclusive terrace admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 where -under \nfrom the total consideration of Rs. 1,80,00,000 the balance consideration of Rs. \n94,00,000/ - would be paid by the Complainant to Respondent No.1 after deducting \nthe amount paid till date i.e. Rs. 86,00,000/ -. \n \nd)That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainant within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secre tary and/or any authorized \nperson of this Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing being a 3 \nbedroom hall kitchen apartment admeasuring approximately 1400 sq uare feet carpet \narea along with an exclusive terrace admeasuring approximately 1400 square feet \ncarpet area along with two stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainant on behalf of and at the cost of the Respondent No.1 herein and to perform \ntheir part of obligations under the RERA Act as amended.  \n \ne)That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respo ndent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any th ird party right, title and/or interest \nin respect of the said flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximately 1400 square \nfeet carpet area along with an exclusive terra ce admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this \nHon’ble Court deems appropriate in the facts and circumstance s of the present case.  \n \nf)That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representatives, servants, administrator, assigns, e tc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/car parking spaces in the building under  \nconstruction on the said project until payment of Rs. 1,71,28,021/ - (Rupees One Crore \nSeventy One Lac Twenty Eight Thousand Twenty One Only) (calculated along with \ninterest until 15 March 2021) along with further interest on and from 16 March 2021 \ntill da te of possession of the said flat; by the Respondent No.1 to the Complainant;  \n \ng)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due and payable to the Complainant \nand until th en the Complainant would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in the website of this Hon’ble \nAuthority with in 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the Complainant having a \ncharge on the said proj ect property and/or permit the Complainant to erect a Board on Page 4 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nthe said project property intimating public at large, the factum of Complainant having \na charge on the said project property forthwith;  \n \nh)In the alternative to all above prayer clauses above a nd only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to hold that the Respondent No.1 cannot create an y third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainant as prayed for hereinabove;  \n \ni)That this Hon’ble Tribunal be pleased to direct the Respondent No.1 to pay a sum of \nRs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. as \ncompensation to be provided for the mental trauma, loss of time, hardship caused to \nComplainants and the notional losses, legal fees incurred within one month from the \ndate of disposal of t he present Complaint;  \n \nThat this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 of \nRERA Act for giving false information as per section 4 of the Act;  \n4.  CC006000000196392  (a) That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 86,57,366/ - (Rupees Eight Six Lacs Fifty Seven Thousand Three \nHundred Sixty Six only) being the interest payable @ 18 % p.a. from the respective \ndates of the payment made by the Complainants to Respondent No.2 towards part \nconsideration of the said flat. The Complainants have prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ hereto.  \n(b) That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay interest \non and from 15 March 2021 at the rate prescribed by RERA Act and Rules made \nthereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 44,55,000/ -(Rupees \nForty Four Lacs Fif ty Five Thousand Only) being the present market value of the said \nflat until handing over possession of said flat.  \n(c) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements and get  the said RERA \nAgreements registered with Sub -Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 93 5 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 whereunder from the \ntotal consideration of Rs. 92,38,000/ - (Rupees Ninety -Two Lacs Thirty -Eight \nThousa nd only) the balance consideration of Rs. 47,83,000/ - would be paid by the \nComplainants to Respondent No.1 after deducting the amount paid till date i.e. Rs. \n44,55,000/ -.  \n(d) That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainants within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secretary and/or any authorized \nperson of t his Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing being a 2 \nbedroom hall kitchen apartment admeasuring approximately 935 square feet carpet \narea along with one st ilt car parkings on land bearing CTS No. 826 -B situate at \nJ.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainants on behalf of and at the cost of the Respondent No.1 herein and to \nperform their part of obligations under the RERA Act as amended  \n(e) That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. fro m taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of the said flat i.e. a flat bearing No. 1601 on the 16th floor in ‘A’ Win g \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 935 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this Hon’ble Court \ndeems ap propriate in the facts and circumstances of the present case;  \n(f) That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representati ves, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/ car parking spaces in the building under \nconstruction on the said project until payment of Rs. 86,57,366/ - (Rupees Eight Six \nLacs Fifty Seven Thousand Three Hundred Sixty Six only) (calculated along with Page 5 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \ninterest until 15 March 2021) along with further int erest on and from 16 March 2021 \ntill date of possession of the said flat; by the Respondent No.1 to the Complainant;  \n(g) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due an d payable to the Complainants \nand until then the Complainants would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in  the website of this Hon’ble \nAuthority within 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the C omplainants having a \ncharge on the said project property and/or permit the Complainants to erect a Board \non the said project property intimating public at large, the factum of Complainants \nhaving a charge on the said project property forthwith  \n(h) In the alternative to all above prayer clauses above and only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to  hold that the Respondent No.1 cannot create any third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainants as prayed for hereinabove  \n(i) That this Hon’ble Tribunal be pleased to direct the R espondent No.1 to pay a sum \nof Rs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. \nas compensation to be provided for the mental trauma, loss of time, hardship caused \nto Complainants and the notional losses, legal fees incurre d within one month from \nthe date of disposal of the present Complaint;  \n(j) That this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 \nof RERA Act for giving false information as per section 4 of the Act;  \n \n4. The captioned complaints were heard by this Authority on the following dates  \nrespectively wherein the following  roznama s were  recorded : \nSR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \n1.  CC006000000194896  \n01.02.2023  “Both Parties are present.  \nThe Complainant avers that they had booked a flat with the Developer \nSilvex in 2008 for which they paid part consideration of around Rs. \n84 Lakhs. Subsequently, the erstwhile Developer Silvex offered them \nan alternate flat in a redevelopment schem e which they accepted and \ncertain further payments were also made. In the year 2014 the Society \nundergoing redevelopment terminated the development agreement of \nSilvex and a new development agreement came to be executed with \nthe current Respondent as the D eveloper. The Complainant avers \nthat they were not a Party to this. Subsequently, a fresh set of consent \nterms were signed and a new allotment letter was given by the \npresent Developer namely the Respondent. This was executed on \n13.05.2015 wherein date of completion was promised to be 24 \nmonths. The letter also stated how the various remaining instalments \ntowards consideration were to be paid. The Complainant however, \navers that instalments were asked even though the milestones set had \nnot been achieved. Th e Complainant now seeks execution of \nagreement for sale, possession, interest for delay and compensation.  \nThe Respondent avers that consent terms have been executed before \nthe High Court and the higher terms payable were in fact decided in \nthe Hon’ble High  Court. The consent terms in Clause 8 clearly state \nthat all the claims will be addressed by Silverex the erstwhile \nDeveloper. The Respondent further avers that they were called upon \nto execute the agreement for sale in 2015 and also subsequently which \nthe Complainant never came forward. The Respondent also avers that \naround Rs. 83 Lakhs consideration is still outstanding from the \nComplainant and they have not paid the same. The Respondent avers \nthe delays have taken place because of Society not assigning t hem the \nright which were as per the consent terms before the High Court.  2.  CC006000000194917  Page 6 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nThe Complainant avers that they did seek the agreement for sale but \nwere given the same with the revised date of possession which was \nnot acceptable to them.  \nParties are at liberty to  file written submissions, if any, by \n13.02.2023. Subsequent to which, the matter will be reserved for \norders.”  \n3.  CC006000000196381  \n08.03.2023  ““All parties are present.  \nThe Complainant avers that a letter of allotment dated 15.05.2009 \nwas executed by Respondent No. 2 - the erstwhile Developer, now \nRespondent No. 1 has stepped in as the current Developer. The \nComplainant had paid around Rs. 30 Lakhs at the time of letter of \nallotment and the further Rs. 56 Lakhs and in the agg regate has paid \nover Rs. 86 Lakhs. The date of possession was given as 31.12.2011. \nThe Complainant avers that in 2012 the Project stopped and they \nwere not able to communicate with the Promoter. Subsequently, a \npurported email was sent by Respondent No. 2 to the husband of the \nAllotee and not the Allottee himself which involved changing the \nterms of the agreement. The Complainant avers that the consent \nterms were signed between Respondent No. 1, Respondent No. 2 and \nthe Society and they are now being asked to make higher payments \nagainst a lower area. The Complainant seeks execution of agreement \nfor sale and also interest to be paid for the amounts paid by him and \nthe delays therein. On the issues of the Complainant at Sr. No. 7 the \nfacts of the case remain same except for the fact that the Complainant \nNo. 7 did not even receive the email purported have been sent by the \nRespondent No. 2.  \nRespondent No. 1 avers that this as a society redevelopment Project \nundertaken by the Respondent No. 2 – the erstwhile Deve loper. This \ndevelopment agreement was terminated by the Society. The matter \nwas taken up by the Bombay High Court as Society had appointed \nthe Respondent No. 1 in 2015 to complete the Project. An arbitration \nproceeding took place subsequent to which 2 cons ent terms were \nsigned – 1. Between Respondent No. 1, Respondent No. 2 and the \nSociety and second between Respondent No. 1, Respondent No. 2, \nSociety and the majority of the flat purchasers. The consent terms \nhave been acted upon by the Parties and the same  have also been filed \nbefore the High Court. The consent terms fundamentally gave 2 \noptions to the Allottees namely to either pay escalation and continue \nin the Project and in case not willing to pay escalation then to take \nrefund and claim the interest fr om Respondent No. 2. All flat \npurchasers were sent letters. The Respondent No. 1 further avers that \nfrom 2011 nothing has been paid by the Complainant further to an \nemail dated 25.04.2015 a detailed computation giving the exact \nescalation involved was also  sent on the mail address given by the \nAllottee. Th Respondent also avers that there was a group represented \nby the Allotee which also attempted to negotiate the escalation but it \ndid not conclude as no response was forth coming.  \nTh Respondent No. 1 says t hat Section 15 of RERA does not apply \nhere as the consent terms were taken before the High Court in 2015 \nwhich is pre -RERA. The Respondent states that in case there are \ncertain issues regarding interest then the same forms a part of \nliabilities of Responde nt No. 2. The Respondent No.1 is today unable \nto offer terms different to those offered to other Allottees. The demand \nletters issued from 2015 onwards have also not been responded to by \nthe Complainant. The Respondent No. 1 also states that RERA in no \nway leaves the Complainant remediless and there are other laws with \nprovisions under which the Complainant can seek redressal.  \nThe Respondent No. 2 states that this is a misjoinder of Parties and \nthat he is not a necessary Party as he has handed over the Project to \nRespondent No. 1 and as such Respondent No. 2 is not a Promoter \nanymore . In fact, the handing over took place prior t o RERA. The \nRespondent No. 2 further avers that a scheme was formulated way 4.  CC006000000196392  Page 7 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nback at the time of transfer of Project from Respondent No. 2 to \nRespondent No. 1 and today after 7 -8 years the Complainants cannot \ncome forward seeking compensation from the Respo ndent No. 2. The \nRespondent No. 2 avers that since he was dealing with the Project \nprior to RERA he was never a Promoter as defined and envisaged \nunder RERA.  \nThe Complainant reiterates that they are not part of any group \nnegotiating the terms and instead t hey have individual agreements \nand they seek performance of the same. There is no letter or any other \ndocument to show that they were represented by a particular person \nas a part of a group. In the consent terms and deed of assignment the \nterm escalation i s not mentioned.  \nParties are at liberty to file written submissions, if any, \nby23.03.2023. Subsequent to which, the matter will be reserved for \norders  “ \n \n5. The brief facts and submissions of the parties  are as follows : \nSR. \nNO.   \nCOMPLAINT NOS./  \nCOMPLAINT \nFILING DATE  FLAT / \nBUILDIN\nG NO.  DATE OF \nAL1 TOTAL \nCONSIDERATIO\nN (INR)  TOTAL AMOUNT \nPAID  \n(INR)  \n1.  CC006000000194896 \n12.11.2020  1004/2003  \n& \n2002  13.05.2015  1,94,03,350  \n& \n98,75,000  2,08,78,350  \n(combined as per CT2) \n2.  CC006000000194917  \n13.11.2020  1702  \n& \n1802  13.05.2015  1,16,50,000  \n& \n1,12,75,000  85,20,000  \n(combined as per CT ) \n3.  CC006000000196381 \n19.03.2021  1801  15.05.2009  1,80,00,000  86,86,520  \n(as per complaint ) \n4.  CC006000000196392  \n19.03.2021  1601  15.05.2009  92,38,000  44,55,000  \n(as per complaint ) \n \n6. The submission s of all the Parties herein are perused and taken on record by the \nAuthority. However, b efore moving ahead, the following dates and events  are \nnoteworthy:  \nDATES  EVENTS  \n13.05.20008  A development agreement was executed between the Society and the Respondent No. 2 \nherein for redevelopment  of the existing building and constructing the said Project.  \nDate s not \nsubmitted  \n Allotment letter issued to Complainants at Sr. No. 1 by the Respondent No. 2 herein for flat \nNos. 103, 502, 503, 1602, 1702, 1805, 1905 & 2004 ( no further details submitted ). \nAllotment letter issued to Complainants at Sr. No. 2 by the Respondent No. 2 herein for flat \nNos. 1702 & 1802  with one car park (no further details submitted ). \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 3 by the Respondent No. 2 herein  (details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ).  \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 4 by the Respondent No. 2 herein ( details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ). \n31.01.2015  Termination Notice issue by the Society to the Respondent No. 2. \n \n1 AL- Allotment Letter  \n2 CT –Consent Terms  Page 8 of 12 \n 16.03.2015  Respondent No. 2 filed an arbitration petition No.(l) 474 of 2015 before the Hon’ble Bombay \nHigh Court  against the Society  (“said arbitration petition ”).  \n09.05.2015  The said arbitration petition was disposed of pursuant to consent terms being filed between \nthe Respondents herein along with Society and also between the Complainants at Sr. Nos. 1 \n& 2 (“ said consent terms ”).   13.05.2015  \n13.05.2015  Fresh a llotment letter s were issued to Complainants at Sr. No. 1 by the Respondent No. 1 \nherein  with new flats numbers and with escalated prices ( mentioned in table at para No. 5 \nhereinabove ). \n13.05.2015  Fresh allotment letter s were  issued to Complainants at Sr. No. 2 by the Respondent No. 1 \nherein with escalated prices for the flats retained from old allotments (mentioned in table at \npara No. 5 hereinabove ). \n29.07.2017  The Respondent No. 1 applied for seeking the said Project registration before MahaRERA.  \n07.08.2017  The Respondent No. 1 was granted the said Project registration.  \n28.03.2018  A deed of assignment was executed between the Respondents and the Society assigning the \nentire development rights to the Respondent No. 1 herein  (“said assignment deed ”).  \n12.11.2020  The complaint at Sr. No. 1 was filed by the Complainants at Sr. No. 1 against the Respondent \nNo. 1 seeking reliefs mentioned in table at p ara No. 3 hereinabove.   \n13.11.2020  The complaint at Sr. No. 2 was filed by the Complainants at Sr. No. 2 against the Respondent \nNo. 1 seeking reliefs mentioned in table at para No.3 hereinabove.  \n19.03.2021  The complaints at Sr. Nos. 3 & 4 were filed by the Complainants at Sr. Nos. 3 & 4 a gainst the \nRespondent Nos. 1 & 2 seeking reliefs mentioned in table at para No.3 hereinabove.  \n \n7. From the facts and the submissions, the issue s that needs to be considered are as \nfollows:  \na. Whether the Complainants are entitled to seek reliefs under Section 18 of the said Act ? \nb. Any other order?  \n \n8. From the above enumeration  it is very clear that certain events have taken place \nbefore the advent  of RERA and there  are events that ha ve taken place after RERA \nwas notified.  In the pre -RERA period,  a development agreement was executed \nbetween the Society and Respondent No.2. Subsequently the Society terminated the \ndevelopment agreement . Upo n the termination of the development agreement an \narbitration proceeding took place before the Hon’ble Bombay H igh Court  which \nculminated in the execution of said consent terms.  \n \n9. Some of the  terms that were agreed upon  under the said consent terms executed \nbetween the Respondents herein along with Society and the Complainants at Sr. Nos. \n1 & 2 on 13.05.2015 before the Hon’ble Bombay High Court in the said arbitration \npetition are reproduced hereinbelow : Page 9 of 12 \n “8. The Petition ers further agree and undertake to Hon’ble Court that in the event any claim or demand is made \nagainst the Respondent No. 2, and/or om respect of any of the flats, they will defend such claims/demands on \ntheir own cost and shall indemnify and shall keep in demnified the Respondent No. 2 against such claim/demand, \nloss/damages that may be suffered by the Petitioners as well as all cost, charges and expenses that may be \nincurred by the Respondent No. 2  to defend such claims or demands.  \n \n10. The Petitioners and Respondent No. 2 confirm that the allotment of Flat Nos. 1904/2003 and 2002 \n(collectively called “the said flats”) along with exclusive right to use 4 (four) Car Parking Spaces (“said Car \nParking Spaces”) in favour of Respondents No s. 3 to 6 as set out hereinafter in the proposed building to be \nnamed as “Silver Skyline” being constructed on the land bearing CTS No. 826 and 827 of village Ambivali \npursuant to Development Agreement dated 13.05.2008 made between Respondent No. 1 Society  and the \nPetitioners is valid, subsisting and binding upon them.  \n \n11. Respondent No. 2, at the request of the Petitioners and Respondent No. 3 to 6, agree to honour allotment of \nthe aforesaid flats   right to use 4 Car Parking Spaces and enter into and register formal Agreement for Sale in \nrespect thereof with the Respondent No. 3 to 6 or such of them as may be directed by them. The details of the said \nflats, carpet area thereof, total consideration, amount received, balance payable and no. and nature of  car parking \nspaces is set out hereunder…  \n \n13.In view of the consent terms and allotment letters executed in respect of the said premises, the earlier \nallotment made by the Petitioner to the Respondent No. 3 to 6 in respect of the remaining flats, i.e. Fla t Nos., \n103, 502, 503, 1602, 1702, 1805, 1905 and 2004 is cancelled. It is hereby clarified that he aforesaid cancellation \nshall not affect the rights of Respondent No. 7 & 8 in Flat no. 1702 as provided in Clause 18 herein below. \nRespondent No. 3 to 6 con firm that credit of the payment, if any, made in respect of the above cancelled flats is \ngiven in Flat Nos. 1904/2003 and 2002.  \n \n20. by separate Consent Terms of even date made between the Petitioners and Respondent No. 1 and 2, dispute \nwith the Society be ing Respondent No. 1 herein is settled. Agreed, ordered and declared that the benefits of the \nsaid Consent Term in respect of the Premises set out hereinabove will ensure to the benefit of Respondent Nos. \n3 to 6 subject to the Respondent Nos. 3 to 6 paying  balance consideration and other amounts as per the agreed \nterms. ” \n \n10. It is also an admitted fact that none of the Complainants have executed agreements \nfor sale with either of the Respondents herein . The only document that the \nComplainant s hold  as on date are the letters  of allotment towards the apartments  \nallotted to each and further the records of the payments made by each of them. The \nallotment letters of Complainants at Sr. Nos. 1  & 2 issued by Respondent No. 1 after \nthe execution of the  said consent terms  mentions not only the escalated consideration  \namounts to be paid by the m but also the new apartment numbers allotted to them. It \nis also observed that Complainants  at Sr. Nos. 3 & 4 claim to have only the original \nallotment letters without any further documents indicating  escalated amounts to be \npaid or the numbers of new apartments  to be allotted. Even  the original allotment \nletters claimed by the Complainants  at Sr. Nos. 3 & 4 which  have been issued by the \nRespondent No. 2 herein  have not been uploaded  by them .  Page 10 of 12 \n 11. It is pertinent to note that the fresh allotments issued by the Respondent No. 1 to the \nComplainants at Sr. Nos. 1 & 2 at para No.5 stated as follows:  \n“5. Subject to force majeure as well as other circumstances beyond our control including Policy of the \nGovernment/MCGM and sanction of the plans and requisite permission in time, we propose to complete the \nbuilding and offer possession within a period of 24 months from the date hereof with a grace period of 6 months. ” \n \n12. It is pertinent to note that the said assignment deed at recital W stated the following:  \n “W. The Assignee/ Developer confirms that they will carry out and complete the construction and offer \npossession of the premises to the existing members of the society w ithin the period stipulated here under read \nwith Development Agreement dated 13.05.2008 and the Terms dated 13.05.2015 subject to force majeure and/or \nother circumstances beyond the control of the Assignee. The Society confirms that period of 21 months dur ing \nwhich the Assignee/ Developer could not get permission to carry out construction will not be taken into \nconsideration while calculating the aforesaid period.”  \n \n13. It is thus clear that subsequent to the said consent terms filed as a result of the said \narbitration petition the transactions between the Part ies were to be carried out as per \nthe said consent terms. These said consent terms  were agreed upon and executed \nsubsequent to an arbitration plea under the oversight  of the Hon’ble Bombay High \nCourt . Thes e said consent terms predate the notification giving effect to the said Act. \nWith th ese said consent terms  on record, the Parties today have no option but to \nfollow the terms as envisaged  and laid out therein . As mentioned above the said \nconsent terms  have very clearly dealt with the  escalation amounts, the completion \ndates and such other items that are necessary to conclude a real estate project.  The \nParties should have executed sale deeds  / agreement for sale  in keeping and in line \nwith these consent terms. With these said consent terms  on record the Authority has \nno mandate to interpret them and adjudicate upon the manner and the conditions \nthat should be a part  of the sale deed  / agreement for sale  to be exe cuted between \nthe Parties. These said consent terms were executed before the advent of RERA and \nas a part of the arbitration proceedings. Thus, issues relating to its interpretation \ncannot be a part of an adjudication process of this Authority.  \n \n14. The Compl ainants at Sr. Nos. 1 & 2 and the Respondent No.1 must hence proceed to \nexecute the agreement for sale as laid out in the said consent terms . The Authority \nsees no reason to intervene in the same. With respect to reliefs under Section 18 for \nthe Complainants at Sr. No. 1 & 2 it is to be noted that subsequent to the said consent Page 11 of 12 \n terms  no document has been executed between the Parties to enable th e Authority  to \nadjudicate upon reliefs that they may be entitled  to under Section 18 of the said Act.  \nThe Parties are seeking reliefs under Section 18 based on allotment letters  which were  \nissued prior to RERA. Not only were these allotment letters issued prior to RERA but \nfurther the said consent terms  executed have overtaken the recitals in the allotment \nletters . The said consent terms  have clearly laid out the profile of the relationship \nbetween the Respondent No. 1 herein  and the Allottees  i.e. the Comp lainants at Sr. \nNos. 1 & 2 herein . The said consent terms  have further gone and have also set out the \nmanner in which any prior  claims and liabilities  would be sought and the Party \nagainst  whom  the same shall be executable.  With the executing of the said consent \nterms a curtain has fallen on all events before that and it is the said consent terms \nthat shall now hold ground and any other document subsequent to this. With these \nbeing the facts,  the Authority observes that the allotment letter  cannot be the basis \nfor determining whether a grievance exists and for which a remedy should be \ngranted. Hence the issue at para No. 7(a)  is answered in the negative .  \n \n15. The Complainants at Sr. N so. 1 & 2 have also sought reliefs with regar d to an order \nof permanent injunction and restraining of the Respondent No. 1 from disposal of \ntheir apartments. Since the Parties have failed to take action subsequent to the said \nconsent terms which has resulted in them failing to re -establish their righ ts and \nobligations it would not be prudent to issue any injunction orders.  Hence the issue \nat para No. 7( b) is answered in the negative . \n \n16. In view of the above Complainants  at Sr. Nos.1 & 2 and the Respondent at Sr. No. 1 \nare directed to take such steps to execute the agreement for sale in keeping with the \nsaid consent terms .  \n \n17. In the complaints at Sr. Nos. 3 & 4 the Complainants have failed to provide the \noriginal allotment  letters . However,  the Authority also notes that the availability  of \nthe allotment letters  has not been challenged. The Authority  would therefore  assume \nthat in view if the fact  that there is no challenge to the statement being made by the \nComplainants  Nos. 3 & 4 , the allotment letters  exist . However,  since the Authority is Page 12 of 12 \n not privy to the allotment letters it would not be able to adjudicate upon the \ngrievances sought to be redressed.  Further  since the said consent terms  are on record , \nthe Authority  will limit itself to directing the Parties to abide by the said consent \nterms while moving ahead  in the matters.  \n \n18. Thus, in view of the above, all the captioned complaints are disposed of . No order as \nto costs.    \n \n19. Further the said Project is lapsed and the Respondent No. 1 has taken no steps till \ndate to seek any extension. This Authority shall keep the said Project registration in \nabeyance  and the Respondent shall not advertise, market, book, sell or offer for sale, \nor invite person/s to purchase in any manner any apartment  in the said Project till \nthe Respondent No. 1 obtains extensions of the said Project from MahaRERA.       \n \n \n  (Ajoy  Mehta)  \n      Chairperson, MahaRERA\n  \n \n \nAJOY MEHTADigitally signed by AJOY \nMEHTA \nDate: 2023.07.03 11:27:59 \n+05'30'"
    },
    {
        "file_name": "5.SILVER SKYLINE.pdf",
        "text": "Page 1 of 5  BEFORE THE  MAHARASHTRA  \nREAL  ESTATE  REGULATORY  AUTHORITY,  MUMBAI  \nVirtual  Hearing  held  through  video  conference  as per \nMahaRERA  Circular  No.:  27/2020  \n \nPRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD          …APPLICANT  \nIN \n1. COMPLAINT NO. CC006000000194896  \nDEVKUMAR RAMANI,  \nMRS HEMA DEVKUMAR RAMANI,  \nJEEN PRAKASH LUDHANI  & \nNEHA DEVKUMAR RAMANI       …. COMPLAINANT/S  \n  \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI &  \nLAXMI LUDHANI         …. COMPLAINANT/S  \n \na/w \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND        …COMPLAINANT /S \n \na/w \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA &  \nANITA MIRPURI         …COMPLAINANT /S \nVS \n \n1.PRABHAV REALTY & INFRASTRUCTURE PVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. Nos. 3 & 4)   …RESPONDENT/S.  \n \nMAHARERA PROJECT REGISTRATION NO. P51800004072  \n \nOrder  \n(In an application for removal of abeyance ) \nJune  14, 2024  \n(Date of hearing 03.04.2024 - matters  were reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No s. 1 &2  \nAdvocate Mahesh L. Kukreja present  for the Complainants at Sr. No s. 3 & 4  \nAdvocate Sanjeel Kadam  present for the Respondent at Sr. Nos. 1 to 4Page 2 of 5   \n1. The Applicant  herein had registered the project namely “SILVER SKYLINE ” under \nsection 5 of the Real Estate (Regulation and Development) Act, 2016 (“ said Act ”) of \nReal Estate Regulatory Authority (“ RERA ”) bearing MAHARERA Registration No. \nP51800004072 (hereinafter referred to as the “ said Project ”).  \n \n2. The captioned complaint was  heard by this Authority and a f inal Order dt. 30.06.2023  \nwas passed (hereinafter referred to as the “said  final order” ). The relevant portion of the \nsaid Order is reproduced hereunder for ready reference:  \n “18. Thus, in view of the above, all the captioned complaints are disposed of. No order as to costs.  \n 19. Further the said Project is lapsed  and the Respondent No. 1 has taken no steps till date to seek any \nextension. This Authority shall keep the said Project registration in abeyance and the Respondent shall \nnot advertise, market, book, sell or offer for sale, or invite person/s to purchase i n any manner any \napartment in the said Project till the Respondent No. 1 obtains extensions of the said Project from \nMahaRERA. ” \n \n3. Thereafter o n 27.08.2023  & 24.10.2023  the Complainant s at Sr.  Nos. 1 to 4 herein filed \nan appeal  bearing  No. AT006000000174632 , AT006000000174631 , AT006000000174753  \n& AT006000000174754  before Maharashtra Real Estate Appellate Tribunal  (hereinafter \nreferred to as “ MahaREAT ”) challenging the said final order  which is still pending \nbefore the Appellate Tribunal . \n \n4. On 18.03.2024  an application was made by the  Respondent  No. 1 /Promoter for \nreinstating  the said Pr oject from the list of ‘Projects in abeyance’ to registered Projects  \nlist, thereby effectively seeking lifting of abeyance order on the said Project and making \nit open to all and operational, on the following grounds : \na. That the said Project was kept in abeyance vide said  final order.  \nb. The said order was challenged  on 27.04.2023 & 24.10.2023  before  MahaREAT  \nwhich is awaiting its outcome .  \nc. That the Extension was obtained for the said project and the Authority has \ngranted extension up to 31.03.2024.  Page 3 of 5  d. Despite of obta ining the extension and complying  with the said order, a popup \nis reflecting on the project login webpage.  \ne. Therefore, prays for removal of the said Project from the list of abeyances in \norder to  comply with the other statutory compliance and to seek further \nextension for the said project.  \n \n5. In this regard t he captioned case was heard on 03.04.2024  wherein the following \nroznama  was recorded by th e Authority in the captioned matter s: \n“Parties inform  that the  Authority has passed an order on 30.06.2023. This was appealed \nagainst on 30.08.2023. The Appeal is still pending. In the meantime, it is seen that the extension \ngranted that also been expired. Abeyance Order has also been issued against the project. The \nPromoter informs us that they are in the process of complying with the disclosures in order to \nseek extension and lift the Abeyance. In view of the above the Authority seeks a report from the \nSecretary RERA regarding the status of the project with respect to QPR’s, Extension and \nAbeyance. The Secretary RERA to submit its report on or before the 23.04.2024, subsequent to \nwhich the matter will be reserved for order. ” \n \n6. In view of the Roznama dt. 03.04.2024 , the Secretary MahaRERA filed a report dated \n23.04.2024 (hereinafter referred to as the “ said report ”). The  relevant portion of the said \nreport is reproduced herein:  \n“Observations:  \nAfter examining and scrutinizing  the original proposal of Silver Skyline  project, following \ncompliances  are pending:  \na. Legal Encumbrances  \nb. Form 2A - FY 2022 -23 \nc. Proforma of Agreement for sale  \nd. Form 5 – FY 2022 -23 \ne. Separate bank account details including no encumbrances on the bank account \nor no escrow on the same.  \nf. Deviation report with respect to Allotment letter  \ng. Deviation report with respect to model copy of Agreement  \n \nFor the said project, Part Occupancy certificate has been received dated 09.05.2022 for part slit \n+ 2nd to 11th floors for Wings A &B.  \n \nFurther, the project has been lapsed since its extended date of completion was 31.03.2024 and \nno new extension application has been filed in the said project.  \nConclusion:  \nIf the above - mentioned compliance s are fulfilled and extension application is filed with required \nconsent of allottees in regard to the aforementioned project - Silver Skyline, extension can be \ngranted,  and abeyance order can be lifted .” Page 4 of 5  7. In the present case , the said Project was kept in abe yance vide the said final order , till \nthe Respondent No.1 obtains extensions of  the said project from MahaRERA . It is also \nobserved that the Applicant / Respondent (Promoter ) has taken extension till \n31.03.2024 which has been expired .  Further it is seen that no new extension has been \nfiled in the said project and hence the said project has been lapsed. That the part \nOccupancy certificate for the said project is received on 09.05.2022 bearing No. \n(CE/9331 /WS/AK/OCC/1) issued by the Municipal Corporation of the greater \nMumbai (MCGM) pertaining to wing A & B.  \n \n8. As per the said report dated 03.04.2024 submitted by the Secretary, MahaRERA, \nabeyance order can be lifted and extension can be granted subject to fulfilment of \ncertain mandatory compliances such as updation of Quarterly Progress Reports (QPRs) \nand filing of extension application. However, it is the case of the Applicant/Promoter \nthat due to the abeyance order in effect , his access to the project registration webpage \nhas been restricted, and as such,  he is unable to login and make any further changes in \nthe project registration webpage and is also unable file extension application through \nthe project registration webpage login.  \n \n9. Therefore, in order cure this technical error and ultimately to achieve completion of the \nsaid project, the Authority has no other option but to lift the abeyance order against \nthe said Project subject  to fulfilment of certain mandatory compliances such as \nupdation  of Quarterly Progress Reports (QPRs) more specifically mention in the said \nreport and filing of extension application. However, in the interregnum, the \nApplicant/Promoter shall be given access to the project registration webpage so as to \nenable him to upd ate the mandatory compliances and file extension application. \nThereafter, upon seeking extension of the said project and completing the mandatory \ncompliances, the abeyance order shall be lifted.  \n \nFINAL ORDER  \n10. Therefore, after considering the aforementioned observations, the material placed on \nrecord, the facts of the case and submissions made by the Parties, the Authority passes \nthe following order:  Page 5 of 5  A. IT Manager, MahaRERA to ensure that the Applicant/Promoter shall have \naccess to the Project registration webpage  within a period of 7 days from the \ndate of this order,  so as to  enable him to update the pending mandatory \ncompliance as more specifically mentioned in the said report dated 03.04.20 24 \nand to file extension application.  \nB. The Applicant/Promoter is hereby directed to completed and update the \npending mandatory compliance in the Project registration webpage as more \nspecifically mentioned in the said report dated 03.04.20 24 and also to file \nextension application, both within a period of 30 days from the date of this \norder.  \nC. The Applicant/Promoter upon completion of mandatory compliances and \nfiling of extension application, shall intimate the same to the Secretary, \nMahaRERA, and upon intimation received, Secretary, MahaRERA shall \nreinstate  the said Pr oject from the list of ‘ Projects in abeyance’  to ‘registered \nProjects list’ , thereby effectively lifting the abeyance order on the said Project \nand making it operational in its regular course of business.  \nD. The application is disposed off in terms of the directions given in para no. 10. A. \nto 10. C.  \nE. No order as to cost.  \n \n(Ajoy  Mehta)  \n            Chairperson, MahaRERA  \n \n \n \n  \n \nAJOY \nMEHTADigitally signed \nby AJOY MEHTA \nDate: 2024.06.18 \n13:08:54 +05'30'Page 1 of 12 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \n1. COMPLAINT NO. CC006000000194896  \n1. DEVKUMAR RAMANI  \n2. MRS HEMA DEVKUMAR RAMANI  \n3. JEEN PRAKASH LUDHANI  \n4. NEHA DEVKUMAR RAMANI   \n \n \n…COMPLAINANT S \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI  &  \nLAXMI LUDHANI   \n…COMPLAINANT S \na/w  \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND  …COMPLAINANT  \n \na/w  \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA & ANITA MIRPURI  …COMPLAINANT  \n \nVS \n \n1. PRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. No s. 3 & 4)  \n   \n…RESPONDENT S \n \n \nMAHARERA PROJECT REGISTRATION NO.  P51800004072  \nOrder  \nJune  30, 2023 \n(Date of hearing mentioned in Para No. 4 – matters reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No. 1 &2  \nAdvocate Ooril Panchal a/w Advocate Mahesh Kukreja for the  \nComplainant s at Sr. No. 3 & 4  \nAdvocate Vikramjit Garewal for Respondent No. 1  at Sr. No. 1  to 4 \nAdvocate Aditya Miskita for Respondent No. 2  at Sr. No. 3 & 4  \n \n Page 2 of 12 \n 1. The Complainant s are hom e buyer s and Allottee s within the meaning of Section 2(d) \nof the Real Estate (Regulation and Development) Act, 2016  (hereinafter referred to as \nthe “said Act ”) of Real Estate Regulatory Authority (hereinafter referred to as the \n“RERA ”) and the Respondent  No. 1  is the Promoter/Developer within the meaning \nof Section 2(zk) of the said Act. The Responden t No. 1 is registered as the Promoter \nof the Project namely  “SILVER SKYLINE ” under section 5 of the said Act bearing \nMAHARERA Project  Registration No. P51800004072 (hereinafter referred to as the \n“said Project ”). The said Project is a redevelopment project of Manish Sonal Co -\noperative Housing Society Ltd. ( hereinafter referred to as the  “Society ”) which was \nto be earlier developed by the Respondent No. 2 namely Silvex Developers Private \nLimited .  \n \n2. On the MahaRERA Project registration webpage the proposed completion date  is \n31.07.2021, revised completion date  is mentioned as  30.12.202 2 and extended  \ncompletion date is mentioned as  30.04.2023.  The Project is a lapsed Project and \nOccupation Certificate/ Form 4 (Architect’s Certificate of Completion of Project) is \nnot uploaded on the MahaRERA portal.  \n   \n3. The Complainant s are seeking the following reliefs:   \nSR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n1.  CC006000000194896  i. This Hon’ble Authority be pleased to direct the Respondent to pay interest on Rs. \n2,18,78,350 / -(Two Crores Eighteen Lakhs Seventy Eight Thousand Three Hundred \nFifty Only) paid by the Complainants to the Respondent from the agreed date of \npossession 12th N ovember 2017 till the date of actual possession along with OC in \naccordance to Section 18 of the Real Estate (Regulation & Development) Act 2016.  \nii. This Hon’ble Authority be pleased to direct the Respondent to execute the Sale \nAgreement in accordance wi th the provisions of the Real Estate (Regulation & \nDevelopment) Act 2016 and the Rules made thereunder for both flats as allotted \npursuant to the Consent Terms signed and filed by the Hon’ble High Court of Bombay \nin Arbitration Petition (L) No: 474 of 2015  on 13th May 2015.  \n iii. The Complainants are further entitled for appropriate compensation from the \nRespondent for the grave and irreparable loss and mental agony suffered by them from \n2013.  \niv. Award the costs of these proceedings to the Complainants.  \nv. Grant any other relief which this Hon’ble Authority deems fit and proper under the \nfacts and circumstances of the present case.  \n2.  CC006000000194917  i. This Hon’ble Authority be pleased to direct the Respondent to refund the entire \namount of Rs 1,07,20,000/ - paid by the Applicants to the Respondent along with \ninterest at the rate of 15% p.a. as confirmed by the respondent in its letter dated 13th \nMay 2015 from the date of payment till the date of refund.  \nii. The Applicants are further entitled for appropriate compensation from the \nrespondent for the grave and irreparable loss and mental agony suffered by them.  \niii. Award the costs of these proceedings to the Applicants.  \niv. Grant any other relief which this Hon’ble Authority deems fit a nd \nproper under the facts and circumstances of the present case  Page 3 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n3.  CC006000000196381  a)That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 1,71,28,021/ - being the interest payable @ 18 % p.a. from the \nrespect ive dates of the payment made by the Complainant to Respondent No.2 towards \npart consideration of the said flat. The Complainant has prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ here to. \n  \nb)That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay further \ninterest on and from 16 March 2021 at the rate prescribed by RERA Act and Rules \nmade thereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 86,00,000/ - \n(Rupees Eighty Six Lacs Only) being the present market value of the said flat until \nhanding over possession of said flat.  \n \nc)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements an d get the said RERA \nAgreements registered with Sub  Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximate ly 1400 square \nfeet carpet area along with an exclusive terrace admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 where -under \nfrom the total consideration of Rs. 1,80,00,000 the balance consideration of Rs. \n94,00,000/ - would be paid by the Complainant to Respondent No.1 after deducting \nthe amount paid till date i.e. Rs. 86,00,000/ -. \n \nd)That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainant within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secre tary and/or any authorized \nperson of this Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing being a 3 \nbedroom hall kitchen apartment admeasuring approximately 1400 sq uare feet carpet \narea along with an exclusive terrace admeasuring approximately 1400 square feet \ncarpet area along with two stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainant on behalf of and at the cost of the Respondent No.1 herein and to perform \ntheir part of obligations under the RERA Act as amended.  \n \ne)That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respo ndent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any th ird party right, title and/or interest \nin respect of the said flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximately 1400 square \nfeet carpet area along with an exclusive terra ce admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this \nHon’ble Court deems appropriate in the facts and circumstance s of the present case.  \n \nf)That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representatives, servants, administrator, assigns, e tc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/car parking spaces in the building under  \nconstruction on the said project until payment of Rs. 1,71,28,021/ - (Rupees One Crore \nSeventy One Lac Twenty Eight Thousand Twenty One Only) (calculated along with \ninterest until 15 March 2021) along with further interest on and from 16 March 2021 \ntill da te of possession of the said flat; by the Respondent No.1 to the Complainant;  \n \ng)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due and payable to the Complainant \nand until th en the Complainant would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in the website of this Hon’ble \nAuthority with in 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the Complainant having a \ncharge on the said proj ect property and/or permit the Complainant to erect a Board on Page 4 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nthe said project property intimating public at large, the factum of Complainant having \na charge on the said project property forthwith;  \n \nh)In the alternative to all above prayer clauses above a nd only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to hold that the Respondent No.1 cannot create an y third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainant as prayed for hereinabove;  \n \ni)That this Hon’ble Tribunal be pleased to direct the Respondent No.1 to pay a sum of \nRs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. as \ncompensation to be provided for the mental trauma, loss of time, hardship caused to \nComplainants and the notional losses, legal fees incurred within one month from the \ndate of disposal of t he present Complaint;  \n \nThat this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 of \nRERA Act for giving false information as per section 4 of the Act;  \n4.  CC006000000196392  (a) That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 86,57,366/ - (Rupees Eight Six Lacs Fifty Seven Thousand Three \nHundred Sixty Six only) being the interest payable @ 18 % p.a. from the respective \ndates of the payment made by the Complainants to Respondent No.2 towards part \nconsideration of the said flat. The Complainants have prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ hereto.  \n(b) That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay interest \non and from 15 March 2021 at the rate prescribed by RERA Act and Rules made \nthereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 44,55,000/ -(Rupees \nForty Four Lacs Fif ty Five Thousand Only) being the present market value of the said \nflat until handing over possession of said flat.  \n(c) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements and get  the said RERA \nAgreements registered with Sub -Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 93 5 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 whereunder from the \ntotal consideration of Rs. 92,38,000/ - (Rupees Ninety -Two Lacs Thirty -Eight \nThousa nd only) the balance consideration of Rs. 47,83,000/ - would be paid by the \nComplainants to Respondent No.1 after deducting the amount paid till date i.e. Rs. \n44,55,000/ -.  \n(d) That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainants within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secretary and/or any authorized \nperson of t his Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing being a 2 \nbedroom hall kitchen apartment admeasuring approximately 935 square feet carpet \narea along with one st ilt car parkings on land bearing CTS No. 826 -B situate at \nJ.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainants on behalf of and at the cost of the Respondent No.1 herein and to \nperform their part of obligations under the RERA Act as amended  \n(e) That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. fro m taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of the said flat i.e. a flat bearing No. 1601 on the 16th floor in ‘A’ Win g \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 935 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this Hon’ble Court \ndeems ap propriate in the facts and circumstances of the present case;  \n(f) That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representati ves, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/ car parking spaces in the building under \nconstruction on the said project until payment of Rs. 86,57,366/ - (Rupees Eight Six \nLacs Fifty Seven Thousand Three Hundred Sixty Six only) (calculated along with Page 5 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \ninterest until 15 March 2021) along with further int erest on and from 16 March 2021 \ntill date of possession of the said flat; by the Respondent No.1 to the Complainant;  \n(g) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due an d payable to the Complainants \nand until then the Complainants would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in  the website of this Hon’ble \nAuthority within 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the C omplainants having a \ncharge on the said project property and/or permit the Complainants to erect a Board \non the said project property intimating public at large, the factum of Complainants \nhaving a charge on the said project property forthwith  \n(h) In the alternative to all above prayer clauses above and only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to  hold that the Respondent No.1 cannot create any third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainants as prayed for hereinabove  \n(i) That this Hon’ble Tribunal be pleased to direct the R espondent No.1 to pay a sum \nof Rs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. \nas compensation to be provided for the mental trauma, loss of time, hardship caused \nto Complainants and the notional losses, legal fees incurre d within one month from \nthe date of disposal of the present Complaint;  \n(j) That this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 \nof RERA Act for giving false information as per section 4 of the Act;  \n \n4. The captioned complaints were heard by this Authority on the following dates  \nrespectively wherein the following  roznama s were  recorded : \nSR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \n1.  CC006000000194896  \n01.02.2023  “Both Parties are present.  \nThe Complainant avers that they had booked a flat with the Developer \nSilvex in 2008 for which they paid part consideration of around Rs. \n84 Lakhs. Subsequently, the erstwhile Developer Silvex offered them \nan alternate flat in a redevelopment schem e which they accepted and \ncertain further payments were also made. In the year 2014 the Society \nundergoing redevelopment terminated the development agreement of \nSilvex and a new development agreement came to be executed with \nthe current Respondent as the D eveloper. The Complainant avers \nthat they were not a Party to this. Subsequently, a fresh set of consent \nterms were signed and a new allotment letter was given by the \npresent Developer namely the Respondent. This was executed on \n13.05.2015 wherein date of completion was promised to be 24 \nmonths. The letter also stated how the various remaining instalments \ntowards consideration were to be paid. The Complainant however, \navers that instalments were asked even though the milestones set had \nnot been achieved. Th e Complainant now seeks execution of \nagreement for sale, possession, interest for delay and compensation.  \nThe Respondent avers that consent terms have been executed before \nthe High Court and the higher terms payable were in fact decided in \nthe Hon’ble High  Court. The consent terms in Clause 8 clearly state \nthat all the claims will be addressed by Silverex the erstwhile \nDeveloper. The Respondent further avers that they were called upon \nto execute the agreement for sale in 2015 and also subsequently which \nthe Complainant never came forward. The Respondent also avers that \naround Rs. 83 Lakhs consideration is still outstanding from the \nComplainant and they have not paid the same. The Respondent avers \nthe delays have taken place because of Society not assigning t hem the \nright which were as per the consent terms before the High Court.  2.  CC006000000194917  Page 6 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nThe Complainant avers that they did seek the agreement for sale but \nwere given the same with the revised date of possession which was \nnot acceptable to them.  \nParties are at liberty to  file written submissions, if any, by \n13.02.2023. Subsequent to which, the matter will be reserved for \norders.”  \n3.  CC006000000196381  \n08.03.2023  ““All parties are present.  \nThe Complainant avers that a letter of allotment dated 15.05.2009 \nwas executed by Respondent No. 2 - the erstwhile Developer, now \nRespondent No. 1 has stepped in as the current Developer. The \nComplainant had paid around Rs. 30 Lakhs at the time of letter of \nallotment and the further Rs. 56 Lakhs and in the agg regate has paid \nover Rs. 86 Lakhs. The date of possession was given as 31.12.2011. \nThe Complainant avers that in 2012 the Project stopped and they \nwere not able to communicate with the Promoter. Subsequently, a \npurported email was sent by Respondent No. 2 to the husband of the \nAllotee and not the Allottee himself which involved changing the \nterms of the agreement. The Complainant avers that the consent \nterms were signed between Respondent No. 1, Respondent No. 2 and \nthe Society and they are now being asked to make higher payments \nagainst a lower area. The Complainant seeks execution of agreement \nfor sale and also interest to be paid for the amounts paid by him and \nthe delays therein. On the issues of the Complainant at Sr. No. 7 the \nfacts of the case remain same except for the fact that the Complainant \nNo. 7 did not even receive the email purported have been sent by the \nRespondent No. 2.  \nRespondent No. 1 avers that this as a society redevelopment Project \nundertaken by the Respondent No. 2 – the erstwhile Deve loper. This \ndevelopment agreement was terminated by the Society. The matter \nwas taken up by the Bombay High Court as Society had appointed \nthe Respondent No. 1 in 2015 to complete the Project. An arbitration \nproceeding took place subsequent to which 2 cons ent terms were \nsigned – 1. Between Respondent No. 1, Respondent No. 2 and the \nSociety and second between Respondent No. 1, Respondent No. 2, \nSociety and the majority of the flat purchasers. The consent terms \nhave been acted upon by the Parties and the same  have also been filed \nbefore the High Court. The consent terms fundamentally gave 2 \noptions to the Allottees namely to either pay escalation and continue \nin the Project and in case not willing to pay escalation then to take \nrefund and claim the interest fr om Respondent No. 2. All flat \npurchasers were sent letters. The Respondent No. 1 further avers that \nfrom 2011 nothing has been paid by the Complainant further to an \nemail dated 25.04.2015 a detailed computation giving the exact \nescalation involved was also  sent on the mail address given by the \nAllottee. Th Respondent also avers that there was a group represented \nby the Allotee which also attempted to negotiate the escalation but it \ndid not conclude as no response was forth coming.  \nTh Respondent No. 1 says t hat Section 15 of RERA does not apply \nhere as the consent terms were taken before the High Court in 2015 \nwhich is pre -RERA. The Respondent states that in case there are \ncertain issues regarding interest then the same forms a part of \nliabilities of Responde nt No. 2. The Respondent No.1 is today unable \nto offer terms different to those offered to other Allottees. The demand \nletters issued from 2015 onwards have also not been responded to by \nthe Complainant. The Respondent No. 1 also states that RERA in no \nway leaves the Complainant remediless and there are other laws with \nprovisions under which the Complainant can seek redressal.  \nThe Respondent No. 2 states that this is a misjoinder of Parties and \nthat he is not a necessary Party as he has handed over the Project to \nRespondent No. 1 and as such Respondent No. 2 is not a Promoter \nanymore . In fact, the handing over took place prior t o RERA. The \nRespondent No. 2 further avers that a scheme was formulated way 4.  CC006000000196392  Page 7 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nback at the time of transfer of Project from Respondent No. 2 to \nRespondent No. 1 and today after 7 -8 years the Complainants cannot \ncome forward seeking compensation from the Respo ndent No. 2. The \nRespondent No. 2 avers that since he was dealing with the Project \nprior to RERA he was never a Promoter as defined and envisaged \nunder RERA.  \nThe Complainant reiterates that they are not part of any group \nnegotiating the terms and instead t hey have individual agreements \nand they seek performance of the same. There is no letter or any other \ndocument to show that they were represented by a particular person \nas a part of a group. In the consent terms and deed of assignment the \nterm escalation i s not mentioned.  \nParties are at liberty to file written submissions, if any, \nby23.03.2023. Subsequent to which, the matter will be reserved for \norders  “ \n \n5. The brief facts and submissions of the parties  are as follows : \nSR. \nNO.   \nCOMPLAINT NOS./  \nCOMPLAINT \nFILING DATE  FLAT / \nBUILDIN\nG NO.  DATE OF \nAL1 TOTAL \nCONSIDERATIO\nN (INR)  TOTAL AMOUNT \nPAID  \n(INR)  \n1.  CC006000000194896 \n12.11.2020  1004/2003  \n& \n2002  13.05.2015  1,94,03,350  \n& \n98,75,000  2,08,78,350  \n(combined as per CT2) \n2.  CC006000000194917  \n13.11.2020  1702  \n& \n1802  13.05.2015  1,16,50,000  \n& \n1,12,75,000  85,20,000  \n(combined as per CT ) \n3.  CC006000000196381 \n19.03.2021  1801  15.05.2009  1,80,00,000  86,86,520  \n(as per complaint ) \n4.  CC006000000196392  \n19.03.2021  1601  15.05.2009  92,38,000  44,55,000  \n(as per complaint ) \n \n6. The submission s of all the Parties herein are perused and taken on record by the \nAuthority. However, b efore moving ahead, the following dates and events  are \nnoteworthy:  \nDATES  EVENTS  \n13.05.20008  A development agreement was executed between the Society and the Respondent No. 2 \nherein for redevelopment  of the existing building and constructing the said Project.  \nDate s not \nsubmitted  \n Allotment letter issued to Complainants at Sr. No. 1 by the Respondent No. 2 herein for flat \nNos. 103, 502, 503, 1602, 1702, 1805, 1905 & 2004 ( no further details submitted ). \nAllotment letter issued to Complainants at Sr. No. 2 by the Respondent No. 2 herein for flat \nNos. 1702 & 1802  with one car park (no further details submitted ). \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 3 by the Respondent No. 2 herein  (details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ).  \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 4 by the Respondent No. 2 herein ( details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ). \n31.01.2015  Termination Notice issue by the Society to the Respondent No. 2. \n \n1 AL- Allotment Letter  \n2 CT –Consent Terms  Page 8 of 12 \n 16.03.2015  Respondent No. 2 filed an arbitration petition No.(l) 474 of 2015 before the Hon’ble Bombay \nHigh Court  against the Society  (“said arbitration petition ”).  \n09.05.2015  The said arbitration petition was disposed of pursuant to consent terms being filed between \nthe Respondents herein along with Society and also between the Complainants at Sr. Nos. 1 \n& 2 (“ said consent terms ”).   13.05.2015  \n13.05.2015  Fresh a llotment letter s were issued to Complainants at Sr. No. 1 by the Respondent No. 1 \nherein  with new flats numbers and with escalated prices ( mentioned in table at para No. 5 \nhereinabove ). \n13.05.2015  Fresh allotment letter s were  issued to Complainants at Sr. No. 2 by the Respondent No. 1 \nherein with escalated prices for the flats retained from old allotments (mentioned in table at \npara No. 5 hereinabove ). \n29.07.2017  The Respondent No. 1 applied for seeking the said Project registration before MahaRERA.  \n07.08.2017  The Respondent No. 1 was granted the said Project registration.  \n28.03.2018  A deed of assignment was executed between the Respondents and the Society assigning the \nentire development rights to the Respondent No. 1 herein  (“said assignment deed ”).  \n12.11.2020  The complaint at Sr. No. 1 was filed by the Complainants at Sr. No. 1 against the Respondent \nNo. 1 seeking reliefs mentioned in table at p ara No. 3 hereinabove.   \n13.11.2020  The complaint at Sr. No. 2 was filed by the Complainants at Sr. No. 2 against the Respondent \nNo. 1 seeking reliefs mentioned in table at para No.3 hereinabove.  \n19.03.2021  The complaints at Sr. Nos. 3 & 4 were filed by the Complainants at Sr. Nos. 3 & 4 a gainst the \nRespondent Nos. 1 & 2 seeking reliefs mentioned in table at para No.3 hereinabove.  \n \n7. From the facts and the submissions, the issue s that needs to be considered are as \nfollows:  \na. Whether the Complainants are entitled to seek reliefs under Section 18 of the said Act ? \nb. Any other order?  \n \n8. From the above enumeration  it is very clear that certain events have taken place \nbefore the advent  of RERA and there  are events that ha ve taken place after RERA \nwas notified.  In the pre -RERA period,  a development agreement was executed \nbetween the Society and Respondent No.2. Subsequently the Society terminated the \ndevelopment agreement . Upo n the termination of the development agreement an \narbitration proceeding took place before the Hon’ble Bombay H igh Court  which \nculminated in the execution of said consent terms.  \n \n9. Some of the  terms that were agreed upon  under the said consent terms executed \nbetween the Respondents herein along with Society and the Complainants at Sr. Nos. \n1 & 2 on 13.05.2015 before the Hon’ble Bombay High Court in the said arbitration \npetition are reproduced hereinbelow : Page 9 of 12 \n “8. The Petition ers further agree and undertake to Hon’ble Court that in the event any claim or demand is made \nagainst the Respondent No. 2, and/or om respect of any of the flats, they will defend such claims/demands on \ntheir own cost and shall indemnify and shall keep in demnified the Respondent No. 2 against such claim/demand, \nloss/damages that may be suffered by the Petitioners as well as all cost, charges and expenses that may be \nincurred by the Respondent No. 2  to defend such claims or demands.  \n \n10. The Petitioners and Respondent No. 2 confirm that the allotment of Flat Nos. 1904/2003 and 2002 \n(collectively called “the said flats”) along with exclusive right to use 4 (four) Car Parking Spaces (“said Car \nParking Spaces”) in favour of Respondents No s. 3 to 6 as set out hereinafter in the proposed building to be \nnamed as “Silver Skyline” being constructed on the land bearing CTS No. 826 and 827 of village Ambivali \npursuant to Development Agreement dated 13.05.2008 made between Respondent No. 1 Society  and the \nPetitioners is valid, subsisting and binding upon them.  \n \n11. Respondent No. 2, at the request of the Petitioners and Respondent No. 3 to 6, agree to honour allotment of \nthe aforesaid flats   right to use 4 Car Parking Spaces and enter into and register formal Agreement for Sale in \nrespect thereof with the Respondent No. 3 to 6 or such of them as may be directed by them. The details of the said \nflats, carpet area thereof, total consideration, amount received, balance payable and no. and nature of  car parking \nspaces is set out hereunder…  \n \n13.In view of the consent terms and allotment letters executed in respect of the said premises, the earlier \nallotment made by the Petitioner to the Respondent No. 3 to 6 in respect of the remaining flats, i.e. Fla t Nos., \n103, 502, 503, 1602, 1702, 1805, 1905 and 2004 is cancelled. It is hereby clarified that he aforesaid cancellation \nshall not affect the rights of Respondent No. 7 & 8 in Flat no. 1702 as provided in Clause 18 herein below. \nRespondent No. 3 to 6 con firm that credit of the payment, if any, made in respect of the above cancelled flats is \ngiven in Flat Nos. 1904/2003 and 2002.  \n \n20. by separate Consent Terms of even date made between the Petitioners and Respondent No. 1 and 2, dispute \nwith the Society be ing Respondent No. 1 herein is settled. Agreed, ordered and declared that the benefits of the \nsaid Consent Term in respect of the Premises set out hereinabove will ensure to the benefit of Respondent Nos. \n3 to 6 subject to the Respondent Nos. 3 to 6 paying  balance consideration and other amounts as per the agreed \nterms. ” \n \n10. It is also an admitted fact that none of the Complainants have executed agreements \nfor sale with either of the Respondents herein . The only document that the \nComplainant s hold  as on date are the letters  of allotment towards the apartments  \nallotted to each and further the records of the payments made by each of them. The \nallotment letters of Complainants at Sr. Nos. 1  & 2 issued by Respondent No. 1 after \nthe execution of the  said consent terms  mentions not only the escalated consideration  \namounts to be paid by the m but also the new apartment numbers allotted to them. It \nis also observed that Complainants  at Sr. Nos. 3 & 4 claim to have only the original \nallotment letters without any further documents indicating  escalated amounts to be \npaid or the numbers of new apartments  to be allotted. Even  the original allotment \nletters claimed by the Complainants  at Sr. Nos. 3 & 4 which  have been issued by the \nRespondent No. 2 herein  have not been uploaded  by them .  Page 10 of 12 \n 11. It is pertinent to note that the fresh allotments issued by the Respondent No. 1 to the \nComplainants at Sr. Nos. 1 & 2 at para No.5 stated as follows:  \n“5. Subject to force majeure as well as other circumstances beyond our control including Policy of the \nGovernment/MCGM and sanction of the plans and requisite permission in time, we propose to complete the \nbuilding and offer possession within a period of 24 months from the date hereof with a grace period of 6 months. ” \n \n12. It is pertinent to note that the said assignment deed at recital W stated the following:  \n “W. The Assignee/ Developer confirms that they will carry out and complete the construction and offer \npossession of the premises to the existing members of the society w ithin the period stipulated here under read \nwith Development Agreement dated 13.05.2008 and the Terms dated 13.05.2015 subject to force majeure and/or \nother circumstances beyond the control of the Assignee. The Society confirms that period of 21 months dur ing \nwhich the Assignee/ Developer could not get permission to carry out construction will not be taken into \nconsideration while calculating the aforesaid period.”  \n \n13. It is thus clear that subsequent to the said consent terms filed as a result of the said \narbitration petition the transactions between the Part ies were to be carried out as per \nthe said consent terms. These said consent terms  were agreed upon and executed \nsubsequent to an arbitration plea under the oversight  of the Hon’ble Bombay High \nCourt . Thes e said consent terms predate the notification giving effect to the said Act. \nWith th ese said consent terms  on record, the Parties today have no option but to \nfollow the terms as envisaged  and laid out therein . As mentioned above the said \nconsent terms  have very clearly dealt with the  escalation amounts, the completion \ndates and such other items that are necessary to conclude a real estate project.  The \nParties should have executed sale deeds  / agreement for sale  in keeping and in line \nwith these consent terms. With these said consent terms  on record the Authority has \nno mandate to interpret them and adjudicate upon the manner and the conditions \nthat should be a part  of the sale deed  / agreement for sale  to be exe cuted between \nthe Parties. These said consent terms were executed before the advent of RERA and \nas a part of the arbitration proceedings. Thus, issues relating to its interpretation \ncannot be a part of an adjudication process of this Authority.  \n \n14. The Compl ainants at Sr. Nos. 1 & 2 and the Respondent No.1 must hence proceed to \nexecute the agreement for sale as laid out in the said consent terms . The Authority \nsees no reason to intervene in the same. With respect to reliefs under Section 18 for \nthe Complainants at Sr. No. 1 & 2 it is to be noted that subsequent to the said consent Page 11 of 12 \n terms  no document has been executed between the Parties to enable th e Authority  to \nadjudicate upon reliefs that they may be entitled  to under Section 18 of the said Act.  \nThe Parties are seeking reliefs under Section 18 based on allotment letters  which were  \nissued prior to RERA. Not only were these allotment letters issued prior to RERA but \nfurther the said consent terms  executed have overtaken the recitals in the allotment \nletters . The said consent terms  have clearly laid out the profile of the relationship \nbetween the Respondent No. 1 herein  and the Allottees  i.e. the Comp lainants at Sr. \nNos. 1 & 2 herein . The said consent terms  have further gone and have also set out the \nmanner in which any prior  claims and liabilities  would be sought and the Party \nagainst  whom  the same shall be executable.  With the executing of the said consent \nterms a curtain has fallen on all events before that and it is the said consent terms \nthat shall now hold ground and any other document subsequent to this. With these \nbeing the facts,  the Authority observes that the allotment letter  cannot be the basis \nfor determining whether a grievance exists and for which a remedy should be \ngranted. Hence the issue at para No. 7(a)  is answered in the negative .  \n \n15. The Complainants at Sr. N so. 1 & 2 have also sought reliefs with regar d to an order \nof permanent injunction and restraining of the Respondent No. 1 from disposal of \ntheir apartments. Since the Parties have failed to take action subsequent to the said \nconsent terms which has resulted in them failing to re -establish their righ ts and \nobligations it would not be prudent to issue any injunction orders.  Hence the issue \nat para No. 7( b) is answered in the negative . \n \n16. In view of the above Complainants  at Sr. Nos.1 & 2 and the Respondent at Sr. No. 1 \nare directed to take such steps to execute the agreement for sale in keeping with the \nsaid consent terms .  \n \n17. In the complaints at Sr. Nos. 3 & 4 the Complainants have failed to provide the \noriginal allotment  letters . However,  the Authority also notes that the availability  of \nthe allotment letters  has not been challenged. The Authority  would therefore  assume \nthat in view if the fact  that there is no challenge to the statement being made by the \nComplainants  Nos. 3 & 4 , the allotment letters  exist . However,  since the Authority is Page 12 of 12 \n not privy to the allotment letters it would not be able to adjudicate upon the \ngrievances sought to be redressed.  Further  since the said consent terms  are on record , \nthe Authority  will limit itself to directing the Parties to abide by the said consent \nterms while moving ahead  in the matters.  \n \n18. Thus, in view of the above, all the captioned complaints are disposed of . No order as \nto costs.    \n \n19. Further the said Project is lapsed and the Respondent No. 1 has taken no steps till \ndate to seek any extension. This Authority shall keep the said Project registration in \nabeyance  and the Respondent shall not advertise, market, book, sell or offer for sale, \nor invite person/s to purchase in any manner any apartment  in the said Project till \nthe Respondent No. 1 obtains extensions of the said Project from MahaRERA.       \n \n \n  (Ajoy  Mehta)  \n      Chairperson, MahaRERA\n  \n \n \nAJOY MEHTADigitally signed by AJOY \nMEHTA \nDate: 2023.07.03 11:27:59 \n+05'30'"
    },
    {
        "file_name": "4.SILVER SKYLINE.pdf",
        "text": "Page 1 of 12 \n BEFORE THE  MAHARASHTRA  \nREAL ESTATE REGULATORY AUTHORITY , MUMBAI  \nVirtual Hearing held through video conference as per  \nMahaRERA Circular No.: 27/2020  \n \n1. COMPLAINT NO. CC006000000194896  \n1. DEVKUMAR RAMANI  \n2. MRS HEMA DEVKUMAR RAMANI  \n3. JEEN PRAKASH LUDHANI  \n4. NEHA DEVKUMAR RAMANI   \n \n \n…COMPLAINANT S \na/w  \n2. COMPLAINT NO. CC006000000194917  \nASHISH HIRA LALWANI  &  \nLAXMI LUDHANI   \n…COMPLAINANT S \na/w  \n3. COMPLAINT NO. CC006000000196381  \nJYOTI NIRMAL ANAND  …COMPLAINANT  \n \na/w  \n4. COMPLAINT NO. CC006000000196392  \nKAMAL K KALRA & ANITA MIRPURI  …COMPLAINANT  \n \nVS \n \n1. PRABHAV REALTY & INFRASTRUCTURE  \nPVT. LTD.  \n2. SILVEX DEVELOPERS PRIVATE LIMITED  \n(Respondent No. 2 is party in complaints at Sr. No s. 3 & 4)  \n   \n…RESPONDENT S \n \n \nMAHARERA PROJECT REGISTRATION NO.  P51800004072  \nOrder  \nJune  30, 2023 \n(Date of hearing mentioned in Para No. 4 – matters reserved for orders ) \n \nCoram: Shri. Ajoy Mehta, Chairperson, MahaRERA  \nAdvocate Shivani Shukla for the Complainants at Sr. No. 1 &2  \nAdvocate Ooril Panchal a/w Advocate Mahesh Kukreja for the  \nComplainant s at Sr. No. 3 & 4  \nAdvocate Vikramjit Garewal for Respondent No. 1  at Sr. No. 1  to 4 \nAdvocate Aditya Miskita for Respondent No. 2  at Sr. No. 3 & 4  \n \n Page 2 of 12 \n 1. The Complainant s are hom e buyer s and Allottee s within the meaning of Section 2(d) \nof the Real Estate (Regulation and Development) Act, 2016  (hereinafter referred to as \nthe “said Act ”) of Real Estate Regulatory Authority (hereinafter referred to as the \n“RERA ”) and the Respondent  No. 1  is the Promoter/Developer within the meaning \nof Section 2(zk) of the said Act. The Responden t No. 1 is registered as the Promoter \nof the Project namely  “SILVER SKYLINE ” under section 5 of the said Act bearing \nMAHARERA Project  Registration No. P51800004072 (hereinafter referred to as the \n“said Project ”). The said Project is a redevelopment project of Manish Sonal Co -\noperative Housing Society Ltd. ( hereinafter referred to as the  “Society ”) which was \nto be earlier developed by the Respondent No. 2 namely Silvex Developers Private \nLimited .  \n \n2. On the MahaRERA Project registration webpage the proposed completion date  is \n31.07.2021, revised completion date  is mentioned as  30.12.202 2 and extended  \ncompletion date is mentioned as  30.04.2023.  The Project is a lapsed Project and \nOccupation Certificate/ Form 4 (Architect’s Certificate of Completion of Project) is \nnot uploaded on the MahaRERA portal.  \n   \n3. The Complainant s are seeking the following reliefs:   \nSR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n1.  CC006000000194896  i. This Hon’ble Authority be pleased to direct the Respondent to pay interest on Rs. \n2,18,78,350 / -(Two Crores Eighteen Lakhs Seventy Eight Thousand Three Hundred \nFifty Only) paid by the Complainants to the Respondent from the agreed date of \npossession 12th N ovember 2017 till the date of actual possession along with OC in \naccordance to Section 18 of the Real Estate (Regulation & Development) Act 2016.  \nii. This Hon’ble Authority be pleased to direct the Respondent to execute the Sale \nAgreement in accordance wi th the provisions of the Real Estate (Regulation & \nDevelopment) Act 2016 and the Rules made thereunder for both flats as allotted \npursuant to the Consent Terms signed and filed by the Hon’ble High Court of Bombay \nin Arbitration Petition (L) No: 474 of 2015  on 13th May 2015.  \n iii. The Complainants are further entitled for appropriate compensation from the \nRespondent for the grave and irreparable loss and mental agony suffered by them from \n2013.  \niv. Award the costs of these proceedings to the Complainants.  \nv. Grant any other relief which this Hon’ble Authority deems fit and proper under the \nfacts and circumstances of the present case.  \n2.  CC006000000194917  i. This Hon’ble Authority be pleased to direct the Respondent to refund the entire \namount of Rs 1,07,20,000/ - paid by the Applicants to the Respondent along with \ninterest at the rate of 15% p.a. as confirmed by the respondent in its letter dated 13th \nMay 2015 from the date of payment till the date of refund.  \nii. The Applicants are further entitled for appropriate compensation from the \nrespondent for the grave and irreparable loss and mental agony suffered by them.  \niii. Award the costs of these proceedings to the Applicants.  \niv. Grant any other relief which this Hon’ble Authority deems fit a nd \nproper under the facts and circumstances of the present case  Page 3 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \n3.  CC006000000196381  a)That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 1,71,28,021/ - being the interest payable @ 18 % p.a. from the \nrespect ive dates of the payment made by the Complainant to Respondent No.2 towards \npart consideration of the said flat. The Complainant has prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ here to. \n  \nb)That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay further \ninterest on and from 16 March 2021 at the rate prescribed by RERA Act and Rules \nmade thereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 86,00,000/ - \n(Rupees Eighty Six Lacs Only) being the present market value of the said flat until \nhanding over possession of said flat.  \n \nc)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements an d get the said RERA \nAgreements registered with Sub  Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximate ly 1400 square \nfeet carpet area along with an exclusive terrace admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 where -under \nfrom the total consideration of Rs. 1,80,00,000 the balance consideration of Rs. \n94,00,000/ - would be paid by the Complainant to Respondent No.1 after deducting \nthe amount paid till date i.e. Rs. 86,00,000/ -. \n \nd)That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainant within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secre tary and/or any authorized \nperson of this Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing being a 3 \nbedroom hall kitchen apartment admeasuring approximately 1400 sq uare feet carpet \narea along with an exclusive terrace admeasuring approximately 1400 square feet \ncarpet area along with two stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainant on behalf of and at the cost of the Respondent No.1 herein and to perform \ntheir part of obligations under the RERA Act as amended.  \n \ne)That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respo ndent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any th ird party right, title and/or interest \nin respect of the said flat i.e. a flat bearing Flat No. 1801 on the 18th floor in ‘A’ Wing \nbeing a 3 bedroom hall kitchen apartment admeasuring approximately 1400 square \nfeet carpet area along with an exclusive terra ce admeasuring approximately 1400 \nsquare feet carpet area along with two stilt car parkings on land bearing CTS No. 826 -\nB situate at J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this \nHon’ble Court deems appropriate in the facts and circumstance s of the present case.  \n \nf)That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representatives, servants, administrator, assigns, e tc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/car parking spaces in the building under  \nconstruction on the said project until payment of Rs. 1,71,28,021/ - (Rupees One Crore \nSeventy One Lac Twenty Eight Thousand Twenty One Only) (calculated along with \ninterest until 15 March 2021) along with further interest on and from 16 March 2021 \ntill da te of possession of the said flat; by the Respondent No.1 to the Complainant;  \n \ng)That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due and payable to the Complainant \nand until th en the Complainant would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in the website of this Hon’ble \nAuthority with in 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the Complainant having a \ncharge on the said proj ect property and/or permit the Complainant to erect a Board on Page 4 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \nthe said project property intimating public at large, the factum of Complainant having \na charge on the said project property forthwith;  \n \nh)In the alternative to all above prayer clauses above a nd only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to hold that the Respondent No.1 cannot create an y third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainant as prayed for hereinabove;  \n \ni)That this Hon’ble Tribunal be pleased to direct the Respondent No.1 to pay a sum of \nRs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. as \ncompensation to be provided for the mental trauma, loss of time, hardship caused to \nComplainants and the notional losses, legal fees incurred within one month from the \ndate of disposal of t he present Complaint;  \n \nThat this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 of \nRERA Act for giving false information as per section 4 of the Act;  \n4.  CC006000000196392  (a) That this Hon'ble Tribunal be pleased to pass an order directing Respondent No.1 \nto pay a sum of Rs. 86,57,366/ - (Rupees Eight Six Lacs Fifty Seven Thousand Three \nHundred Sixty Six only) being the interest payable @ 18 % p.a. from the respective \ndates of the payment made by the Complainants to Respondent No.2 towards part \nconsideration of the said flat. The Complainants have prepared an interest chart till \n15 March 2021 being the interest amounts payable by Respondent No.1 as per Exhibit \n‘J’ hereto.  \n(b) That this Hon’ble Tribunal be pleased to direct Respondent No.1 to pay interest \non and from 15 March 2021 at the rate prescribed by RERA Act and Rules made \nthereunder i.e. SBI’s highest MCLR + 2% on an amount of Rs. 44,55,000/ -(Rupees \nForty Four Lacs Fif ty Five Thousand Only) being the present market value of the said \nflat until handing over possession of said flat.  \n(c) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \nprepare, execute and enter into RERA Agreements and get  the said RERA \nAgreements registered with Sub -Registrar of Assurances in respect of the said flat (as \ndefined hereinabove) i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 93 5 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053 whereunder from the \ntotal consideration of Rs. 92,38,000/ - (Rupees Ninety -Two Lacs Thirty -Eight \nThousa nd only) the balance consideration of Rs. 47,83,000/ - would be paid by the \nComplainants to Respondent No.1 after deducting the amount paid till date i.e. Rs. \n44,55,000/ -.  \n(d) That this Hon'ble Tribunal be pleased to order that in the event the Respondent \nNo.1 fails and neglects to execute and register the RERA Agreements in favor of the \nComplainants within the time specified by this Hon'ble Tribunal, this Hon'ble \nTribunal be pleased to pass an order directing the Secretary and/or any authorized \nperson of t his Hon'ble Tribunal to execute the RERA Agreements in respect of the \nsaid flat i.e. a flat bearing Flat No. 1601 on the 16th floor in ‘A’ Wing being a 2 \nbedroom hall kitchen apartment admeasuring approximately 935 square feet carpet \narea along with one st ilt car parkings on land bearing CTS No. 826 -B situate at \nJ.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, in favor of the \nComplainants on behalf of and at the cost of the Respondent No.1 herein and to \nperform their part of obligations under the RERA Act as amended  \n(e) That this Hon'ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondent No.1 acting by itself and/or through its \nagents, officers, representatives, servants, administrator, assigns, etc. fro m taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of the said flat i.e. a flat bearing No. 1601 on the 16th floor in ‘A’ Win g \nbeing a 2 bedroom hall kitchen apartment admeasuring approximately 935 square feet \ncarpet area along with one stilt car parkings on land bearing CTS No. 826 -B situate \nat J.P.Road, Manish Nagar, Andheri (West) Mumbai 400053, as this Hon’ble Court \ndeems ap propriate in the facts and circumstances of the present case;  \n(f) That this Hon’ble Tribunal be pleased to pass an Order of permanent injunction \npreventing/ restraining the Respondents acting by themselves and/or through its \nagents, officers, representati ves, servants, administrator, assigns, etc. from taking \npossession of and/or from in any manner selling, transferring, alienating, \nencumbering, dealing with and/or creating any third party right, title and/or interest \nin respect of any flats/shops/offices/ car parking spaces in the building under \nconstruction on the said project until payment of Rs. 86,57,366/ - (Rupees Eight Six \nLacs Fifty Seven Thousand Three Hundred Sixty Six only) (calculated along with Page 5 of 12 \n SR. \nNO.  COMPLAINT NO.  RELIEFS SOUGHT  \ninterest until 15 March 2021) along with further int erest on and from 16 March 2021 \ntill date of possession of the said flat; by the Respondent No.1 to the Complainant;  \n(g) That this Hon'ble Tribunal be pleased to order and direct the Respondent No.1 to \ncorrectly incorporate exact details of amounts due an d payable to the Complainants \nand until then the Complainants would have first charge on the said project property, \nin its Title Certificate, draft Agreement to be executed with its prospective flat \npurchasers and in its details of encumbrances uploaded in  the website of this Hon’ble \nAuthority within 30 days from the date of the order and also to order and direct the \nRespondent No.1 to erect a Board; at a conspicuous location on the said project \nproperty, intimating public at large about the factum of the C omplainants having a \ncharge on the said project property and/or permit the Complainants to erect a Board \non the said project property intimating public at large, the factum of Complainants \nhaving a charge on the said project property forthwith  \n(h) In the alternative to all above prayer clauses above and only in the only in the event \nthat the said prayer clauses cannot be granted, this Hon'ble Tribunal be pleased to \nrevoke the registration granted to the Respondent No.1 in respect of the said Project \nand to  hold that the Respondent No.1 cannot create any third party rights in respect \nof any unsold flats in the said project until payment of the amounts payable to \nComplainants as prayed for hereinabove  \n(i) That this Hon’ble Tribunal be pleased to direct the R espondent No.1 to pay a sum \nof Rs.10,00,000/ - (Rupees Ten Lakhs Only) towards cost of the present Complaint i.e. \nas compensation to be provided for the mental trauma, loss of time, hardship caused \nto Complainants and the notional losses, legal fees incurre d within one month from \nthe date of disposal of the present Complaint;  \n(j) That this Hon’ble Tribunal be pleased to penalize the Respondent as per section 60 \nof RERA Act for giving false information as per section 4 of the Act;  \n \n4. The captioned complaints were heard by this Authority on the following dates  \nrespectively wherein the following  roznama s were  recorded : \nSR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \n1.  CC006000000194896  \n01.02.2023  “Both Parties are present.  \nThe Complainant avers that they had booked a flat with the Developer \nSilvex in 2008 for which they paid part consideration of around Rs. \n84 Lakhs. Subsequently, the erstwhile Developer Silvex offered them \nan alternate flat in a redevelopment schem e which they accepted and \ncertain further payments were also made. In the year 2014 the Society \nundergoing redevelopment terminated the development agreement of \nSilvex and a new development agreement came to be executed with \nthe current Respondent as the D eveloper. The Complainant avers \nthat they were not a Party to this. Subsequently, a fresh set of consent \nterms were signed and a new allotment letter was given by the \npresent Developer namely the Respondent. This was executed on \n13.05.2015 wherein date of completion was promised to be 24 \nmonths. The letter also stated how the various remaining instalments \ntowards consideration were to be paid. The Complainant however, \navers that instalments were asked even though the milestones set had \nnot been achieved. Th e Complainant now seeks execution of \nagreement for sale, possession, interest for delay and compensation.  \nThe Respondent avers that consent terms have been executed before \nthe High Court and the higher terms payable were in fact decided in \nthe Hon’ble High  Court. The consent terms in Clause 8 clearly state \nthat all the claims will be addressed by Silverex the erstwhile \nDeveloper. The Respondent further avers that they were called upon \nto execute the agreement for sale in 2015 and also subsequently which \nthe Complainant never came forward. The Respondent also avers that \naround Rs. 83 Lakhs consideration is still outstanding from the \nComplainant and they have not paid the same. The Respondent avers \nthe delays have taken place because of Society not assigning t hem the \nright which were as per the consent terms before the High Court.  2.  CC006000000194917  Page 6 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nThe Complainant avers that they did seek the agreement for sale but \nwere given the same with the revised date of possession which was \nnot acceptable to them.  \nParties are at liberty to  file written submissions, if any, by \n13.02.2023. Subsequent to which, the matter will be reserved for \norders.”  \n3.  CC006000000196381  \n08.03.2023  ““All parties are present.  \nThe Complainant avers that a letter of allotment dated 15.05.2009 \nwas executed by Respondent No. 2 - the erstwhile Developer, now \nRespondent No. 1 has stepped in as the current Developer. The \nComplainant had paid around Rs. 30 Lakhs at the time of letter of \nallotment and the further Rs. 56 Lakhs and in the agg regate has paid \nover Rs. 86 Lakhs. The date of possession was given as 31.12.2011. \nThe Complainant avers that in 2012 the Project stopped and they \nwere not able to communicate with the Promoter. Subsequently, a \npurported email was sent by Respondent No. 2 to the husband of the \nAllotee and not the Allottee himself which involved changing the \nterms of the agreement. The Complainant avers that the consent \nterms were signed between Respondent No. 1, Respondent No. 2 and \nthe Society and they are now being asked to make higher payments \nagainst a lower area. The Complainant seeks execution of agreement \nfor sale and also interest to be paid for the amounts paid by him and \nthe delays therein. On the issues of the Complainant at Sr. No. 7 the \nfacts of the case remain same except for the fact that the Complainant \nNo. 7 did not even receive the email purported have been sent by the \nRespondent No. 2.  \nRespondent No. 1 avers that this as a society redevelopment Project \nundertaken by the Respondent No. 2 – the erstwhile Deve loper. This \ndevelopment agreement was terminated by the Society. The matter \nwas taken up by the Bombay High Court as Society had appointed \nthe Respondent No. 1 in 2015 to complete the Project. An arbitration \nproceeding took place subsequent to which 2 cons ent terms were \nsigned – 1. Between Respondent No. 1, Respondent No. 2 and the \nSociety and second between Respondent No. 1, Respondent No. 2, \nSociety and the majority of the flat purchasers. The consent terms \nhave been acted upon by the Parties and the same  have also been filed \nbefore the High Court. The consent terms fundamentally gave 2 \noptions to the Allottees namely to either pay escalation and continue \nin the Project and in case not willing to pay escalation then to take \nrefund and claim the interest fr om Respondent No. 2. All flat \npurchasers were sent letters. The Respondent No. 1 further avers that \nfrom 2011 nothing has been paid by the Complainant further to an \nemail dated 25.04.2015 a detailed computation giving the exact \nescalation involved was also  sent on the mail address given by the \nAllottee. Th Respondent also avers that there was a group represented \nby the Allotee which also attempted to negotiate the escalation but it \ndid not conclude as no response was forth coming.  \nTh Respondent No. 1 says t hat Section 15 of RERA does not apply \nhere as the consent terms were taken before the High Court in 2015 \nwhich is pre -RERA. The Respondent states that in case there are \ncertain issues regarding interest then the same forms a part of \nliabilities of Responde nt No. 2. The Respondent No.1 is today unable \nto offer terms different to those offered to other Allottees. The demand \nletters issued from 2015 onwards have also not been responded to by \nthe Complainant. The Respondent No. 1 also states that RERA in no \nway leaves the Complainant remediless and there are other laws with \nprovisions under which the Complainant can seek redressal.  \nThe Respondent No. 2 states that this is a misjoinder of Parties and \nthat he is not a necessary Party as he has handed over the Project to \nRespondent No. 1 and as such Respondent No. 2 is not a Promoter \nanymore . In fact, the handing over took place prior t o RERA. The \nRespondent No. 2 further avers that a scheme was formulated way 4.  CC006000000196392  Page 7 of 12 \n SR. \nNO.  COMPLAINT NO.  DATE OF \nROZNAMA  ROZNAMA REPRDUCED  \nback at the time of transfer of Project from Respondent No. 2 to \nRespondent No. 1 and today after 7 -8 years the Complainants cannot \ncome forward seeking compensation from the Respo ndent No. 2. The \nRespondent No. 2 avers that since he was dealing with the Project \nprior to RERA he was never a Promoter as defined and envisaged \nunder RERA.  \nThe Complainant reiterates that they are not part of any group \nnegotiating the terms and instead t hey have individual agreements \nand they seek performance of the same. There is no letter or any other \ndocument to show that they were represented by a particular person \nas a part of a group. In the consent terms and deed of assignment the \nterm escalation i s not mentioned.  \nParties are at liberty to file written submissions, if any, \nby23.03.2023. Subsequent to which, the matter will be reserved for \norders  “ \n \n5. The brief facts and submissions of the parties  are as follows : \nSR. \nNO.   \nCOMPLAINT NOS./  \nCOMPLAINT \nFILING DATE  FLAT / \nBUILDIN\nG NO.  DATE OF \nAL1 TOTAL \nCONSIDERATIO\nN (INR)  TOTAL AMOUNT \nPAID  \n(INR)  \n1.  CC006000000194896 \n12.11.2020  1004/2003  \n& \n2002  13.05.2015  1,94,03,350  \n& \n98,75,000  2,08,78,350  \n(combined as per CT2) \n2.  CC006000000194917  \n13.11.2020  1702  \n& \n1802  13.05.2015  1,16,50,000  \n& \n1,12,75,000  85,20,000  \n(combined as per CT ) \n3.  CC006000000196381 \n19.03.2021  1801  15.05.2009  1,80,00,000  86,86,520  \n(as per complaint ) \n4.  CC006000000196392  \n19.03.2021  1601  15.05.2009  92,38,000  44,55,000  \n(as per complaint ) \n \n6. The submission s of all the Parties herein are perused and taken on record by the \nAuthority. However, b efore moving ahead, the following dates and events  are \nnoteworthy:  \nDATES  EVENTS  \n13.05.20008  A development agreement was executed between the Society and the Respondent No. 2 \nherein for redevelopment  of the existing building and constructing the said Project.  \nDate s not \nsubmitted  \n Allotment letter issued to Complainants at Sr. No. 1 by the Respondent No. 2 herein for flat \nNos. 103, 502, 503, 1602, 1702, 1805, 1905 & 2004 ( no further details submitted ). \nAllotment letter issued to Complainants at Sr. No. 2 by the Respondent No. 2 herein for flat \nNos. 1702 & 1802  with one car park (no further details submitted ). \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 3 by the Respondent No. 2 herein  (details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ).  \n15.05.2009  Allotment letter issued to Complainant at Sr. No. 4 by the Respondent No. 2 herein ( details \nmentioned in table at para No. 5 hereinabove , copy not uploaded ). \n31.01.2015  Termination Notice issue by the Society to the Respondent No. 2. \n \n1 AL- Allotment Letter  \n2 CT –Consent Terms  Page 8 of 12 \n 16.03.2015  Respondent No. 2 filed an arbitration petition No.(l) 474 of 2015 before the Hon’ble Bombay \nHigh Court  against the Society  (“said arbitration petition ”).  \n09.05.2015  The said arbitration petition was disposed of pursuant to consent terms being filed between \nthe Respondents herein along with Society and also between the Complainants at Sr. Nos. 1 \n& 2 (“ said consent terms ”).   13.05.2015  \n13.05.2015  Fresh a llotment letter s were issued to Complainants at Sr. No. 1 by the Respondent No. 1 \nherein  with new flats numbers and with escalated prices ( mentioned in table at para No. 5 \nhereinabove ). \n13.05.2015  Fresh allotment letter s were  issued to Complainants at Sr. No. 2 by the Respondent No. 1 \nherein with escalated prices for the flats retained from old allotments (mentioned in table at \npara No. 5 hereinabove ). \n29.07.2017  The Respondent No. 1 applied for seeking the said Project registration before MahaRERA.  \n07.08.2017  The Respondent No. 1 was granted the said Project registration.  \n28.03.2018  A deed of assignment was executed between the Respondents and the Society assigning the \nentire development rights to the Respondent No. 1 herein  (“said assignment deed ”).  \n12.11.2020  The complaint at Sr. No. 1 was filed by the Complainants at Sr. No. 1 against the Respondent \nNo. 1 seeking reliefs mentioned in table at p ara No. 3 hereinabove.   \n13.11.2020  The complaint at Sr. No. 2 was filed by the Complainants at Sr. No. 2 against the Respondent \nNo. 1 seeking reliefs mentioned in table at para No.3 hereinabove.  \n19.03.2021  The complaints at Sr. Nos. 3 & 4 were filed by the Complainants at Sr. Nos. 3 & 4 a gainst the \nRespondent Nos. 1 & 2 seeking reliefs mentioned in table at para No.3 hereinabove.  \n \n7. From the facts and the submissions, the issue s that needs to be considered are as \nfollows:  \na. Whether the Complainants are entitled to seek reliefs under Section 18 of the said Act ? \nb. Any other order?  \n \n8. From the above enumeration  it is very clear that certain events have taken place \nbefore the advent  of RERA and there  are events that ha ve taken place after RERA \nwas notified.  In the pre -RERA period,  a development agreement was executed \nbetween the Society and Respondent No.2. Subsequently the Society terminated the \ndevelopment agreement . Upo n the termination of the development agreement an \narbitration proceeding took place before the Hon’ble Bombay H igh Court  which \nculminated in the execution of said consent terms.  \n \n9. Some of the  terms that were agreed upon  under the said consent terms executed \nbetween the Respondents herein along with Society and the Complainants at Sr. Nos. \n1 & 2 on 13.05.2015 before the Hon’ble Bombay High Court in the said arbitration \npetition are reproduced hereinbelow : Page 9 of 12 \n “8. The Petition ers further agree and undertake to Hon’ble Court that in the event any claim or demand is made \nagainst the Respondent No. 2, and/or om respect of any of the flats, they will defend such claims/demands on \ntheir own cost and shall indemnify and shall keep in demnified the Respondent No. 2 against such claim/demand, \nloss/damages that may be suffered by the Petitioners as well as all cost, charges and expenses that may be \nincurred by the Respondent No. 2  to defend such claims or demands.  \n \n10. The Petitioners and Respondent No. 2 confirm that the allotment of Flat Nos. 1904/2003 and 2002 \n(collectively called “the said flats”) along with exclusive right to use 4 (four) Car Parking Spaces (“said Car \nParking Spaces”) in favour of Respondents No s. 3 to 6 as set out hereinafter in the proposed building to be \nnamed as “Silver Skyline” being constructed on the land bearing CTS No. 826 and 827 of village Ambivali \npursuant to Development Agreement dated 13.05.2008 made between Respondent No. 1 Society  and the \nPetitioners is valid, subsisting and binding upon them.  \n \n11. Respondent No. 2, at the request of the Petitioners and Respondent No. 3 to 6, agree to honour allotment of \nthe aforesaid flats   right to use 4 Car Parking Spaces and enter into and register formal Agreement for Sale in \nrespect thereof with the Respondent No. 3 to 6 or such of them as may be directed by them. The details of the said \nflats, carpet area thereof, total consideration, amount received, balance payable and no. and nature of  car parking \nspaces is set out hereunder…  \n \n13.In view of the consent terms and allotment letters executed in respect of the said premises, the earlier \nallotment made by the Petitioner to the Respondent No. 3 to 6 in respect of the remaining flats, i.e. Fla t Nos., \n103, 502, 503, 1602, 1702, 1805, 1905 and 2004 is cancelled. It is hereby clarified that he aforesaid cancellation \nshall not affect the rights of Respondent No. 7 & 8 in Flat no. 1702 as provided in Clause 18 herein below. \nRespondent No. 3 to 6 con firm that credit of the payment, if any, made in respect of the above cancelled flats is \ngiven in Flat Nos. 1904/2003 and 2002.  \n \n20. by separate Consent Terms of even date made between the Petitioners and Respondent No. 1 and 2, dispute \nwith the Society be ing Respondent No. 1 herein is settled. Agreed, ordered and declared that the benefits of the \nsaid Consent Term in respect of the Premises set out hereinabove will ensure to the benefit of Respondent Nos. \n3 to 6 subject to the Respondent Nos. 3 to 6 paying  balance consideration and other amounts as per the agreed \nterms. ” \n \n10. It is also an admitted fact that none of the Complainants have executed agreements \nfor sale with either of the Respondents herein . The only document that the \nComplainant s hold  as on date are the letters  of allotment towards the apartments  \nallotted to each and further the records of the payments made by each of them. The \nallotment letters of Complainants at Sr. Nos. 1  & 2 issued by Respondent No. 1 after \nthe execution of the  said consent terms  mentions not only the escalated consideration  \namounts to be paid by the m but also the new apartment numbers allotted to them. It \nis also observed that Complainants  at Sr. Nos. 3 & 4 claim to have only the original \nallotment letters without any further documents indicating  escalated amounts to be \npaid or the numbers of new apartments  to be allotted. Even  the original allotment \nletters claimed by the Complainants  at Sr. Nos. 3 & 4 which  have been issued by the \nRespondent No. 2 herein  have not been uploaded  by them .  Page 10 of 12 \n 11. It is pertinent to note that the fresh allotments issued by the Respondent No. 1 to the \nComplainants at Sr. Nos. 1 & 2 at para No.5 stated as follows:  \n“5. Subject to force majeure as well as other circumstances beyond our control including Policy of the \nGovernment/MCGM and sanction of the plans and requisite permission in time, we propose to complete the \nbuilding and offer possession within a period of 24 months from the date hereof with a grace period of 6 months. ” \n \n12. It is pertinent to note that the said assignment deed at recital W stated the following:  \n “W. The Assignee/ Developer confirms that they will carry out and complete the construction and offer \npossession of the premises to the existing members of the society w ithin the period stipulated here under read \nwith Development Agreement dated 13.05.2008 and the Terms dated 13.05.2015 subject to force majeure and/or \nother circumstances beyond the control of the Assignee. The Society confirms that period of 21 months dur ing \nwhich the Assignee/ Developer could not get permission to carry out construction will not be taken into \nconsideration while calculating the aforesaid period.”  \n \n13. It is thus clear that subsequent to the said consent terms filed as a result of the said \narbitration petition the transactions between the Part ies were to be carried out as per \nthe said consent terms. These said consent terms  were agreed upon and executed \nsubsequent to an arbitration plea under the oversight  of the Hon’ble Bombay High \nCourt . Thes e said consent terms predate the notification giving effect to the said Act. \nWith th ese said consent terms  on record, the Parties today have no option but to \nfollow the terms as envisaged  and laid out therein . As mentioned above the said \nconsent terms  have very clearly dealt with the  escalation amounts, the completion \ndates and such other items that are necessary to conclude a real estate project.  The \nParties should have executed sale deeds  / agreement for sale  in keeping and in line \nwith these consent terms. With these said consent terms  on record the Authority has \nno mandate to interpret them and adjudicate upon the manner and the conditions \nthat should be a part  of the sale deed  / agreement for sale  to be exe cuted between \nthe Parties. These said consent terms were executed before the advent of RERA and \nas a part of the arbitration proceedings. Thus, issues relating to its interpretation \ncannot be a part of an adjudication process of this Authority.  \n \n14. The Compl ainants at Sr. Nos. 1 & 2 and the Respondent No.1 must hence proceed to \nexecute the agreement for sale as laid out in the said consent terms . The Authority \nsees no reason to intervene in the same. With respect to reliefs under Section 18 for \nthe Complainants at Sr. No. 1 & 2 it is to be noted that subsequent to the said consent Page 11 of 12 \n terms  no document has been executed between the Parties to enable th e Authority  to \nadjudicate upon reliefs that they may be entitled  to under Section 18 of the said Act.  \nThe Parties are seeking reliefs under Section 18 based on allotment letters  which were  \nissued prior to RERA. Not only were these allotment letters issued prior to RERA but \nfurther the said consent terms  executed have overtaken the recitals in the allotment \nletters . The said consent terms  have clearly laid out the profile of the relationship \nbetween the Respondent No. 1 herein  and the Allottees  i.e. the Comp lainants at Sr. \nNos. 1 & 2 herein . The said consent terms  have further gone and have also set out the \nmanner in which any prior  claims and liabilities  would be sought and the Party \nagainst  whom  the same shall be executable.  With the executing of the said consent \nterms a curtain has fallen on all events before that and it is the said consent terms \nthat shall now hold ground and any other document subsequent to this. With these \nbeing the facts,  the Authority observes that the allotment letter  cannot be the basis \nfor determining whether a grievance exists and for which a remedy should be \ngranted. Hence the issue at para No. 7(a)  is answered in the negative .  \n \n15. The Complainants at Sr. N so. 1 & 2 have also sought reliefs with regar d to an order \nof permanent injunction and restraining of the Respondent No. 1 from disposal of \ntheir apartments. Since the Parties have failed to take action subsequent to the said \nconsent terms which has resulted in them failing to re -establish their righ ts and \nobligations it would not be prudent to issue any injunction orders.  Hence the issue \nat para No. 7( b) is answered in the negative . \n \n16. In view of the above Complainants  at Sr. Nos.1 & 2 and the Respondent at Sr. No. 1 \nare directed to take such steps to execute the agreement for sale in keeping with the \nsaid consent terms .  \n \n17. In the complaints at Sr. Nos. 3 & 4 the Complainants have failed to provide the \noriginal allotment  letters . However,  the Authority also notes that the availability  of \nthe allotment letters  has not been challenged. The Authority  would therefore  assume \nthat in view if the fact  that there is no challenge to the statement being made by the \nComplainants  Nos. 3 & 4 , the allotment letters  exist . However,  since the Authority is Page 12 of 12 \n not privy to the allotment letters it would not be able to adjudicate upon the \ngrievances sought to be redressed.  Further  since the said consent terms  are on record , \nthe Authority  will limit itself to directing the Parties to abide by the said consent \nterms while moving ahead  in the matters.  \n \n18. Thus, in view of the above, all the captioned complaints are disposed of . No order as \nto costs.    \n \n19. Further the said Project is lapsed and the Respondent No. 1 has taken no steps till \ndate to seek any extension. This Authority shall keep the said Project registration in \nabeyance  and the Respondent shall not advertise, market, book, sell or offer for sale, \nor invite person/s to purchase in any manner any apartment  in the said Project till \nthe Respondent No. 1 obtains extensions of the said Project from MahaRERA.       \n \n \n  (Ajoy  Mehta)  \n      Chairperson, MahaRERA"
    },
    {
        "file_name": "3.Lifestyle City Kalyan-Platano D.pdf",
        "text": "BEIORE THE MAHARASHTRA REAL ESTATE REGULATORY AUTHORITY,\nMUMBAI\nCOMPLAI NT No: CC006000000O55076\nMr. Shekhor Bhorgov Devlekor ........ Comploinont\nVersus\nM/s. Nirmol Lifestyle (Kolyon) Pvt. Limited ....... Respondent.\nMohoRERA Registrotion No. P51700005451\nCorom: Hon'ble Dr. Vijoy Sotbir Singh, Member-l\nThe comploinont oppeored in person.\nMr. Rohit Chovon o/w Mrs. Voisholi Mohite oppeored for the respondent.\nORDER\n(15ih October,20l8)\nl. The comploinont hos filed this comploint seeking directions from\nMohoRERA to the respondent to poy interest ond compensotion for the\ndeloyed possession under seclion -18 of lhe RERA Act, 2016 in respect of\nbooking of o flot No. D-308, on 3'd floor, in the respondent's proiect\nknown os \"lifestyle City Kolyon Plotono D\" beoring MohoRERA\nRegislrotion No. P5'1700005451 ot Kolyon, Dist. Thone.\n2. The motter wos heord on 5th Octob er, 2018, when both the porties\ninformed MohoRERA thot they filed o joint undertoking on record of\nMohoRERA stoiing thot they will file consent terms on record of MohoRERA\nwithin o period of one week. Accordingly todoy, it wos brought to the\nnotice of the MohoRERA thot they hove settled the motter omicobly ond\nolso filed consent terms doted lltn Ociober, 2018 on record of\nMohoRERA. The some is ioken on record.\n3. ln the light of obove, the comploint stonds disposed of os withdrown.\n(Dr. Vijoy Sotbir Singh)\nMember-l/MohoRERAJ^.t-rl^^.BEFORE THE MAHARASHTRA REAL ESTATE REGULATORY AUTHORITY, MUMBAI Non- Execution Application in  Complaint No.CC006000000055076 Mr. Shekhar Bhargav Devlekar      .... Complainant Versus M/s. Nirmal Lifestyle (Kalyan) Private Limited   ….  Respondent Project Registration No.P51700005451 Coram:  Dr. Vijay Satbir Singh, Hon’ble Member – 1/MahaRERA The complainant   appeared in person.    Adv. Tushar Kadam a/w Vaishali Mohite appeared for the respondent.  ORDER (16th October, 2020) (Through Video Conferencing) 1.The complainant above named has filed this application for non-execution of order dated 15th October, 2018 passed by the MahaRERA  in the aforesaid complaint filed with respect to project registered by the respondent with MahaRERA. By the said order, the complaint was disposed of in view of the consent terms filed by both the parties on record of MahaRERA. Accordingly, the complainant had withdrawn this complaint.  2.This application was heard finally today as per the Standard Operating Procedure dated 12th June 2020 issued by MahaRERA for hearing of complaints through Video Conferencing. Both the parties were issued prior intimation of the hearing. Accordingly, both the parties appeared and made their submissions. 3.During the hearing, the complainant has informed MahaRERA that till date, the respondent has not adhered to the consent terms signed by it whereby it has agreed to pay monthly interest. The respondent has paid interest for  one year and there is no further communication from the respondent for the said balance interest payment.   4.During the hearing, it was noticed by the MahaRERA that no order has been passed by the MahaRERA in the complaint filed by the complainant. Moreover, the complainant has withdrawn this complaint in view of the settlement arrived at between the parties out of court. Hence no action can be taken in this non-execution application. Both the parties have to decide the further course of action. The MahaRERA therefore directs the respondent to settle the issues with the complainant and to file compliance report before the MahaRERA.  5.With these observations, the non-execution application stands disposed of.   (Dr. Vijay Satbir Singh)  Member – 1/MahaRERA                                                                                    Non – Execution Application in  \nComplaint No. CC006000000055076  \n \nPage 1 of 4 \n BEFORE THE MAHARASHTRA REAL ESTATE REGULATORY AUTHORITY \nMUMBAI  \nComplaint No. CC006000000055076   \nShekhar Bhargav Devlekar       ... Complainant  \nVersus  \n1. Nirmal Lifestyle (Kalyan) Private  Limited     \n2. Shri. Rajeev Ramesh Jain     \n3. Shri. Dharmesh Sardarmal Jain     \n4. Shri. Chandrakant Hiralal Shah      ... Respondent s \nMahaRERA Project Registration No. P51700005451   \nCoram :  Shri. Mahesh Pathak, Hon’ble Member – I/MahaRERA  \nThe complainant appeared in person.  \nMrs. Vaishali Mohite, Authorised Representative appeared for the respondent.  \n \nORDER  \n(Wednesday, 25th  October 2023 )  \n(Through Video Conferencing)  \n \n1. The complainant above named ha s filed this application for non – execution of \nthe final order dated 15 -10-2018 passed by the MahaRERA in the aforesaid \ncomplaint filed with respect to the project registered by the respondent with \nMahaRERA. By the said order this complaint was disposed of as withdraw n \nas the parties ha d settled the matter amicably and filed consent terms dated \n11-10-2018 on record of MahaRERA.    \n \n2. Alleging that the  respondent has not complied with the terms and conditions \nof the said consent terms dated 11 -10-2018 filed before the MahaRERA, the \ncomplainant herein had filed this non -execution application before the                                                                                    Non – Execution Application in  \nComplaint No. CC006000000055076  \n \nPage 2 of 4 \n MahaRERA on 24 -12-2018.  \n \n3. Accordingly, the Ld. Erstw hile Member -1/MahaRERA heard this non -\nexecution application and passed a final order on 16 -10-2020. The said order \nreads as under: -  \n“4. During the hearing, it was noticed by the MahaRERA that no order has been \npassed by the MahaRERA in the complaint filed by the complainant. Moreover, the \ncomplainant has withdrawn this complaint in view of the settlement arrived at \nbetween the parties out of court. Hence no action can be taken in this non -execution \napplication. Both the parties have to decide the furt her course of action. The \nMahaRERA therefore directs the respondent to settle the issues with the \ncomplainant and to file compliance report before the MahaRERA.  \n5. With these observations, the non -execution application stands disposed of.”  \n \n6. Despite directions given by the MahaRERA, the respondent did not settle the \nmatter with the complainant. Hence, the complainant again pressed for an \norder on this non -execution application filed by him.  \n \n7. Thereafter, this non -execution application was tran sferred to the \nSecretary/MahaRERA by virtue of the MahaRERA Order No. 15 of 2020 dated \n24-11-2020, whereby the power of the MahaRERA under section 40 of the \nRERA was delegated to the Secretary/MahaRERA.  \n \n8. Accordingly, this non -execution application was heard by the \nSecretary/MahaRERA on 17 -12-2021, when the following roznama was \nrecorded in this application: - \n“Heard the arguments of the complainant. The complainant submitted that, though \nthe complaint was settled by the respondent, the consent terms are not yet                                                                                    Non – Execution Application in  \nComplaint No. CC006000000055076  \n \nPage 3 of 4 \n complied. The complainant therefore sought action against the respondent. In the \npresent case, no order on merits of the complaint has been passed by MahaRERA. \nThe complaint therefore stands transferred to the Bench of MahaRERA for \nappropriate deci sion”  \n \n9. Accordingly, this non -execution application was heard by the MahaRERA on \n23-10-2023  as per the Standard Operating Procedure dated 12 -06-2020 issued \nby MahaRERA for hearing of complaints through Video Conferencing. Both \nthe parties have been issued prior intimation of this hearing and they were also \ninformed to file their written submissi ons, if any. Accordingly, both the parties \nappeared and made their respective submissions.   \n \n10. During the course of hearing, the MahaRERA has noticed that admittedly, \nthere is proceeding filed against the respondent herein before the National \nCompany Law Tribunal  (NCLT) bearing  CP N o. 1337  / MB / 2020 . In the \nsaid matter an order dated 16 -06-2022 has been passed by the NCLT, whereby \nthe  IRP has also been appointed .  Further, the said  order has also been upheld \nby the Hon’ble N ational Company  Law Appellate Tribunal vide  an order \ndated 04 -01-2023 in  an appeal no. (AT) (Insolvency) No. 697 of 2022.   \n \n11. In view of the subsequent development in this matter, the ideal course of \naction for the complainant would be to file a claim before the said R esolution \nProfessional  (RP) .  \n \n12. However, during the course of hearing, the complainant has stated that  he has \nfiled his  claim before the RP on 01 -08-2022. The  respondent during the course \nof hearing has undertaken to facilitate the complainant regarding the same.  \n                                                                                    Non – Execution Application in  \nComplaint No. CC006000000055076  \n \nPage 4 of 4 \n 13. In the present case, section 14 of the Insolvency and Bankruptcy Code, 2016, \nmandates a moratorium on the institution and continuation of legal \nproceedings against a Corporate Debtor in res pect of which an order of \nadmission into CIRP has been passed by the Adjudicating Authority  which  \napplies to the respondent   herein.  \n \n14. Hence institution of suits or continuation of pending suits or proceedings \nagainst the respondent including execution of any judgment, decree or order \nin any court of law, tribunal, arbitration panel or other authority is prohibited.  \n \n15. In view of the above, the MahaRERA cannot proceed to decide this  non -\nexecution application  against the respondent at this stage. However, t he \ncomplainant is at liberty to agitate his claim of refund before the RP if he so \ndesires. The respondent is directed to provide its assistance to the complainant \nas agreed during the course of hearing.  \n \n16. With these observations, the present non -execution  stands disposed of.  \n \n \n(Mahesh Pathak)  \n  Member – 1/MahaRERA"
    },
    {
        "file_name": "2.UK Iridium.pdf",
        "text": "Complaint No. CC006000000480080  \n \nPage 1 of 3 \n BEFORE THE MAHARASHTRA REAL ESTATE REGULATORY \nAUTHORITY, MUMBAI  \n  Complaint No. CC006000000480080  \nSachin Babu Gurav       ... Complainant  \nVersus  \nDamodar Suruchi Developers Pvt. Ltd.    ... Respondent  \nMahaRERA Project Registration No. P51800007275  \nCoram :  Shri. Mahesh Pathak, Hon’ble Member – I/MahaRERA  \nNone  appeared for the complainant .  \nLd. Adv Samrudhi Gurav a/w Ld . Adv Sunilraja Nadar  appeared for the \nrespondent.   \n \nORDER  \n(Monday, 22nd July 2024)  \n(Through Video Conferencing)  \n \n1. The complainan t above named has filed t his online complaint before MahaRERA \non 14-04-2024  mainly seeking directions from MahaRERA to the respondent  - \npromoter to  handover the possession and also  to pay interest and compensation \nfor the delayed possession as prescribed under the provisions of section 18 of the \nReal Estate (Regulation & Development) Act, 2016 (hereinafter referred to as \n‘RERA’) in respect of the booking of a  flat bearing no. 108 in Wing B  in the \nrespondent – promoter’s registered project known as “UK Iridium ” bearing \nMahaRERA registration no. P51800007275  located at Kandivali East , Mumbai.   \n \n2. This complaint was  heard by the MahaRERA on 09-05-2024  as per the Standard \nOperating Procedure dated 12-06-2020  issued by MahaRERA for hearing of \ncomplaints through Video Conferencing. Both the parties have been issued prior \nintimation of this hearing and they were also informed to file their written Complaint No. CC006000000480080  \n \nPage 2 of 3 \n submissio ns, if any. Accordingly,  both the parties  appeared for the said hearing \nand submitted that they are ready and willing to resolve the matter  amicabl y \nthrough MahaRERA Conciliation Forum. Hence, on request of both the parties , \nthis complaint was  referred to MahaRERA Conciliation Forum for further \nappropriate action.  \n \n3. Accordingly, both the parties appeared before the MahaRERA Conciliation \nForum  finally on 28-06-2024  when they resolved  the matter amicabl y. The same \nis recorded in the proceedings of the MahaRERA  Conciliation Forum.  \n \n4. Thereafter, th is complaint was transferred to this Bench, by the MahaRERA \nConciliation Forum on 05-07-2024 with the remarks as ‘Conciliation Successful’.  \n \n5. Accordingly, this complaint was  scheduled for hearing today  when  the \nrespondent appeared and made its submissions. However, despite the notice of \nhearing, the complainant remained absent.  \n \n6. During the course of hearing , the respondent has submitted that both the parties \nhave settled the matter amicably before the MahaRE RA Conciliation Forum.  \nAccordingly, both the parties have signed the consent terms dated 07 -06-2024.  \nThe respondent has uploaded the copy of the consent terms along with \nwithdrawal application dated 07 -06-2024 duly signed by both the parties on \nrecord of M ahaRERA on 27 -06-2024. However, t he complainant, despite the \nnotice of hearing,  has  neither appeared for the hearing today nor has filed any \nreply / written submissions on record of MahaRERA objecting to the  said \nconsent terms /withdrawal application dated 7 -06-2024 . Hence, the said the \nconsent terms  and withdrawal application dated 07 -06-2024  are  accepted and \ntaken on record .  \n Complaint No. CC006000000480080  \n \nPage 3 of 3 \n 7. In view of the above, since both the parties have settled the matter amicably  and \nsigned the consent terms , nothing survives in this complaint.  \n \n8. Consequently, th e present complaint stands disposed of  as settled and \nwithdrawn as per the said consent terms  dated 7 -06-2024 .  \n \n \n(Mahesh Pathak)  \n                                                                                        Member – 1/MahaRERA"
    },
    {
        "file_name": "1.Tropical Phase II.pdf",
        "text": "Complaint No. CC005000000258951  \n \nPage 1 of 2 \n BEFORE THE MAHARASHTRA REAL ESTATE REGULATORY \nAUTHORITY, MUMBAI  \n  Complaint No. CC005000000258951   \nShirish Govind Sukhatme     ... Complainant  \nVersus  \nM/s.  Om Developer      ... Respondent  \nMahaRERA Project Registration No. P52100008711  \nCoram :  Shri. Mahesh Pathak, Hon’ble Member – I/MahaRERA  \nThe complainant appeared in person.  \nNone appeared for the respondent.   \nORDER  \n(Monday, 24th July, 2023)  \n(Through Video Conferencing)  \n1. The complainant above named has filed this online complaint before \nMahaRERA on  02-06-2023  mainly seeking directions from MahaRERA \nto the respondent to show the flats purchased by him as sold inventory \nin the project  as prescribed under the provisions of the Re al Estate \n(Regulation & Development) Act, 2016 (hereinafter referred to as \n‘RERA’) in respect of the booking of 12 flats in the respondent’s \nregistered project known as “Tropica Phase II ” bearing MahaRERA \nregistration no. P52100008711 located at Pimpri Chinchawad (M \nCorp.), Dist. Pune.  \n \n2. This complaint was heard today  as per the Standard Operating \nProcedure dated 12/06/2020 issued by MahaRERA for hearing of \ncomplaints through Video Conferencing. Both the parties have been \nissued prior intimation of this hearing and they were also informed to   Complaint No. CC005000000258951  \n \nPage 2 of 2 \n file their written submissions if any. Accordingly, the complainant  \nappeared for the said hearing and made his submissions.  However, \ndespite notice, the respondent remained absent.  The MahaRERA \nheard the submissions  of the complainant and also pursued the \navailable records.  \n \n3. During the course of hearing today, the complainant has contended \nthat he has booked 12 flats in the respondent’s project. However, the \nrespondent has not shown the said 12 flats as ‘sold invent ory’ in the \nMahaRERA project registration details. Hence, he  has filed this \ncomplaint.  \n \n4. However, the MahaRERA has verified the said prayers of the \ncomplainant  and informed the complainant that the said flat numbers \nare reflected / mentioned in the sold/unsold  inventory uploaded by \nthe respondent on MahaRERA website with respect to this project \nregistration  no. P52100008711 .  \n \n5. Accordingly, the complainant has verified the said fact from the \nMahaRERA website and has filed a withdrawal application on record \nof MahaRERA today. The same is accepted and taken on record.  \n \n6. Consequently, th e present complaint stands disposed of as \nwithdrawn . \n \n(Mahesh Pathak)  \n                                                                               Member – 1/MahaRERA"
    }
]